{"name": "alinea-chicago", "reviews": [{"review": {"des": "I expected to be disappointed. It's so expensive and over-hyped, I thought there was no way it could possibly live up to expectations. Well, it did. <br><br>Chef Achatz melds the senses in a way I haven't experienced before. To me, the evening was not all centered on taste. I can still smell the special surprise that came with our Thai dish and I remember feeling so moved by the music that was playing while I tasted the Wagyu. <br><br>My husband put it this way: consider it an evening at a theater. Enjoy the performance. Sink in and forget about the dollar amount. And most of all, stay grateful and stay humble. There were some other arrogant diners in the Gallery where I was,m and I found that disappointing. This is a once-in-lifetime meal, so come with an open mind and heart and you will not be disappointed. Thank you so much Chef Achatz.", "pics": null}}, {"review": {"des": "One of the greatest experiences of my life. <br>Taste bud explosions. <br>Sensory overload. <br>The food... still speechless. You'll have to find out for yourself. <br>Impeccable service at the chef's table. <br>You are all rockstars.", "pics": null}}, {"review": {"des": "We partook of the Salon menu on a Monday evening, just before they took the rest of the week off for Thanksgiving.<br><br>Reservations: Tock worked seamlessly! Slots are released on the 15th of every month at 11 am CT (two-and-a-half months in advance). Whereas Salon bookings remained available for a number of days, tables in the Gallery were snapped up in a matter of seconds to minutes.<br><br>The visit: Shrouded in suspense and mystery, our experience exceeded expectations! Without divulging too much, we were deftly guided along what transpired to be well over a dozen themed courses, plus a kitchen \"field trip\". It felt as though we commenced by the shores of a lake or seaside (with distinct elements of ocean/freshwater and sand), and then proceeded to the woodlands and highlands. Moreover, we simultaneously trotted across the globe, from Japan to 15th century Mexico.  At the start of the dessert courses (which included the fabled balloons), the Storm section of Rossini's William Tell Overture broke out right on cue, with the formidable brass notes blaring up the elaborate stairwell!<br><br>Drinks: Their lychee-infused iced tea was fantastic! Incidentally, lychee featured prominently in the first course of the menu. Perhaps the one minor drawback of the evening was the cappuccino, which was served a tad too tepid.<br><br>Service: Stellar service all around, from the amiable hosts and valet (thumbs up for keeping our coats toasty and lending guidance on street parking!) through to the convivial maître d' and his tremendous team. The kitchen staff were equally beguiling, and graciously welcomed us to take a second peek at HQ. Yep, we stole a glimpse of the revered Chef Grant Achatz! <br><br>Verdict: A brilliantly executed combination of fine art, theatre, science and exceptionally progressive American gastronomy! A decadent experience that transcends the senses - the ultimate joie de vivre!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/e293Lk_iOUy4ZSifi93AQA/348s.jpg", "caption": "SPOILER ALERT: Salon menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-S2xHwM1x6VPmr5oRmt6dg/168s.jpg", "caption": "Salon menu: crossword key"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ENyj-HUbLbK5-k9HnNWTaw/168s.jpg", "caption": "Corn: adorned with a caramel liquid \"explosion\"."}]}}, {"review": {"des": "We got lucky and snagged a 2 person reservation for the Gallery. Having been through the Salon just a couple months ago, I wasn't sure if the dining experience would be any different since I was back so soon. I was definitely wrong! <br><br>If you've only done the Salon experience, try and get tickets for the Gallery. It seems that with the winter months approaching, it's been easier to get seating for 2 in the Gallery. Not only are there extra courses but prepare yourself for a whole new set of surprises!  The menu had some similarities but also very very different. If the Gallery was able to provide a completely different experience, I can only imagine what their Kitchen Table must be like!", "pics": null}}, {"review": {"des": "I've dreamed of dining at Alinea for over 5 years now. It's hard to anticipate something for so long and fantasize about it but still have it meet and exceed expectations.<br><br>The thousands of glowing reviews speak for themselves, but Alinea is on another level! This is not just a restaurant, it's an entire experience. There are reasons why everything is placed and set the way they are. Even the minor annoyance of dining as a party of 4 -- when booking tickets I found this requirement to be very cumbersome, but once I dined there the experience was much better with more friends than just my significant other. <br><br>Their attention to detail is also remarkable. They waitress overheard us as we were leaving and offered to help us obtain a reservation at the aviary. Once there, they knew our allergies, celebrations, and even our food allergies. Amazing! <br><br>Everything is a surprise so without ruining too much, I loved it so much I would love to come back again next time I have an opportunity to visit Chicago. Thank you chef Grant Achatz for making my birthday unforgettable!", "pics": null}}, {"review": {"des": "I've been waiting so long to try Alinea. Even before the Chef's Table episode. Was it overhyped? Were the expectations too high? Possibly, but what it came down to was the flavor of the food. <br><br>It's hard to even explain the degustation journey that we embarked on, but I think of the 22 menu items we tried, there were few that stuck out, flavor-wise. There were also many interesting textures, but not the ones that were particularly enjoyable. It was also tough to understand any cohesive theme as many displayed use of molecular gastronomy; but I think it was used to showcase the technique rather than the food. <br><br>We started with a communal salad with avocado, kiwi, cucumber, and herbs with a light dressing sprayed on with a perfume sprayer. There were whispers that it felt like we were eating just flowers. The best part was the little brioche bun that came with the salad. Biting into it, I was surprised with the filling of mushroom, feta cheese, and jalapeno. We were then whisked alway to a tour of the kitchen where we had a drink and a small bite with puffed pizza dough (gnocco fritto) filled with caramelized mozzarella and Parmesan cheeses, brushed with rendered pepperoni, and dusted with tomato powder, fennel pollen, and garnished with fresh basil. When we returned, our communal table had been broken down into our individual tables (which was a fun surprise).<br><br>From then on, we the meal became a blur as we had plate after plate of visually-stimulating dishes. I did enjoy the cultured charred onion cream - that smokey smell still lingers in my mind. The sunflower petals with toasted sunflower seed custard, sunflower leaf oil and golden Osetra caviar was a beautiful presentation. The scallop, mustard, and chili Thai noodle dish was THE most flavorful dish of the evening and a standout. The shot of lemongrass that accompanied it was one of the most visually appeasing dishes, which glowed in the dark dining room.<br><br>The next few dishes including the Korean BBQ glazed octopus with pyrolyzed Negi onions, the nori roll, and the langoustine \"paper\" were misses for me. Although fun, the \"clam chowder,\" with the potato that had been cooking in front of us was one of the biggest misses. I really did not enjoy the flavor of that chowder.<br><br>The next course after this was the wagyu, foie gras, and matsutake. How can you screw up wagyu at a three star Michelin restaurant? You can't. The wagyu, pan roasted with herbs, garlic, pepper and butter was kept simple and amazing as it usually is and one of my favorite bites. We dined to the music of composer Gioachino Rossini. The next dish, many at the table did not enjoy, nor finish. The chilled peach and begonia soup, heirloom tomatoes, mascarpone, nasturtium and honey was too chilled to enjoy, but I did enjoy that lovely heirloom tomato flavor.<br><br>The transition dish with Palo Santo ice cream, charred tamarind meringue, grilled pineapple and candied Hoja Santa was also a great dish. Loved this as a dessert. It was served with Mexican hot chocolate milk punch.<br><br>The next couple of nolstagic dishes featured the classic helium sugar balloon which was green apple flavored. The caramel popcorn liquid was also a fun presentation. Then, of course the finale with the multitude of frozen treats and sweets that were painted on our table was quite the spectacle. <br><br>I think both chef Grant Achatz and Simon Davies are creative geniuses and are doing amazing things. Overall, if you come here, view it more as performance art that you're paying a hefty price for. We spent $428.16 (gratuity and tax included on Tock) for a meal in The Gallery. Was it worth it for the food? Probably not. Was it worth it for the experience once? Definitely!", "pics": null}}, {"review": {"des": "Wow. I do not even know where to begin to even portray, literally, the best meal I have ever had in my lifetime, and probably for all of my lifetime. Even from my small handful of Michelin's and fine dining experiences, nothing prepared me for the endless surprises, the captivating experiences from the variety of ambiences, flavors in all of my senses. Did that even make sense? I will try to relive my experience at Alinea.. put into words. But I already know that nothing I say, no picture I take, will even make you guys understand why this was the best meal I have ever had.<br><br>You can also watch Chef's Table, Season 2, Episode 1, that features Chef Grant Achatz and his restaurant Alinea. The episode gives a brief biography of the Chef, which I am so grateful to have watched the next evening after my meal because it gave me a whole new found respect for the chef and his creations. It also didn't ruin the surprise for me.<br><br>Did I mention, this is the first time I did not research ANYTHING online, on yelp, whatsoever. I just went by my friend's word. We must eat here in Chicago. It is a 3 Michelin star restaurant. It used to be #1 in the entire world at one point. Now it's like #16 or #24 or #26. But whatever it is, it is still top 50 Best Restaurants in the World.<br><br>I asked our waiter, \"Will we get a copy of the menu at the end so that we know what we ate?\" He replies, \"This is your menu. Everything is on there.\" It was a crossword puzzle! Or not that one.. the other one. Let's find the words! Throughout our meal, we found words before OR after we were already served the food. So it was fun to play with, fun to guess with. I remember at one point, we circled \"Nostalgia\" and we kept wondering.. wow is this dish nostalgic? No.. this one is... no, wait, this dish is nostalgic! Just this simple menu game kept us guessing, kept us engaging with each other, kept us intrigued with our food. But that's not just it.<br><br>It wasn't just about food anymore. It was about experience and surprises and emotions. I won't get into detail because I don't wanna ruin the surprise... <br><br>not everything is going to be what it seems. He likes to trick the senses. What May smell like something is something else. What tastes like something is something else. What looks like something is something else. You'll be surprised at every turn in every way possible. <br><br>You get a little field trip to the kitchen ;)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/C_lHbrA-q8In37TL2gbdpA/348s.jpg", "caption": "The Cape. Clam, potato, bacon. Each bite that you take from the soup, it disappears into air"}]}}, {"review": {"des": "Overall sentiment of Alinea is a must try! This place blows you away with the smoke and mirrors and takes dining to a whole new level. I ordered the wine pairing, which was hit or miss. Some pairings were excellent while others left me wondering what happened. I personally wouldn't get it again. <br><br>The entire meal is 16-18 courses along with 6-7 wine pairings. I see this meal as a fully immersive experience instead of treating every course as it's own individual thing. <br><br>Highlights of the meal.<br>Foie gras and black caviar mix.<br>orange cocoa nibs<br>squid ink balls - fully dark tasting experience<br>A5 wagyu - Savory and earthy. Pairs well with the earthy wine. Grandiose classical music as the meat is being cut and served. Meat was not as hot as it could have been since it took them awhile to serve it. <br>edible balloon<br>dessert finale<br><br>SPOILERS<br>The meal begins with everyone seated at a long table. After a short stint into the kitchen, we came back to the dining room to find that all the tables had been rearranged to be more intimate. Very novel and demonstrates how important the arrangement of the furniture can be.<br><br>The finale is at the very end when the dessert arrives. Never had anything quite like it and it was certainly splashy and delicious at the same time. They take the decorations hanging from the ceiling and create the dessert in front of you.", "pics": null}}, {"review": {"des": "A once in a lifetime experience that I'm no lucky enough to have been two twice. I was honestly a bit worried that dishes from my last visit 6 years ago would be repeated (not that they were bad at all, but rather so creative I thought they were signatures). The only repeat was the now famous dessert balloon. I don't want to share too much and spoil the fun surprises at dinner. <br><br>Alinea is a world class restaurant that keeps getting better. This is not a restaurant where technique is a gimmick- it easily could go that way but chef Grant (who was there making sure things were as they should be for dinner on a Monday night, and nice enough to wish my brother good luck on a new endeavor). <br><br>Amazingly the food was delicious and the experimental techniques and environment only support it (Wagyu Rossini with Rossini anyone?). It used to be like the meal was a show and now it feels like an adventure. <br><br>Watch Chefs table and read Life on the Line before you go!<br><br>Only complaints are that the lucite table top was a bit cracked and server told us it was \"vintage\".", "pics": null}}, {"review": {"des": "A fantastic experience I think everyone should try at least once if they have the chance.<br><br>Alinea is undoubtedly one of the most unique places I've had the pleasure to dine at. Strangely, with all the glamour and showmanship, my favourite part of the night was how perfectly cooked the bincho charcoal seared squab was. <br><br>It was, perhaps some of the best squab I've had in a long while and I couldn't help but think back to it every single time I've had squab since. Strange then, that this comparatively simple dish left such an impression over all these amazingly creative plates.<br><br>Don't get me wrong, Alinea was great, and it certainly had its fair share of moments which I don't want to spoil in a review. But I've been wowed more elsewhere and it wasn't as memorable as I had expected. <br><br>I was at the Salon twice. Maybe a gallery seating would change my mind.", "pics": null}}, {"review": {"des": "Finally made my pilgrimage to a restaurant that I have always looked up to (in my own cooking at home) and has firmly held the #1 spot I wanted to visit in the world after el bulli closed many years back. With so much anticipation I wondered if they could live up to my dream of what it might be. In the end while it may not of been the absolute best menu I've eaten (something that does carry a significant degree of subjectivity) it was an experience like none other. 4.5 stars but without half star ratings on yelp I'll give it the full 5, maybe it's the mystique, maybe it's the degree to which I admire Achatz approach but almost certainly it's the perfect cuisson with obsessive attention to technique. <br><br>The service is impeccable, attentive and they find a balance in necessarily formal but still laid back. I was particularly impressed by the sommelier in both his knowledge and ability to convey it to dinners. The pairings were generally very thoughtful and did add to the experience (as two dinners we split a wine pairing which was absolutely the right call, with enough for each to try the wine 3 times).  The food is supremely delicious, although some courses to my palate were subtly off balance (perhaps a touch salty and umami heavy at times).  The show, and don't kid yourself you are coming to see a show with dinner, is thrilling, inventive, at times interactive and a full sensory experience. I think this is what attracts people to Alinea and it fully lived up to the bill. <br><br>Was I thrilled? Absolutely!! Was it delicious? No question. Was it the best meal ever (as it was my first 3 star dinner)? Probably not. Will I be back? Try and stop me!!!!", "pics": null}}, {"review": {"des": "What a once in a life time experience. I can understand why it received 3 Michelin stars and is rated within the best 50 restaurants in the world! Although I heard that past menus (since they change their menus every so often) was way better than what I had. <br><br>Reservations are hard to come by, make sure you read when you can sign up for reservations. I believe it's every 15th of the month at like 9am or some early time depending on what time zone you're in, that you can reserve for the next month or two. I booked it right when it came out and since I was going on a holiday weekend, it sold out instantly. I was lucky enough to get my hands on a 5:45pm reservation though. We did the cheaper tier since there are two prices. The more costly tier allows you to sit at the chefs table and has more display artwork with the food. <br><br>It's nice that you prepaid for it so you go there and simply enjoy. Although we added 2 wine glasses and a wine pairing to our bill since we didn't book that beforehand. Everything is a surprise. All we are given is this wordsearch on the table that has part of what we're eating on it. It was hard not glancing at other people's tables to see what they were having. Each item came out and each was delicious and different from anything we had before. The food kept surprising us. <br><br>At one point during dinner, they invited everyone in the room to go downstairs to the kitchen to enjoy a bite and drink, which I thought was unique and fantastic. In the kitchen, it was cool to see them mass make plates and to absorb everything in. Once our bite was over, we went back upstairs to continue our dinner. <br><br>I don't want to spoil the menu but the dessert was aboslutely amazing. That banana looked so real and it was sooooooooo good. The Instagram photos that you normally see is the candy balloon. It's difficult to take a photo with it. Unfortunately, my boyfriend's balloon deflated when it got to him, but our server was nice to get a new one. But by the time he got a new one, my deflated and we weren't able to get a nice photo together with it. We did, however, suck the helium in and our voices were squeaky momentarily. <br><br>Overall, we enjoyed the experience. I think people over hyped it for me that I didn't believe it was AMAAAAAZING LIKE OH MY GOD, but it was definitely an experience. I don't know if I would do it again, maybe in the long future. The price is really decent for a 3 Michelin stars, given that anything in the bay area is at that price already for 1 star or less.", "pics": null}}, {"review": {"des": "Chef Achatz's mastery of flavor, cooking techniques and his creativity will surely get a nod from even the pickiest eaters. It doesn't take long to realize that you expect the unexpected at Alinea starting with the menu which is presented as a crossword puzzle. <br><br>The highlights of the night included the Ranina, Ranina, Pizza puff, Perfume course with the scallops, and the Squab roasted in coal. Each meal is arranged with such care, precision and timed perfectly for a harmonious meal. From amuse bouches to tantalize your taste buds to palate cleansers before dessert, you certainly get a range of little bites over the course of your meal. I also enjoyed the kitchen tour and the whole night lived up to the hype. There was only one dish that really didn't agree with me but 1/12 isn't bad at all. Because of their ever changing menu, I've heard rumors that the previous dishes were more outstanding but I think that varies with the individual's preference. Balloon and the banana dessert were just AWESOME (do it for the gram). <br><br>Now the price and the ease of getting a reservation was my least favorite part haha I live on the east coast and it's easier to get reservations in New York cities finest restaurants than it is to get one at Alinea. The price is also more than some of the 3 Michelin Star restaurants such as Eleven Madison Park in NYC but the gallery offers much more tastings which validates the price. I finally managed to get a reservation at the salon and I think it was well worth it. Getting a table at the gallery requires much more preplanning and time but I'm sure it's worth it. I did enjoy my salon experience very much but hopefully I'll be back for the whole shebang another time. <br><br>After eating at countless restaurants (casual & fine dining alike), I can vouch for the experience at Alinea - there's nothing that comes close to it. Every chef can cook a delicious meal but how many actually dare to get you outside your comfort zone and make you pay attention to your surroundings? Bravo, Bravo, Bravo! And do yourself a favor and don't try to research too much before your reservation. Half the fun is in the surprise!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/I382hkHkHQRG-FUby3mbVA/348s.jpg", "caption": "Terrarium"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SlcDp3QCk3kmEp16SQGXQA/168s.jpg", "caption": "My favorite dish of the night - Ranina Ranina!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/E-hjzPdviijFRojcQC2iCQ/168s.jpg", "caption": "Crunch!"}]}}, {"review": {"des": "Booked 3 mths ahead for an early bday celebration for hubby. I also watched the Chef's table episode on Netflix before we went. Heard so much about the restaurant and the Chef. Flew from Los Angeles to Chicago just for this meal and of course touring around the city. <br><br>I'll let my pictures tell the story rather than ruining the experience for you. Just go with an open mind: let your eyes enjoy the food of Cirque De Soleil performance and allow your taste buds to embrace every bit of flavor dancing about in your mouth. <br><br>It felt like we woke up from a sweat dream...it'll be a meal to remember for a lifetime!", "pics": null}}, {"review": {"des": "You can always find excellent food at many restaurants, but not too often can you have so much fun while enjoying delicious food. The experience at Alinea was very unique and entertaining, which made Alinea a step above other restaurants. <br><br>It seems like they change their menu quite often, so it probably won't help much listing the dishes we had last night. Overall, the food was delicious, but some dishes are too savory for me. What impressed me the most was Alinea put a lot of thought in presenting the food.<br><br>The plate was nicely decorated and the way the food was delivered was entertaining. For example, they lit up a bowl of salt while we had some octopus. The room was dark, so it felt like we were deep in the ocean. After the dish was finished, they turned on the lights and dug out a potato from that pile of salt and start preparing clam chowder.<br><br>Surprises are also throughout the meal. Who would have thought they put two vanilla-pod-looking beef jerky in a vanilla jar lol. We also got a chance to enjoy one dish in their kitchen and they totally changed the dining room setting when we are back.<br><br>Although the meal took us 3 hours, we had a blast. Hopefully we can get enough people next time so we can try the Kitchen Table.", "pics": null}}, {"review": {"des": "I'm going to do like most people and refrain from writing 3,000 -5,000 words, attempting to summarize this experience. Because you can't.<br><br>Logistically, reservations go live 2 months in advance at 10am on the 15th. You choose your \"ticket\" to the show, and prepay in advance, with a variety of packages / budgets available. No refunds, so make sure your group is solid.  They typically prefer seating in 4's, so great double-date spot... just as long as this isn't your first date.... Or 10th. Wouldn't be bad spot to take the parents either, but definitely leave the kids with the babysitter on this one. <br><br>Leading up, whoever made the reservation will correspond with a team member, on a couple of occasions, to confirm attendance and cover any dietary restrictions. One of our group members is a veg, and I'm allergic to shellfish, so they modified accordingly. After we sat down, they confirmed who was who, and never again was there a mention or a mix-up. As a matter of fact, at the end of the meal I said something along the lines of \"despite tonight's selections being laden with shellfish, I wouldn't have known I had a substitute unless I had been told.\" So there shouldn't be any concern about diluting the experience.<br><br>Inside of the establishment is regal- it's an elegant dining room that their family is \"sharing\" with us. We're dining \"with\" them, as the waitstaff are incredibly friendly, knowledgable and fun. They were pretty playful with our group, which added to the experience. Dress is pretty casual- most men were dressed in blazers, and women in dresses. This was a last-second audible for me (another friend backed out) so I came in my Barron's and a Bomber and didn't feel judged.<br><br>I'll defer on addressing the food or sharing pictures (despite how incredible many of them turned out). The menu rotates often, plus, it's almost certainly more fun to be surprised. There's some really amazing twists and turns along the way.<br><br>For those that read my reviews, I travel to NYC and LA often to visit friends, and love to indulge in fine dining.This is hands down the best place I've ever been to, and it's really not close. My buddy who came with me said it compared nicely to EMP, albeit a much different experience than that is. I think setting expectations heading in is important. If you want the \"best food\" you've ever had in your life, you're misunderstanding the allure of places like this. It's a celebration of culinary ARTS. Everything is intentional! The plates, seating arrangements, decor, presentation, armoas, glasses, and so forth. The attention to detail is astonishing, the team is so well-rehearsed. This is not simply \"dinner,\" this is an \"experience,\" a \"show,\" if you will.<br><br>And one I'll likely remember for the rest of my life. 5/5", "pics": null}}, {"review": {"des": "My boyfriend and I ate here this past Wednesday and it's taken me almost a week to put my experience into words... and believe you me, I'm never at a loss for words.<br><br>I initially wanted to write a review that detailed every dish, choreography and everything in between but then I felt guilty at the though of potentially ruining other people's experiences.<br><br>This will for sure be one of my shortest reviews on yelp, and this is it:<br><br>Alinea is a culinary experience. More than an experience, it's like an artistic expression and so much more. The best meal I've ever had. The professionalism, ingredients, execution, choreography, ingenuity of each course, and laid back style are second to none. <br><br>The staff is incredible and the restaurant isn't stuffy or pretentious.<br><br>Legit. The. Best. Meal. I've. Ever. Had.<br><br>Do yourself a favor right now and don't read any more reviews. Go experience Alinea; it's more than just food.", "pics": null}}, {"review": {"des": "I find Alinea a tough restaurant to review. My experience there was a mixture of revelation and disappointment, but I'm giving it a reluctant five stars because overall it was a very memorable experience. <br><br>Alinea is a bucket list restaurant. A trip down Alice's rabbit hole. It's expensive (very expensive) and difficult to get a reservation. Upon being seated we were served an amuse bouche, in the form of a little clay pot filled with frozen \"snow\" of some kind, fish roe, and some edible flowers and herbs. Was it delicious? Not really, but it was interesting. <br><br>I won't go over every course in detail. Some were very delicious, some were slightly disappointing. There were some theatrical surprises that were definitely brilliant, like when liquid nitrogen is poured over the centrepiece of oranges and you're completely engulfed in a fog of citrusy smoke while eating some orange-shaped bites on a glowing plate, filled with an intense clove-flavoured liqueur. It's an almost overwhelmingly intense sensory experience that is beyond simple categories like \"delicious\". I'm not sure if it was delicious. It was intense, nostalgic and... what's the right word? Beautiful. <br><br>Some of the dishes presented flavours I had never experienced before. I could almost feel my brain creating new neural pathways as it tried to grapple with them. I even had vivid \"flavour flashbacks\" the next day - something I've never experienced before: the memory of redolent juniper smoke, the rich umami of bouillabaisse with it's reconstituted langoustine noodle. <br><br>If I could do it all over again I would have skipped the wine pairings and gone for more courses. The wine was good, but was actually overkill for the small courses (a full glass with every course). I sometimes felt rushed to finish the wine before the next course arrived and felt a bit tipsy by the end of the meal. <br><br>Then of course there is the edible helium balloon. It's hard to give a meal that ends with an edible balloon less than five stars, even though there were some bumps and disappointments along the way.", "pics": null}}, {"review": {"des": "Alinea has 3 well deserved Michelin stars and has been on the list of the best restaurants in the US and it surely lives up to the hype!<br><br>After years of planning, we finally decided to make a reservation just a few weeks prior and were lucky to secure a reservation at The Salon (2nd floor). <br><br>We had about 10 courses in 3 hours and were very full at the end. Each one was creative and stimulated all senses. Don't expect a traditional steak or lobster here. Everything is infused and almost transformed into a unique shape, color or flavor. Molecular gastronomy. The taste is good but it is mainly the presentation and the experience that blows your mind and stimulates all five senses. Be prepared to be surprised along the way. We had:<br><br>1. Terrarium: avocado and beautiful herbs and jelly on a bed of iceberg. Smoked osetra with an edible sunflower<br>2. Ranina ranina: crab, curry, liquid oranges<br>3. Black squid ink pasta <br>4. Langoustine paper in a broth<br>5. Scallop dumpling infused with lavender<br>6. Clam chowder made in front of you<br>7.  Morel<br>8. Squab seared with coal<br>9. A tube with a pineapple/aloe shot<br>10. Banana split with a green apple balloon. Be sure to inhale the helium and say something!<br><br>The service is great and the menu does change every couple months so everyone's experience will be slightly different.<br><br>I especially enjoyed a field trip to the kitchen where they showed us a shaker for our cocktails and of course the famous sugar balloon.<br><br> Hands down, the best culinary experience I've ever had!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KNjfuo-VOa8YMoxDXjPoeg/168s.jpg", "caption": "Cocktail"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4LF0UyQV3hcZ0nP-J6uVSg/168s.jpg", "caption": "Chowder"}]}}, {"review": {"des": "What a delight. The entrance is unassuming.  Once you enter through the doors, you are greeted by the alinea team.  Everyone including the wait staff, Maitre d, sommelier and the chef were friendly and seemed to genuinely care about your dining experience.  We were pleasantly surprised with each dish. We elected for the seasonal supplement (white truffles) which was a pleasant addition to our experience.   Wine pairing was nicely done.  Won't go into specific details of the dishes as there are wonderful elements of \"wow\" and surprises that should not be spoiled. Helium filled apple taffy ballon was a hit with everyone in our group and filled the dining room with laughter from each table.  Every detail has been looked into even down to the coat check where the coats were warmed for your comfort.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pVXY7qEU1--XKP2J9mK_Ww/168s.jpg", "caption": "White truffles"}]}}, {"review": {"des": "Alinea is an amazing experience. The food is delicious and very unique but the presentation is definitely the main reason to visit. Our experience lasted almost three hours and it was a show from beginning to the end! The best part was getting to visit the kitchen for a cocktail and a small bite to eat.", "pics": null}}, {"review": {"des": "There is no doubt that Grant is an excellent, creative, innovative chef. And there's no doubt that the food here is really good, deserving its 3 Michelin status. Everything was made very well to the very last details and surroundings. So then... what's the deal?<br><br>Where's the protein? We felt like all we ate was air, foam, and \"essence\" of something good. Where was the actual food that they took the essence of? Can we have that too? We left hungry afterwards... and that wasn't even the Gallery menu selection. Maybe that was our first mistake? I made reservations on the very first day it opened at 11:00:01 but someone beat me to it, and I had to settle with the Salon menu... which is \"10-12 course tasting menu\". But now that I think about it, it would have been even more disappointing if that was the menu (plus a bit more courses) and had to pay more for Gallery experience.<br><br>I can't speak for anyone else's experience because the menu often changes. Let's just say when we came, the menu was the worst menu for a 3 Michelin star that we tasted (we had our fair share). And to correct myself, worst as in the menu lacked substance and protein, not creativity. It was just like, \"that was it???\" feeling you get when you ate something and it was the end, then thought to yourself, what did I eat and was that it? Where's the rest of it? There were 19 different items but 9 main courses. Everything was made in a unique, innovative way... The most disappointing part was what was cooking in front of us in the fire turned out to be a \"potato\" (A \"potato\"?!) and they mashed that and made that into their version of \"clam chowder\" with the chowder being a foam essence of clam. But the worst menu item was the main entrée came and it was a Sonoma squab (literally a size of nickel or quarter at most) cooking by a coal in front of you. The squab was flavorless, and their homemade \"BBQ sauce\" was like a sad overly sweet version of Mexican mole and this berry sauce. I didn't know what I was eating but it was not good. If you're expecting protein, forget it. I swear I felt like I was a vegetarian, kept saying where's the protein? The presentation and the way it was made was super cool and creative and I did enjoy the show (but not food). Sad to say I had no favorite dishes/none stood out and no flavors blew my mind. <br><br>Do I regret coming here and spending $700ish for 2 people (Salon, 1 wine pairing, auto gratuity, taxes)? No, it was still a good experience. And I love trying different 3 stars fine dining whenever I can. But at least now I know I'm not really missing anything great. I blame Netflix. Haha.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/L8KvXJ9p1tZbSrOhS4GeyA/348s.jpg", "caption": "Octopus"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LdEzsFvvQbcmGZMnrqeSZg/168s.jpg", "caption": "Rocks (2 edible)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/C2WYjTozTwcD0p-sYh0iCQ/168s.jpg", "caption": "Fire"}]}}, {"review": {"des": "Food, Service, and Wine Paring was second to none. Less up tight than my previous years years back. A little hard to hear the staff during the presentations but still a solid 5 star review. The white truffles are a MUST!", "pics": null}}, {"review": {"des": "First and foremost - the food and the theater of it all is as incredible, if not moreso, as you think it'd be.  There's just no giving Alinea less than a full 5 stars based on those criteria alone.  I'd advise against splurging for the wine pairings, though, especially the Alinea pairing.  A la carte is the way to go here.  The various wines were fitting and complimented the dishes well, but they didn't add nearly enough to the experience to justify the ridiculously expensive rare Alinea selection.  <br><br>There really is no overstating how incredible the food is, though.  An undeniably singular experience that is worth whatever hassle you have to go through to make this happen.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FIqLMzJtMiQS_bGIgHviOA/348s.jpg", "caption": "\"Smoke\" - osetra caviar * sunflower * lemon"}]}}, {"review": {"des": "This is the best meal I've ever had in my life.  Can I give 10 stars?  I still talk about this meal with my life and encourage everyone I know to go here because it was just mind blowing.  I saw the chefs table episode so had a sense of what it would be like but it was just amazing.  It's not just a culinary delight it's an amazing experience with taste and smell and fire.  I just have so much respect for the chef and the people who work here.  It really was an amazing time for us spending a special occasion there.  I hope to come back for a wedding anniversary down the road.  If you are questioning at all coming here - please just go.  It's such an amazing time!", "pics": null}}, {"review": {"des": "I'm not sure what I can add to Alinea. It's quite the experience, and one worth having if you are able. Worth the hype (even as a vegetarian - they tailored an incredible and creative alternative menu).<br><br>We were fortunate enough to sit at the chef's table, which was awesome. The ONE downside is that you hear the same speech (yelling over the noise) on repeat as each group comes into the kitchen.<br><br>If I go again, I will probably do without the wine pairing. It was interesting and the wines were very good, but it was a little fast paced for me and I might've more enjoyed a glass or two of my choosing at my own pace. That's the risk you run though, and it was probably better to go all-in on the experience for our first visit.", "pics": null}}, {"review": {"des": "Word cannot describe how amazing the dining experience was. Grant and his team have turned it into a magic show. The whole 3-hour experience was filled with unexpectation and creativity：scallops that look like mangosteen，baked potato pulled out from fire that supposed to heat other foods，pineapple in a straw，and of course the signature green apple helium baloon which makes your voice into a Cartoon like voice. We sit at the salon cuz the gallery sitting were completely sold out，I had the wine pairing while my boyfriend just ordered a glass of wine，and that made it around 420$ per person with tax&tips .", "pics": null}}, {"review": {"des": "My friends and I flew to Chicago from LA just to dine at Alinea and it did not disappoint. I fell in love with their concept pretty much at \"hello\". I am inclined to visual art and Alinea stimulates all of my senses to the max, especially with their visual presentation. The whole 3-hour experience was filled with the unexpected, interactiveness and whimsy throughout. The food was executed beautifully, creatively and deliciously. There were three wine pairing tiers (tier 3 is the most expensive) you can choose from as an add-on to your dinner experience - we chose the tier 1 at $135 per person and it did not disappoint. If you can get a seating in the gallery then I recommend doing so.<br><br>I don't want to give any more spoiler alerts here because if anyone is considering a visit, then you should let it be a surprise. What I will say is that this is the only 3-star Michelin restaurant I've visited that will garner a return, again and again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/U39Ja0wa8CufO-yAFBX2FQ/348s.jpg", "caption": "The dessert that beats all desserts."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DGwmmC_JjzxFgKCZkpRizg/168s.jpg", "caption": "Outside their entrance."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Yb5tGjHjoxEy7hompr6zxg/168s.jpg", "caption": "The many ways to eat an edible balloon."}]}}, {"review": {"des": "Where do I even start?! I have been wanting to come to Alinea forever, and I have been wanting to go to a 3 Michelin star restaurant. I finally made it happen.<br><br>First off, tickets. You need to book in advance and prepay for your tickets and gratuity. You can add on drinks later if you want. Tickets go on sale 2 months in advance on the 15th of the month at 11:00 A.M. Central time.<br> <br>It's a 3 Michelin star restaurant, so you can drop some money here, easily. There are varying options for dining and pricing associated with it. You can pay for drink pairings in advance, but I decided not to do this. We did the cheapest dining option, which I was pleased with. As you pay more you obviously experience and get more, but this was enough for me (and expensive enough). <br><br>I don't want to give too much away, because part of the experience is not knowing what is going to happen next and the element of surprise. However, they are constantly changing the menu so someone dining months from now won't have the same experience I had. <br><br>The portion sizes are small (each course has about 3 small plates), but after getting so many of them you do leave full. I could go on and on forever about the food, presentation, and different courses. The food is just as good as you would expect. My sister had never been to a restaurant like this, and her mind was blown. It's definitely not just a meal, but an experience. I was excited because during one course we were able to go back into the kitchen. I was geeking out.<br><br>The service is impeccable. You have to be careful what you say, because the servers can hear your every word. If you say you need anything, they will hear you and get it right away. Drop your napkin? They got it. Want to know what wine will pair well with your meal? Your sommelier will tell you. Cold outside? The coat closet is heated, so your coat will be warm when you leave.<br><br>It's details like this that explain exactly why this place gets 3 Michelin stars.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JU2SdAt7-gQbvY9v1IRUdQ/348s.jpg", "caption": "Chef Grant Achatz working in the kitchen"}]}}, {"review": {"des": "One of the best modern dining experiences ever.<br><br>I was lucky enough to get tickets as my friend and I are from out of town and did not want to miss the opportunity to dine at Alinea. <br><br>Dishes are innovative, fun, and interactive. It tantalizes all of your senses in the fanciest way possible without coming off as pretentious and extra. Every dish was a surprise, pretty to look at, had a different texture, tasted amazing, smelled great, and sounded funny! Its not everyday you can tell someone you ate a balloon! I enjoyed hearing everyone around me say funny things after sucking in the helium and eating the balloon. It reminded me of Willy Wonka in Charlie and the Chocolate Factory. I think the next time I come, I would definitely try to sing the oompa loompa song.<br><br>The service was spectacular, my friend and I had an amazing girls night out as we finished our Chicago trip with a nice treat to ourselves.", "pics": null}}, {"review": {"des": "So before I get crucified for the 4-star rating, let me first begin with saying this was the most spectacular dining experience of my life. We ordered the Kitchen Table and experienced a symphony of artful cuisine presented in a mesmerizing and orchestrated fashion. The chef and staff's ability to create delicacies infused with aromatics, arranged in unique canvas' of art, incorporating music and even certain elements of the environment made the overall experience truly indescribable. The attention to detail and the ability of the staff to pull off everything seamlessly and flawlessly was mind blowing. I would tell any foodie out there that hasn't experienced Alinea to add this as a must do on their bucket list.<br><br>Now, onto my explanation for the 4-star instead of 5. I'm no novice on Michelin rated restaurants or artfully crafted cuisine. In fact, I've been to my fair share of these restaurants. They all have been great experiences and each had their own genre but only a few stood out memorably. Although Alinea was the best overall experience I've ever had at a restaurant, it isn't the most memorable by taste. Again, everything was incredible and flavorful, but nothing was so intense that it had me craving more. Nothing said I want to take 20 of these with me when I leave. To this day, I still have a craving from Jungsik, a Michelin rate 2-Star restaurant in NYC. Revisiting my dinner last night, nothing stands out in my mind other than the experience. <br><br>5-star on experience; 4-star on the food. Overall it was an incredible restaurant and worth every penny spent.", "pics": null}}, {"review": {"des": "The best restaurant that i've been to in the entire world. This is comparing it to multiple other 3-star Michelin restaurants.  The feeling of bewilderment, astonishment, and craftsmanship that I got when visiting Alinea was parallel to none. While others have complained about the lack of complexity with flavor of the food itself, Alinea brings a new way of elevating the food experience with more than senses that amalgamate into flavors I didn't know I could experience so intensely. <br><br>Alinea has two healthy scoops of theatricality. We dined at the Kitchen table, a small room inside the kitchen with floor to ceiling glass walls, still open to hear the the hustle and bustle of the kitchen. The lights dimmed and changed colors, depending on the meals. Some meals the lights were dimmed very low, other meals the lights flashed and changed colors. There were even meals that had music to set the tone and mood of the plate. Music ranged from majestic or epic, to quirky, to down right quacky, but always with the range of the meal and always adding to the experience. There were times where there was smoke or fire, all contained within the confines of the table, achieving new levels of elegance I didn't dream of experiencing. This meal is an experience, it will change how food is seen for you in its presentation, its delivery, it's sensory battery. There were many times that I was so overwhelmed with joy at the scents filling the air, the music navigating my consumption or the mood set by the various colors. <br><br>Our meal leader was Paulina, one of the top hosts that i've ever had. Her humor and delivery was dry like the mojave, adding to her quips and attention. It felt like she was challenging us as diners to achieve new things on our food journey while generally taking care of all our needs. She was hella dope.<br><br>The food itself, otherworldly. There were dishes that I cannot compare to other restaurants since it was the first time I had tried that food prepared in such an artistic or game changing way. From the first dish (terrarium) bewildering me to what deliciousness I was eating, do the hidden treats and surprises through the meals, it was like each plate had an innovative to lead to something completely different. There wasn't a deep or robust layer of flavors for all dishes, but each dish was executed perfectly for what flavor it was trying to achieve. <br><br>Our somm was kind, funny, caring and welcoming. The food runners were quiet, but answered any questions or chatted you up if you wanted to, so there wasn't a sense of stuffiness. The venue was clean, sophisticated and modern. The experience though... you come for this experience that leaves you desiring so much more of any other restaurant.  <br><br>Recommended beyond all reason.", "pics": null}}, {"review": {"des": "Finally crossed this one off of the gastro bucket list- did chefs table with a few friends and overall had a good time- definitely an interactive dinner experience.  Several of the dishes were really interesting, a few favorites were:<br><br>- rouille, nori- delicious bouillabaisse with langoustine, wanted a whole bowl of this<br>-black bass, kuzu - perfectly cooked with interesting flavors of melon and yuzu <br>- spud - truffle and potato, what more needs to be said?<br><br>However, lost a star for a few reasons: service was fast- as in people were still eating a course when it started getting cleared, not all the courses were great- while I don't expect to love every dish, there were a few that were disappointing.  At the price point for chefs table, I expect everything to be great, from each dish to service/experience and it just missed the mark.   <br><br>If I had to do it again, I definitely would still check it out, just may do one of the other more affordable experiences instead...", "pics": null}}, {"review": {"des": "Some tips: <br>- you can split the standard wine pairing . This way you'll still get some great wine education from the somm without frowning at the bill. <br><br>- don't try to take a selfie with the edible balloon. It could float toward your face and end up popping. Which is actually hilarious for everyone else at the table but maybe not for you. <br><br>- definitely start talking right after you inhale the helium from the balloon. You'll laugh for the next 5 minutes. Guaranteed", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ys4_uPF_8_ReTIjBywwPIg/348s.jpg", "caption": "Field trip for a drink in the kitchen"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mb8rJYTMX74wv0QxO70ZOA/168s.jpg", "caption": "Most exciting bite of the night"}]}}, {"review": {"des": "Moved to the city over a year ago and was finally able to snag a reservation last week... I went with my boyfriend to check this place out, and I was very impressed!!! There were a few dishes that I personally did not love, but I loved the presentation of every dish and the service was spectacular. If you are a picky eater, this might not be the place for you. Or you can let the restaurant know so they can accommodate your dislikes. They brought out a lot of unique dishes with ingredients I've never heard of or tried before. Overall, I loved it. Will be back for special occasions.<br><br>I also want to give a shoutout to our server that night. My boyfriend and I witnessed a domestic abuse situation down the street from Alinea and asked them to call the police for help. Our server came out and handled the situation perfectly until authorities showed up. Honestly, this place deserves 10 stars for our entire experience and especially for our server in this situation.", "pics": null}}, {"review": {"des": "An amazing food experience that encourages all your senses to participate.<br><br>You're not there for the food, but more for the experience of eating the food. Every course was well prepared and executed, but there isn't one dish that I would say was amazing and that I'd crave later. In fact, I can't even remember all the dishes, yet, the dinner as a whole left me very satisfied.<br><br>I've been to the French Laundry where Grant Achatz trained, and that place serves solid, delicious, well executed food. Alinea is similar in that the ingredients are sourced for all over the world yet the vision for dining is very different. At one point of the meal we were asked to leave our seats and go into the kitchen for our next course. There we were served the most delicious drink and some dish I've already forgotten..<br><br>The waiter informed us that the menu is completely revamped in 6 months, so I hope to be back to try whatever new creations are thoughtfully 'thrown' on the menu.", "pics": null}}, {"review": {"des": "I've been anticipating going to this Resturant for years before finally booking a table. A friend and I booked an entire trip to Chicago revolving our visit.<br><br>I have a sever allergy to dairy and peanuts and we notified them in advance. We had a several email coorispondence regarding my allergy. They were very clear that it shouldn't be an issue and that accommodations would be made for me to dine safely. <br><br>In the second course I began to go into anyphylactic shock and almost died that night. I didn't expect this from a three Michelin star restaurant.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Z_b38NH3sG8iN1z_a5pegw/348s.jpg", "caption": "My friend and I at the hospital after being sent into anyphylactic shock at Alinea."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7QOEC2D7hLDRJM3ehxhWqA/168s.jpg", "caption": "Second course that sent me to the hospital"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FPxcL5siAtpx3OP8NeV4Eg/168s.jpg", "caption": "1st course"}]}}, {"review": {"des": "Best restaurant experience ever!!  I don't want to give away anything so I'll keep it simple.  Dined in the gallery with a 5 o'clock reservation.  Doors opened promptly at 4:45 ( had to wait outside a bit but you don't want to be late for this).  From the first course to the last be ready to be amazed, wine pairings were on point, service was impeccable.  It's not cheap.  White truffle French toast was equivalent in price to an evening at a nice restaurant with a bottle of wine.  Think about that. An experience you will never forget.", "pics": null}}, {"review": {"des": "Plainly stated: a bucket list foodie destination that combines all of the senses in an interactive and whimsical journey of gastronomic excellence!<br><br>If I remember correctly this reservation was almost a year old when we crossed the threshold on a Sunny Chicago dusk.  And in all honesty, I wouldn't know where to start in describing this event.  That said, I will let the pictures do the talking with the corresponding menu shown as well.  And as a review I will attempt to encapsulate many of the amazing moments which were constant and almost always surprising!<br><br>This is an experience for all of the senses as it is billed and that is exactly what is experienced at Alinea:  from the table changes and room changes (one course was enjoyed in the kitchen.... ) to the interactive centerpieces that were either edible, or were on fire etc.... your expectations get crushed with every course offered.  This is the cirque du soleil of gastronomy my friends and I would defy anyone to find this experience short of the value that the very very expensive final cost comes too.<br><br>Also well done on this point is the payment method:  \"tickets\" are purchased way in advance and various levels based on number of courses and wine pairings so once the last morsel is enjoyed you are free to leave with no awkward bill arriving.  Would that all restaurants of this caliber assimilated to this system.... a model highly appreciated by all of us.  But enough words!  See the pictures and try to match them with the accompanying menu!<br><br>Bucket list item completed but not crossed off.....<br><br>Robbo, Parker, CO", "pics": null}}, {"review": {"des": "I traveled from Atlanta, GA to Chicago, IL for Alinea the morning of. Was it worth the trip? Yes, definitely. Is it worth a trip? Yes.... but I wish I was a millionaire because travel and hotel costs are pricey. If I lived in the state, definitely worth it the experience! I rate the experience if I were a millionaire a solid 8/10. <br><br>Attention to detail: 10/10: everybody wished me happy birthday from the concierge to the waiters' and waitress'! Wow! Not only that but I even received a candle at the end. But aside from thinking the night was all about me.. every dish was made precisely to consistent perfection, or was it? Multiple small details in my dish were different to my partners (different amounts of miso, dots of decor, lighting) and I read somewhere that Grant's job is to make sure your dish is exactly the same as your neighbors no matter what. So if that's the case things were different- but I do think the experience was the same for mainly everybody. <br><br>Order of food/tables: 2/10: Since tables were close I spoke often to my neighbors, great right? Wrong! It made it hard to not notice what they were eating and doing..therefore eliminating the element and experience of surprise or awe. Luckily, I noticed being distracted and focused on my partner's face after the third dish for the rest of the dishes. I was therefore amused by 2-4 dishes. My partner was extremely distracted and unfortunately noticed all the dishes ahead of time. I know space is limited but I wish we all had cubicles or thin walls up! The pro to seeing other tables with similar dishes was being able to reminisce about what I ate and enjoyed seeing- like seeing four seasons. <br><br>Variety: 10/10: enjoyed the dessert flavors, savory and sweet dishes and even the palate clearers. I especially liked the field trip to the kitchen to get some non/alcoholic drinks and delicious bread with a view of Grant! <br><br>Story telling: 10/10: amazing! They all are really witty and great -not only at telling you what ingredients were used but also telling you how to eat certain things in a funny manner. See if you can find the one who calls herself the 'oracle'! <br><br>Overall, I would not come back until I'm a millionaire. But I did thoroughly enjoy myself here for my first 3 star mich restaurant. I look forward to try some more in the US! Thank you all! :-)", "pics": null}}, {"review": {"des": "Wonderful unique dining experience. A fusion of high end dining with a show. The dishes were individually tasty and the presentation was wonderful to admire. <br>The wine pairings were mostly white, I prefer reds, but respect the pairings. The wine steward was very kind and knowledgeable.  She had a great story about each wine and added proper humor. <br>We were not pleased with the taste of the final dessert but the show and presentation were entertaining. <br><br>The main issue we had was of our dining party of four; three became sick to our stomaches overnight and through the next day. After discussing we thought perhaps the menu was too rich or the foods didn't go well together, or perhaps there was a food borne illness. <br><br>We tried to contact the restaurant. They don't answer the phone or have a messaging service. After investigating further I found an email address. I emailed our concerns as we wouldn't want other patrons to have our experience.  As a restaurant owner I would certainly want this feedback. <br><br>I received a general email response that they apologize for our discomfort and she would pass along my message to management. <br><br>I haven't heard from anyone since. <br><br>This was a very pricy experience about $500. It seems they lack customer service if you're not actually in front of them dining. I think it's unacceptable and it seems unimportant to them that management didn't follow up. <br><br>Luckily in Chicago we have many options...and options that are also less expensive.", "pics": null}}, {"review": {"des": "Been following Grant Achatz for years now.  Seeing him speak about the creative process on Netflix's Chef's Table drove me to make reservations here.  The dishes served were inventive and original but there were points during the meal where things felt contrived and gimmicky.  It's as if the strident need to hurdle the bar of creativity made the food be an afterthought rather than the primary focus of this restaurant. Consequently, some of the dishes simply did not taste good.  The mixing of flavors did not coagulate well and there was little cohesion to the meal.  I contrast this with meals at Blue Hill and Eleven Madison Park where the food itself was the focal point and every dish delicious.  I understand the need to push the bar and expand the boundary but sometimes that leaves the diner wanting.", "pics": null}}, {"review": {"des": "I came here to celebrate match day with my family in the kitchen at 9:30.  Kitchen table seats 6 people. When we arrived, we were greeted and welcomed and brought back to the kitchen table.  <br><br>Not to ruin any of the surprises, but over all the experience was wonderful.  Really a great way to celebrate a special day.  The goal of Alinea is to have fun in your own way and enjoy the food and experience.  It met every goal above and created a wonderful memory.  It was an immersive experience that met my expectations.  That being said, not every dish was a show stopper taste wise.  A couple were a bit on the salty side but each was extremely creative.  I was most impressed with the early dishes and desserts. <br><br>Initially, I thought I would be grabbing dinner on the way home due to hunger but we were STUFFED.  <br><br>I've been told the gallery experience is the same menu as the kitchen menu.  The salon is a bit truncated compared to the other two, but I am told is also a great time.  <br><br>If you are traveling through and have the time, Alinea will make great memories. I will surely be back in the future.", "pics": null}}, {"review": {"des": "After four years of being in Chicago, I finally had the opportunity to eat at Alinea. I was super excited, of course, after seeing the featured episode on Netflix's Chef's Table and hearing all of the hype around this Michelin 3-star restaurant. Looking back, did my experience live up to my expectations? Not entirely, but I had a fun time nevertheless.<br><br>Overall, I will say that the tasting menu at Alinea was not the tastiest that I've had in Chicago; however, I must praise the creativity that went into each dish's presentation. I was looking forward to the tabletop dessert that I had seen in the episode, but it seems that that particular dish has been retired from the menu. Alinea's menu is constantly changing and it may vary even slightly from one week to the next. I appreciate the innovation that goes behind each dish.<br><br>I had a fun time dining here. I have had many people ask me if it was worth it for the price. Honestly, it depends what you are looking for--although each of the dishes were not necessarily the most delicious things I have ever eaten, I liked the artistry and creativity of how they were presented. I'm glad I got to try Alinea, but this is probably one of those restaurants that I eat at once and then check off of my list.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rrvrjk7Fk7hD7DGMCKfhgg/348s.jpg", "caption": "Clear pumpkin pie"}]}}, {"review": {"des": "I really truly struggled between giving Alinea 4 or 5 stars. On the one hand, it was the fanciest and coolest dinner experience I've ever had. On the other hand, I can't really justify the ratio of price to enjoyment of food, even though the atmosphere and experience were stellar. <br><br>A lot of my friends would consider me a foodie and while I can be a bit of a food snob when it comes to certain things (boba, dim sum, ramen haha), I'm not as hardcore a foodie as my spouse. He's the real reason we came here and paid a crap ton of money on one meal. Granted, it was an amazing show and presentation and experience, but I wouldn't have chosen to eat here if it wasn't for Alinea being on Kevin's bucket list. <br><br>This was the fanciest dinner I've ever been to and it was kind of nice to be pampered like that for a few hours! They changed out my linen napkin every time I got up to use the restroom (which was quite a few times during the 3 hour meal since I'm pregnant) and they explained every dish in detail. One or two of the servers noticed that I'm left handed and set the utensils accordingly. <br><br>The dishes were inventive, interesting, playful, whimsical, fun, creative, and beautiful! But personally, I just sometimes didn't like how all of the flavors tasted together. My favorite meal that we had in Chicago during our Thanksgiving trip was actually at Girl and the Goat (and it was under $100, waaay cheaper than Alinea). <br><br>I won't bore you with the details of all the 10 or so courses they served, but I'm sure if you're a hardcore foodie like my spouse, you won't want to read it anyway so you can experience everything for the first time without knowing what's coming. <br><br>Anyway, my ramble is done: 5 star experience, 4 star food, 4 stars overall because it was too much money (in my opinion) for the amount of enjoyment I got from the food.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IFSH113vYE7o2xCqpkaF8A/348s.jpg", "caption": "November 2017"}]}}, {"review": {"des": "I have been here twice, both for celebrations, and have been disappointed by the meals both times. One time, we went for my med school graduation, my parents took me there; they go to all the fancy restaurants (Per Se, French Laundry, Jiro's) all over the world, and they were really disappointed with our meal too. The presentation is spectacular, the food and the taste of it is mediocre. The wine list, however, is so impressive, as is the service, always. I dont think my review will keep anyone from going, but for the money, I'd always pick Grace over Alinea.", "pics": null}}, {"review": {"des": "The place: Part of what you pay for (obviously), is the service, the ambiance, and the overall feel of your special meal. Everything is extremely well choreographed, and while I expected it to feel a little pretentious/stuffy, it actually didn't really feel that way. I occasionally laughed really loudly (sorry, not sorry), and was glad that I didn't get any nasty looks directed at me. It almost felt like a communal experience. You could see what other tables were experiencing - from the fire, smoke, lights, tubes and balloons, so you knew what was coming. We also got to take a field trip to the kitchen, which was special. Seeing the team work together to prep and plate the food was a treat in it of itself.<br><br>The taste: Let me count the number of words on the menu that I don't know: osetra, calendula, binchotan. Three, okay, so not bad, but the menu doesn't do the meal justice. I could go through the dishes, but I'm sure every meal is different/everyone has their own opinions and memories associated with different flavors. What I will say is that it wasn't the MOST AMAZING stuff I've ever tasted ever, BUT it was interesting. Interactive. Definitely much of it was delicious. I will say though, by the end of the 5th course, I was getting full. There were at least three dishes that I couldn't come close to finishing, and I felt bad leaving $100 of food just sitting there, but one server said that he appreciated me knowing my limits. Also, while the green apple balloon tasted good, and was executed well, it mostly ended up popping on my hands, so it ended up being more of a lollipop experience (my hands were the lollipop), than eating taffy. The rope, was awesome. <br><br>My face: Huge smile after a three hour dinner with a show. Really glad that we paid in advance. Our tickets for 8:45pm on a Friday night were $285, or $342 after tax and tip. I am glad we didn't order additional drinks because I didn't have any more room in my stomach. <br><br>It was a truly remarkable 33rd birthday celebration.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sNM4Zzy88ycZnfqD2c3jsQ/168s.jpg", "caption": "My birthday candle, followed by a deconstructed, liquid bubbly birthday cake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bAR9i45stIXq61O4H9gI5w/168s.jpg", "caption": "Shooting a dragonfruit, aloe and pineapple shooter in a tube"}]}}, {"review": {"des": "Great meal. Come here for an experience. In my opinion oriolo has better tasting food, but the experience here is phenomenal<br><br>There a reason why it has 3 Michelin stars, in my opinion the few that deserves it. <br><br>To the restaurant, please remove the silicon curry, that was an interesting but unwanted experience", "pics": null}}, {"review": {"des": "More power to those who choose to write novels about their experience. In my case, less is more so I'll keep it short and sweet. One of the best nights of my life was last night at Alinea. Each dish is an experience full of wonder and surprise. For those who appreciate haute cuisine and an elevated dining experience Alinea is your go to.", "pics": null}}, {"review": {"des": "There are no words to describe my incredible experience at Alinea. I recommend that everyone should come to Alinea when they can. <br><br>Instead, I have written some tips on what you should do to come to Alinea. <br>1. Save up a lot of money. Expect to prepay ~$300/person (including tip and tax).<br>2. Make a countdown until reservations open. Reservations open in the middle of each month. You must make reservations 2 months in advance. <br><a href=\"/redir?url=https%3A%2F%2Fwww.exploretock.com%2Falinea%2F&s=a6e3e8e34faf6c7b01618d17d6659cacaab5e7a4ee77a8ece0e8661431868e16\" target=\"_blank\" rel=\"nofollow\">exploretock.com/alinea</a><br>3. Watch Chef's Table's Grant Achatz's episode (~ 50 minutes) right before you eat dinner.<br>4. Come on time! Don't forget to take into account the time it takes to valet. This way you'll be surprised by each presentation and it won't be ruined by the neighboring table.<br>5. Ask to split a wine pairing with someone when you arrive. <br>6. Enjoy.<br><br>Thank you for a wonderful experience Alinea! We will definitely be returning.", "pics": null}}, {"review": {"des": "This is definitely one of the best restaurants I've ever been too. No surprise there as it's been awarded three Michelin stars. I went there mid-early November last year and found the food to be incredibly unique in almost every way. There were dishes I'd have never thought of, platings that I had never seen, flavor combinations that I had never tasted, and an experience that I had never imagined I could have in a restaurant setting. Almost every bite of food was the best I've ever had. Given the fact I'm no stranger to high-end restaurants, THAT was a bit of a surprise. <br><br>The only thing I wasn't thoroughly impressed by was the dessert course that they are famous for. The one where they \"plate\" it directly on the table and you eat from there. This iteration involved them taking paintings that were hanging from the ceiling down, placing them on the tables, and then plating the dish directly on the artwork. Don't get me wrong, it was a very cool and unique experience. That said, I wasn't a fan of an abstract plating ontop of an abstract painting. There was a bit too much abstract in one place for me and I found it to be mildly unattractive because it was just so much. It was still a lot of fun to watch being put together and to eat, I just wish the canvas had a little less going on so the artwork of the dish itself could have stood out a bit more. <br><br>All in all though, if you have the opportunity to go here, do it. As someone who, at the time, was cooking for a living, I learned an incredible amount just from eating at this place and had an amazing experience. I probably won't be back anytime soon unless someone else is paying for it, but it's definitely worth the price to go at least once.", "pics": null}}, {"review": {"des": "I had an amazing experience here. The hubs and I are well traveled foodies, so we were thrilled to get a reservation to jointly celebrate our birthdays. I have to admit that the reservation process was a bit much, but the dining experience made up for it 10-fold. The food was insanely impressive in presentation and absurdly delicious, but the thing that impressed me the most was the service. I've been to tons of \"high end\" dining establishments and experienced snooty and condescending staff. No place has earned the right to be pretentious as much as Alinea, but when you're the best, I guess you don't need to flaunt it. The staff was so warm, friendly, down to earth, and overall great. They made the experience that much better. If you're fortunate enough to visit, you will not regret it!", "pics": null}}, {"review": {"des": "I have been to Alinea several times and have always had an amazing experience. I love Alinea. However, the restaurant seems to no longer place the diner first. One of the amazing things about Michelin 3-star restaurants is how personalized and accommodating the experience can be. Alinea no longer seems to be one of those places.<br><br>I needed a table for six for a particular night. I logged on right as they went on sale but because Alinea only offers one table for six (that isn't the $3k kitchen table) I was not able to get it. I reserved two tables (one of 4, one for 2) at the same time in the same section of the restaurant for that night. After emailing Alinea, I was shocked that they not only refused to move the tables next to one another, but went out of their way to ensure the tables would not even be in the same room. Remember this is a restaurant that changes the entire table configuration in the gallery over the course of one meal- this is not an impossible ask of them. <br><br>Their response: \"it is the policy set in place by the Chef and Owner that we are not able to accommodate requests to seat duplicate tables near one another. Movement and interaction between separate tables has proven to be disruptive to the flow of service for our team as well as the other diners. Your two tables will be seated in separate dining rooms.\" For full disclosure they did offer me the opportunity to book the $3,000 kitchen table, but that would double the cost of an already expensive meal. <br><br>When policy starts to win out over reasonable customer requests, a restaurant such as Alinea has lost direction. Alinea should look at the definition of its own name, a new direction,  and start in a new direction of once again trying to delight the diner.", "pics": null}}, {"review": {"des": "Where do I begin? I had a friend eat at Alinea 5 years ago. It's been on my bucket list ever since. I've googled Alinea, read Grant Achatz's book and watched Chef's Table on Netflix. My chance to eat here finally came last Sunday. The restaurant is beautiful. I got the one single reservation for the night (all other reservations are for 2, 4 or 6 guests), which is the Salon menu. From the moment I sat down (very nervously & excitedly), I was pampered & made to feel taken care of & also relaxed. It didn't feel stuffy. The servers and sommelier were friendly and welcoming. <br>I don't even know where to begin with the food. Every single thing I put in my mouth was loaded with flavor. Surprises around every corner. The standard wine pairing was great as well. I left full & quite tipsy! I don't want to give too much away as far as the food goes, as I feel everyone needs to see it for themselves. <br>I was celebrating my birthday, so they did something special for me at the end & I got to head down to the kitchen & meet Chef Achatz, defintely a huge moment for me! <br>You do have to book this restaurant in advance, so go on their site & check dates. I knew I was going to be in Chicago the first weekend in June, and the reservations went on sale April 15th at 11:00CT. I was on my computer the moment they were released. You do have to pay in advance & reservations are non refundable, but you can transfer them to someone else if you're unable to make it. <br><br>I do have one suggestion, if you're going to eat here, really splurge & do the Gallery menu. It's longer & has more of the \"show\" quality, the lights & music change & that's where they do the dessert on the table that looks like art. I was defintely a little disappointed I didn't get to experience that, since that's really what got me interested in Alinea. But it just means I'll have to come back! So glad I got to cross this off my bucket list & it will be something I remember forever.", "pics": null}}, {"review": {"des": "Was here back in 2014.  Out of this world experience. Hard to describe one of the best dining experience of your life.  You will never crave food like this like you would a burger or pizza but you would give anything to experience the meal again.  The cherry on top was the great Grant Achatz came out to present and essentially make our dessert at our table. So cool!<br><br>The only criticism was that the table directly next to us was one course ahead of us so it soured the experience a tad when you can see what you are about to get the next table over. Not sure how that can really be timed right but perhaps the tables are too close together.", "pics": null}}, {"review": {"des": "Disclaimer: I was torn in how to rate this restaurant given high expectations but to sum it up: <br><br>Food=5 stars<br>Service=2 stars <br>WOW factor=2 stars <br><br>My husband and I came here a few months ago and were so excited that we were able to get a reservation. We could only get the salon menu but we were still excited.  We had watched the 'Chef's Table' documentary on Alinea and was prepared to be wowed. Unfortunately, we came after the restaurant remodeled and...I was pretty disappointed. <br><br>Now, the food was very creative, some dishes were unforgettable, but for a meal that cost us nearly A GRAND, I was left wanting more. From what I've read and what friends have claimed, the previous Alinea was magical. Every course was a show, a mystery, and a surprise. Each course WAS entertaining and filled with gimmicks (the illusion of a wall when you enter, fires at the table, dessert was basically edible art, watch the documentary for more). This is what we were expecting, and let's face it, we love the gimmicks and wanted the show! However, after the remodel, it seems that the chef has tried to focus \"more on the food\". Sadly, there was no show. Just really expensive, but delicious food. <br><br>The service for such a high end restaurant was really quite poor. Our waiter must have been in training to say the least, because he seemed uncomfortable and awkward. He stuttered with each course description and seemed to not know what was going on. Also, after seating and welcoming us, the first thing the waiter says is \"there is an additional course of white truffle something (I couldn't understand the waiter) that the chef has added to the menu. If you would like to try it. It's an additional $200 a person.\" Obviously we HAD to get it, but starting the meal that way was also very off-putting. They should really just increase the base price and include the special courses for everyone instead of starting the meal with a \"surprise, you have to pay more if you actually want the full meal.\" <br><br>Anyway, that white truffle dish ended up being AMAZING. <br><br>Again, <br>Overall,<br>Food=5 stars<br>Service=2 stars <br>WOW factor=2 stars <br><br>If you have a couple thousand dollars to spend, the food is definitely out of this world. If we came in with different expectations, not expecting to be entertained, I would have left feeling more satisfied but unfortunately, that wasn't the case. So if you're a foodie, go for just the food. It is unforgettable.", "pics": null}}, {"review": {"des": "Alinea is the type of restaurant you dream about until you go. Wherever in the world you live, you still go. And that's what we did. <br><br>We flew from SF to Chicago for the sole purpose of spending a grand at Alinea. It was 3 months of silent drool and playing make believe until our reservation date arrived. <br><br>With all that said, I give Alinea a solid 4.5 stars (but rounded up to be courteous). Maybe my expectations were super high? Maybe I've gotten super spoiled by all the wonderful Michelin restaurants in the Bay? Maybe it was a tiny bit off that night? Who knows. <br><br>Anyway, the dishes were beautifully prepared. I give them that. The menu is also pretty cool, keeps you guessing like a word scramble game. I would say my absolute memorable part of the night was desserts, the helium balloon in particular. It was something I had never experienced before. And yes, all the dishes were very good on the palette. <br><br>To sum it up, Alinea is almost as good as gets, but quite honestly, I don't see myself coming back. Next time if I'm in town, I'm going to its competitor, Grace.", "pics": null}}, {"review": {"des": "I was at Alinea this weekend and it's just not worth it if you get the salon dinner (I think around $250 pp). It just wasn't enough food. I don't mind bites. In fact I love bites. But the main entree, a protein, was, no joke, one inch square. It just came off as cheap, despite all the pomp and circumstance of a floating edible balloon and smoking dry ice. If you are visiting Alinea, only go if you can afford the largest tasting menu PLUS the wine tasting. Otherwise it's just a waste of money and you'll find yourself paying for a second dinner elsewhere that day. <br><br>Some of the courses just weren't good on their own without the wine pairing. Not to say some of the food wasn't pretty great, but honestly nothing really blew me away. Maybe the caviar dish. It's more an olfactory experience. I was just too offended by the one inch protein. I understand if you're having a lot of bites I don't want a 4 oz protein, but Jesus at least make it three inches. I think the restaurant should get rid of the lower cost dinner if they're going to provide this experience  - (because why should you be full after paying a paltry $250?) it's not worthy of Alinea, just offensive that you are treating the \"masses\" this way. In my visit of some of the best restaurants in the world, Eleven Madison Park, Per Se, Le Bernardin, Borago, The Ledbury, the French Laundry, Dinner by Heston Blumenthal, Pujol, Alinea's salon menu is definitely the worst of the bunch. <br><br>Service was excellent, however.", "pics": null}}, {"review": {"des": "It's a good experience in general. The service and atmosphere were great. The chef definitely made the eating, this daily activity, more interesting and intriguing. However, I would expect a better taste of the food given its price. A lot of them were kinda of salty to us.", "pics": null}}, {"review": {"des": "MY SHORTEST REVIEW EVER<br>If you read my other reviews, you know I love to talk a lot.  This place speaks for itself, but I will say that this is the best restaurant I've ever eaten at and it will be for you too. <br><br>It's super expensive though. Like get a second mortgage expensive.  But it's worth it! The only time I've ever had molecular gastronomy, paid hundreds of dollars per person, and felt like I got an experience of a lifetime I'd repeat!  Kudos to Grant, the founder, simply amazing!", "pics": null}}, {"review": {"des": "What an experience. Alinea has been on my list for so, so long and when the opportunity came up to visit during a recent trip to Chicago, there's no way I could pass it up. I really hate going into the details of what made this meal so memorable and so I simply won't.<br><br>This isn't a typical Yelp search where you'll thumb through a few reviews, swipe through some pictures and then decide if it's worth your time and money. If you're willing to pay a premium price for an experience, then it's absolutely worth it. And like an amazing movie, the fewer spoilers you know going in, the better.<br><br>The service was top -- the care, friendliness, and precision in which they introduced each dish were on point. The food was delicious, creative, and fun! With the price point, is Alinea something of a daily occurrence for me? No, definitely not. But after dined there and watching the episode on Chef's Table on the chef (amazing, btw), I am in love with his philosophy of growth and innovation and constantly challenging themselves to create for both the diner as well as them.<br><br>I hope to return one day fall in love once again. Thank you, Alina, for a great experience.", "pics": null}}, {"review": {"des": "A truly unique dining experience.  Go early.<br><br>Would advise booking a reservation as early in the day as possible (5pm) and showing up even earlier since a salient part of the Alinea experience is the surprise of what's coming next; after all, the menu is a word search!<br><br>Being the first table served in a particular section avoids having the big reveals (smoke! fire! foam! trickery!) spoiled by presentations to the neighbors at the next table.  Further, as many effects are atmosphere-building (consider smoldering juniper sprigs, citrus aromatics), showing up late precludes the olfactory build-up (compare to the omekase sushi experience) that earlier diners enjoy.<br><br>Overall, even the 10-14 course Salon menu is a lot of food.  Starve yourself prior and walk over from CTA Red Line to make room.", "pics": null}}, {"review": {"des": "My wife and I experienced the Salon version of the Alinea experience last evening and we must say that Alinea met our expectations and then some.  11 courses with somewhere around 18 elements over a 2.5 hour time period.  We certainly did not leave hungry.  We also had the reserve pairings and they were very well done and presented by the sommelier.<br><br>From a flavor standpoint, we both agreed that the Alinea dishes had bolder and more memorable flavors than any of the other high end tasting menus we have enjoyed (Per Se, Eleven Madison Park, Single Thread, Restaurant at Meadowood).<br><br>The best dish of the night for me was the Fried Morel Mushroom dish with ramps and Parmesan cream.  I mentioned that I could become a vegetarian if I had the folks at Alinea prepare all my vegetable dishes.  My second favorite bite was the langostine bouillabaisse where the seafood was dehydrated into a paper like addition to the soup that became a noodle like texture when rehydrated by the broth.  Full of flavor.  We both slurped up all of the broth left behind.  Third favorite was probably the squid with black garlic puree.  This dish was accomanied by a squid ink sphere that when popped in your mouth let loose a very flavorful artichoke cream.  Best way to eat an artichoke in my opinion.<br><br>Service for the most part of the meal was spot on, and certainly friendly and informative throughout.  Giving the overall experience 4.5 stars as the service really slowed down once we got to the dessert portion of the menu, and in the end the sweet portion of the meal didn't live up to the wow of the savory portion.  Hope to come back some day and see what the Gallery experience might be like.", "pics": null}}, {"review": {"des": "So for perspective, I have not only dined in most of the Michelin star, 1 - 3 star, restaurants in the U.S.  but I have also dined internationally at a lot of the world's best three Michelin star restaurants overseas.  Unfortunately once you get past all the pomp and theater at Alinea, and focus on the quality and complexity of the courses, Alinea falls well short of a 3 Michelin star dining experience.  The reality is that there are a lot of 2 and even some 1 Michelin Star restaurants that surpass Alinea when it comes to the quality and complexity of the courses. As a result, I am rating Alinea a generous two star, \"Meh.  I've Experienced Better\", experience.<br><br>The first thing that should be noted is that a majority of reviews, both professional culinary reviews and unprofessional (e.g. yelp, open table, etc.) reviews mention the \"experience\" or \"having fun\" or \"surprises\".  So for example, items are brought out for a course, only to find out later that a portion of the next course was hidden in it.  Or oranges are used to create a theatrical steam of orange incense which \"pairs\" with the course.  A \"live\" coal is brought to the table while it is still cooking a course.  All theatrical and intriguing but what about the actual food course that is left after the pomp and theater?<br><br>Unfortunately, to a diner like myself who has dined at restaurants like Eleven Madison Park, Guy Savoy, Central, Osteria Francescana, among many other world renowned restaurants, the courses at Alinea were simple without any complexity of flavor(s) and in most cases no complexity of texture or temperature.  Again theatrics were utilized instead of complex flavors, textures, and/or temperatures.  Perhaps I am \"old school\" Michelin star, but I believe that ultimately the food courses should speak for themselves.  Unfortunately, when I assess and compare the actual food courses at Alinea to the other U.S. and foreign 3 Michelin star restaurants I have dined at, Alinea certainly  does not deserve 3 Michelin stars.<br><br>Another circumstance I found alarming and very odd at Alinea was there lack of a fine spirits list.  Traditionally, I like to complete a fine dining experience with a refined Cognac or Armagnac.  Alinea, upon my visit on August 29th, only had 1 Armagnac and a few Cognac available.  This is absolutely unheard of, even blasphemous, for a fine dining establishment of this supposed caliber and Michelin star rating.  Overall, I just would not recommend Alinea to be honest;  great theatrics but a complete lack of flavor, complexity, texture, etc.  Vastly overrated.  <br><br>The truth is you don't even have to leave Chicago to get a drastically better dining experience.  Simply go to Oriole at 661 W Walnut St and be absolutely blown away, as I was on August 30th, in true 3 Michelin star style; not officially yet 3 anyway.  And choose the brilliant and amazing non-alcoholic pairing.  Now that is innovative.", "pics": null}}, {"review": {"des": "This was a nearly-four hour fever dream of amazingness. I don't know if it was the best meal of my life, but it definitely is in the conversation (on a short list that includes other top places, such as Osteria Francescana, Eleven Madison Park, and Momofuku Ko).<br><br>First off, the food is incredible -- there's a lot of other stuff going on, but if there was no theater to it, it would still be world class food. I'm not sure what my favorite was (there are a lot of candidates, from the parsnip soup with lemon and caviar that we started with, to the black artichoke balls, to the squab that was hidden under coal), but just about every bite was incredible, and we all left extremely full.<br><br>The theater is a huge part of it, though, as is the environment in general, which, to my surprise was not stuffy at all -- the staff there was funny and really down to earth, if not quite casual. That, combined with what felt like basically perfect pacing, really added to the experience. (As did the theatrics, which I won't give away here.)<br><br>In all, an amazing experience that was truly worth the incredibly high price tag.", "pics": null}}, {"review": {"des": "I found it interesting how each review of Alinea varied dramatically from 'best experience of my life' to 'way too expensive, not worth it, disappointing'. If you're not super passionate about molecular gastronomy and the $300 pp price tag seems on the high side to you, this is not your type of place. If however, you are like me and watched Chef's Table fifty times, think Grant Achatz is a sheer genius, and find sheer joy in eating a dish the size of your finger with 100 ingredients you can't even begin to pronounce...well then, you don't even need to read my review, you and I both know you will love it!<br><br>I will briefly give a synopsis of our experience: <br><br>I was told by a few people who ate at Alinea before their 2016 renovation that the dining room was incredibly quiet and the atmosphere was stoic. That was not the case during this visit. It was lively and comfortable and the conversation was enjoyable but not overwhelming. <br><br>Upon arrival, we were escorted upstairs to do the Salon tasting. There were six tables in the room and everyone was on various stages of their meal, taking pictures, staring in awe and deeply engaged in the experience. The room seated 20 people and was serviced by three, handsomely dressed gentlemen whose attention to detail was nothing short of perfection.<br><br>Every dish was so unexplainably interesting, a true combination of molecular gastronomy along with a sense of bewilderment and complete sensory overload. Our menu for the evening included: Osetra caviar on a banana pancake with allium; crunchy rouille nori; langoustine paper in a bouillabaisse with olice oil; peeled tomatoes with nuts, orange and sherry; bocadillo with a manchego cheese baguette and onions; black bass with shellfish and kuzu; kaffir lime and tropical fruit; maitake mushroom with bluberry and lapsang souchong tea; potato with truffle and Midwest dairy; turbot with crunchy black rice, pinapple and hearts of palm; salsify root with spices; sweet potato, chocolate and miso dessert; bubblegum, cake and strawberry dessert; and the famous, grape flavored helium balloon.<br><br>The sweet dishes were the epitome of gastronomy. The first dish was a 'rock' filled with chocolate ganache alongside sweet potato ice cream, and matcha. The texture and combination of flavors was outstanding. The following dish was described to us as \"nostalgia\", it was a combination of childhood flavors including bubble gum, cake, and strawberry with banana ice cream and cherry flavored glass. Each piece of 'bubble gum' was frozen with nitrogen oxide and each bite released a strong bubble gum flavor that was reminiscent of youth. As we were finishing this dish they came over with their famous edible balloons. <br><br>I have eaten at a number of restaurants that include tasting menus. Sometimes the dinner can feel like an eternity but this meal lasted a little less than 3 hours, but seemed to go by rather quickly. We never waited more than 15 minutes between each course. <br><br>I was able to engage the incredibly attentive staff a few times and while they were friendly and cordial, it was obvious they were there to do things in a systematic way and were on a timely schedule. Those three men moved around that dining room with ease as if they were part of a choreographed dance. Nothing ever seemed out of place.<br><br>My only minor complaint was that I felt a little rushed. However, we had a 6pm reservation here and a 9pm reservation at the Aviary, so they had a check in our hand for the bottle of wine by 8:40pm. All and all I loved every minute of it, I cannot wait to have the opportunity to go back!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/59kaEJqiEBVn4U_J_6eGcg/348s.jpg", "caption": "First course, our introduction!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kluVyLCYo0WJCqlnX84CkQ/168s.jpg", "caption": "Course 3! Mmmm!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xMfeYamxQQaUOob2eyNgPQ/168s.jpg", "caption": "Course 3...sensory overload!"}]}}, {"review": {"des": "Ok, 4 stars for the experience, ambience, wait staff, and desserts. And three stars for other food. We got the. Here you are obv paying for great service and the whole experience which I think is what I had imagined it to be. The staff were lovely and not pretentious which was great, offered me a pashmina when I felt cold. The desserts seems to be bursting with flavors (small orange with liquor, the balloon, the banana split was to die for, the Marischino cherry drink was amazing). My husband enjoyed the flavor of the food more than I did...think he just liked how unique the flavors were. I loved the part where we went into the kitchen to see how they make some drinks. The food came out at a great pace and the waiters were good about answering any questions we had about the dishes. We were surprisingly full after our meal too!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/soJxzVR0RJ8CsoNATfoKUw/348s.jpg", "caption": "The green apple balloon dessert!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/o4fFuc3EYJn_FLZRBCx1gw/168s.jpg", "caption": "Vanilla bean infused beef jerky"}]}}, {"review": {"des": "There isn't much to say that hasn't already been said, but I do want to point out that as VIP as this, it is nothing to be intimidated by. Alinea was my first Michelin-starred restaurant, and I was nervous about how to dress, how to eat, when to sip my water, if the server would know that I had no idea what was going on. If you happen to be in the same boat, don't worry. You can't go wrong. There was a man in nice jeans here sitting next to a woman in a long dress. The servers were courteous and professional but still maintained personality. I absolutely loved being served each dish and having an explanation for each one.<br><br>The food was the teeniest, tiniest bit not as  great as I thought it would be, but I think my expectations are so high that what I'm looking for doesn't exist. A few of the courses weren't memorable, but that being said, each and every one had something that made it unique to Alinea. Nothing was served standardly. I had the best bite of my life the night we dined here (a creamy yet oily coconut soup with black bass and cucumber). Even the water was delicious! It was well worth the money, both for the food and the experience. A night I was absolutely always remember.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5NjHB_-ngf1QLlrCHYA3zA/348s.jpg", "caption": "I have a really vivid second of this dish; recalling it as if I were still there enveloped in refreshing lemon air &tasting a cold ham powde"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zrAacDc3XjeU1HZUnf9hyg/168s.jpg", "caption": "Langoustine (in between a shrimp and lobster) dehydrated into paper falls into bouillabaisse with olive oil."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sW0AHaDz3YeuEQ5mtDh4bA/168s.jpg", "caption": "Hello, love, why is there not more of you?"}]}}, {"review": {"des": "So absolutely amazing that I don't even know what to say about it. You have to try it at some point in your life! The food, the flavor, the aromas, the creativity, and the staff were all incredible! Seriously life changing experience! We will definitely be back!", "pics": null}}, {"review": {"des": "Best restaurant I have ever been to.<br><br>Highly recommend watching the first episode second season on chefs table before going. <br>It was great to hear the chefs story and background. Plus this gives you an insight on how much thought and preparation is put into every course<br><br>Can't wait to go back!<br><br>Tips: book in advance. Do not pick a late night time, because the meal lasts about 3 hours. Come hungry!!!!! Do not drink before hand, because you need all the room you can for food. We did not do the pairings with cocktails but did get a bottle of wine. We didn't finish the wine.", "pics": null}}, {"review": {"des": "Top service and interesting concept. This restaurant is less about the food (although it's good) and more about the experience. <br>It's like going to a culinary show. You sit down, the lights go out and it's \"show time\"!<br>The decor says it all too. There was a person made of an unidentifiable shinny material hanging in the wall. I couldn't decide if it was creepy or cool.<br>Without ruining the surprise, I will tell you that the restaurant takes the dinners on a journey that involves all senses - smell, sight, touch, taste and sound... with an element of mystery and constant wonder of \"where are we going now?\" And \"what's next?\"<br>It's an experience like no other and I understand why it's so hard to get in. <br>The food, to me, was not as entertaining. Maybe because everything else in the experience took over. I felt like the food was more in the background and I was constantly wowed by something else. <br>Give it a try and let me know if you agree. See if you can get yourself on the list today though, getting a spot isn't easy.", "pics": null}}, {"review": {"des": "Ah, Alinea. Every year for our anniversary, my husband and I try to go to a restaurant that's certainly a splurge, but also an experience. Compounded with the need for a vacation, Alinea as our anniversary dinner was perfect. In what was almost a three hour dinner, I've never had such a wonderful dining experience as I did at Alinea. Grant Achatz literally hits all of your five senses. Beautiful flower arrangements and dry ice for the eyes. Music that follows the flow of the meal for the ears. Various scents brought in to bring nostalgic memories to mind. Using your hands and fingers to eat with for the touch factor. And of course, hitting all of your tastebuds. <br><br>Throughout the whole meal, they keep you on your toes by providing various surprises and presentations. One minute the lights would be on, the next, there's a bowl of fire placed on your table and you're eating a coconut oil shard that looks like ice in the dark. Crazy, I know. The documentary on Netflix definitely does a fabulous job of highlighting the creativity of what goes on in the kitchen, and had I not seen it, I'm not sure I'd be able to comprehend what we experienced. Certainly if you ever find yourself the opportunity to go to Chicago and eat at Alinea, I don't think you'll have a single regret. It's certainly a pretty penny to eat here, but I'd like to think of it more as experiencing art at a museum rather than viewing it as \"just food.\"", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cj89YwaTL0Ma1Mx3xJk7Iw/348s.jpg", "caption": "Dessert and a show?"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/62DGMa_C8TqhYB3izNtrNw/168s.jpg", "caption": "The notorious edible balloon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EkEY_s8BooY5OR7yN8Y9BA/168s.jpg", "caption": "Seaweed and fish under rosemary"}]}}, {"review": {"des": "Amazing. Crazy prices and super good service. <br><br>10 pairings. Omg. Get there. Dress nice. Good looking restaurant as well. <br><br>You go into the kitchen. Again omg. <br><br>A must when in the Windy City.", "pics": null}}, {"review": {"des": "The famous edible balloon! <br><br>Alinea is on the top of our list to try and we made it! Unfortunately, The Gallery ($285 - $355/pp) wasn't available on the night that we were hoping to dine so we purchased the alternative menu, the Salon ($175-$255). It was quite the disappointment since we are flying across the country to dine here. Anyways, Alinea as one of the most desirable places to get a table in America, the reservation was hard.The seats go fast and we were juggling two computers trying to get a table for us on the day of release of the date. <br><br>On the day of arrival, we were about 30 minutes early and they weren't entirely ready to settle us in at the Salon. We waited about 15 minutes before getting seated. We started off with the first bite and a huge tin of oranges. Alinea is known for the creative art of food and it did not disappoint at first look. The setting of the restaurant was very romantic and yet very fun. Every course was very unique and unlike any other fine dining I've been to, this offers surprises after surprises. <br><br>Words just cannot do justice of the amazing dining experience we received. Would definitely love to revisit in the future to try their Gallery or Kitchen Table experience.", "pics": null}}, {"review": {"des": "I hate to say this but I think this place is beyond yelp or at least in a different category than most restaurants.  This is not just a restaurant, it is an experience.  I went in knowing very little about it and I am so glad.  I was stunned, surprised, and awed.  For the true foodie, you need to make it here.<br><br>We did the saloon experience.", "pics": null}}, {"review": {"des": "My wife and I ate here back in February 2018.  What makes this place memorable is the creativity in how the food is made and presented.  It's truly an experience that makes one constantly wonder in joyful anticipation ...what's next?  The only thing that would make the experience even more memorable are wine pairings that's just as creative, surprising, and able to elevate the food to a whole 'nother level ...similar to Eleven Madison Park and Le Bernadin.<br><br>--  Slowly chasing the #Worlds50BestRestaurants...", "pics": null}}, {"review": {"des": "Definitely one meal I'll never forget.<br><br>I came here for my birthday and it was a fabulous experience. Upon entering the dining room, I could smell the orange / citrus aromas floating in the air. While I don't want to give away any dishes on here, because I think the element of surprise is very important for this dining experience at Alinea. <br><br>Most of the dishes are paired with a smell or visual element to integrate all the senses. There's usually story about the inspiration behind each dish, which I thought provided a nice backdrop to the experience. Apart of that, impeccable service and great ambiance. Though I have to say, the table seating is not as intimate as I'd like for a dining experience like this. The room is pretty loud and tables are placed very close to one another.<br><br>Overall, highly recommend checking out Alinea for one of those special occasion meals!", "pics": null}}, {"review": {"des": "50 if possible I would give it!!!!! <br>This is by far the best all five senses and life experience one may ever have with food and a dink g experience!! We visited Chicago specially to attend one of the 18 course meals wot pairings. NICOLE was the best ever. Most may equate her to a waitress or hostess, but I consider her to be the adhesive of the glue that holds this entire experience together!!! <br>The food is a literal creative genius placed in varied dishes, which all are part of the tying in the other senses the the experience...<br><br>This is worth every single penny one may spend and the chef and his entire staff are literal food geniuses....", "pics": null}}, {"review": {"des": "I don't know how much I can add that hasn't been already stated, but my experience at Alinea was truly an exceptional adventure.  <br><br>The service was impeccable and we felt very well taken care of throughout the evening.  Each dish played with all of your senses and the theatrics were incredible. I enjoyed certain courses more than others, but the thought, innovation and creativity behind each course impressed me.", "pics": null}}, {"review": {"des": "Am I at a show or restaurant? Half way through our dinner, my head was spinning. I was also pretty boozed up at the time. <br><br>Is the wine pairing worth it? I unknowingly bought just one wine pairing for my wife and myself (and I thought my bill was already expensive). The restaurant was kind enough to let us split the pairing and even gave a separate glass to my wife. We still couldn't finish all the wine. I know some may have felt the portions are small and left hungry by the end. I guarantee you won't feel that way if you get the wine.<br><br>How's the food? It's a mind bending experience. I'm not sure if you can call it \"food\" in the traditional sense. Just like any multi-course dinner place, there were things I loved, hated, and got confused. I was confused a lot here. Molecular gastronomy is a new territory for me and not everything resonates with me yet.<br><br>For a $1,000, what are you paying for? You are paying for a show that will challenge the way you see food. It can be beautiful, deceptive, fun, and broken. <br><br>Overall, I can see where for many people; this may not be the restaurant for you. Be ready to be challenged. If you aren't, you can go somewhere else and be plenty happy.<br><br>My wife and I have plans to come back for a significant anniversary.", "pics": null}}]}