{"name": "art-institute-of-chicago-chicago-3", "reviews": [{"review": {"des": "Even if you're not into art, you have to come here.  It was recently rated the best MUSEUM in the WORLD.<br><br>I've always been very moderately interested in art.  At least I thought I was, until I came here.<br><br>I know people say this all the time, but seeing some of these pieces in person really changes everything.<br><br>The color, the dynamic range, the utter 3D-ness of some of these paintings was incredible.  It actually made me not like modern art...it looks utterly childish compared to some of these ancient paintings as big as a human (or even bigger).<br><br>Facility is well maintained (it looks brand new it's so spotless) and the staff are friendly and efficient.<br><br>The only downside is that you have to \"check\" a bag/backpack here.  Was a bummer to have to only have one lens for my camera, but I get why the rule is in place.", "pics": null}}, {"review": {"des": "It's a shame that I don't take advantage more often of what Chicago has to offer.  As usual it takes an out of town guest (in this case my brother from Berkley CA) to go to one of the best art museums in the world.  What more can I say because if you've been to The Art Institute of Chicago you know exactly what I'm talking about.  <br><br>They have an awesome collection that has permanent residency in the museum, but they also change up exhibits so there is always some new exhibits.  The last time I was their there was an exhibit on Chinese art.  This time the same hall had an exhibit from The Japanese Ukiyo or Floating Pillow World was there in place of the Chinese Art.  We also walked through an exhibit that had a ton artifacts Arts of Southeast Asia that was interesting.  I wish we had a little more time, but tomorrow's another day", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TZensoM1jWvn_vii_G0iLA/168s.jpg", "caption": "Cool cable supported bridge & stair"}]}}, {"review": {"des": "The Art Institute of Chicago, what to say?!<br><br>It's amazing! You have to stop by for a look, if you are in Chicago. I was lucky enough to make a visit recently and I love it here. My friend and I were in the city for the day and we had a lot planned... but this place is huge and we pretty much spent 90% of our day exploring the amazing art.<br><br>I have always wanted to see 'A Sunday on La Grande Jatte' by Georges Seurat and my dream finally became a reality! Who knew that it was so large?! (That's what she said.)<br><br>On a serious note though... such an amazing art space. So many artists, so many time periods, so many art movements.Truly amazing!<br><br>#ArtTeacherApproved", "pics": null}}, {"review": {"des": "What can one say that hasn't already been said? An incredible museum. In this native New Yorker's humble opinion, while smaller in size than the MET, the Art Institute packs just as much of a punch. Not a 1 day museum. In particular, I love the space devoted to the Impressionists - a great collection of Van Gogh, Gauguin, and Monet paintings, among others. The modern art wing is wonderful too. <br>All that being said - this museum is ridiculously expensive and out of reach for too many. One free day a week is hardly enough. You're even charged to check your coat! This sets the stage for (again, IMHO) an elitist space that has so much to offer but can't be offered to too many. Even in these tough economic times, there is simply no excuse for this.", "pics": null}}, {"review": {"des": "One of the best art museum in the US...maybe the world. Many great masters are displayed here! I come back every time I visit Chicago. Prices are reasonable,and staff helpful...especially when you get lost in a huge place like this! The time I went wasn't too crowded but plan ahead if it's around the holidays or special events. I got here when they opened and spent practically the whole day here.", "pics": null}}, {"review": {"des": "This is always such a wonderful experience. Everything is just a feast for your soul and so inspirational. <br>My brother visiting from Cal. Was ever so kind and purchased a membership. So along with Mark and Phil S and Joji S. We went in our merry way and explored this magnificent world class art intituite it's very large and we spent around 4 hours on the first floor and had coffee in the members lounge before we explored the Greek and Roman sculptures followed by Chagall and the Asian art. . <br>I will have to bring my kids here soon and friends and take advantage of this wonderful gift. !!", "pics": null}}, {"review": {"des": "What a fantastic museum.  It's located in Millennium Park.  It's Open daily 10:30-5:00, Thursdays until 8:00.  Buy your tickets online before going in order to avoid the lines.  They offer discounts for Chicago residents.  For those visiting from out of town, it's $25 for general admission or $35 for the fast pass (Fast Pass allows visitors to bypass the general admission lines at entrances and offers access to the museum's galleries and nonticketed exhibitions).  Fast pass was worth it alone to avoid the line getting into the museum.  <br><br>The art is separate by genre and/or artist: modern wing, photography, mini rooms, Islamic art, textiles, paperweights, asian art, african art, american art, greek/roman/byzantine art, folk art, european art, medieval/renaissance, contemporary, modern...  The exhibits are fantastic and museum is artwork in itself.  The museum is gorgeous.  Additionally, we went on a Saturday and although there were lots of people in the museum, it was not overly crowded.  <br><br>Definitely recommend this museum.  It's one of the best I've been to.", "pics": null}}, {"review": {"des": "Wow! Wow! One of the premiere museums of the world. Masterpieces all around and even if you are not that much into art you'll recognize some of these gems. Situated right in mellinium park it is very easy to get to within downtown chicago via train or bus. The line to get in wasn't too bad and it flowed quickly. About 10 min. midweek in autumn.<br><br>The layout of the museum is great. Easily walkable to each exhibit and genre. The highlights for me were the Monet, Van Gough, Edward Hopper, and sculptures. Feel free to imitate your favorite Ferris Bueller scene. You'll definitely get a lot of amazement and culture from some of these great priceless works of art.", "pics": null}}, {"review": {"des": "It is absolutely 100% worth the steep $25 price of admission per person to visit the Art Institute of Chicago.<br><br>During our walk through I absolutely could not believe I was seeing art I had only seen referenced in movies or online. The gorgeously flowing Dagas pieces, 'The Bedroom' by Van Gough, and my personal favorite 'Bridge Over a Pond of Water Lilies' by Monet - a picture I had a print of as a child and would copy over and over again.<br><br>The Art Institute is huge, although I wasn't a fan of most of the first floor and moved on to the impressionists fairly quickly. Other favorites of the day included 'Paris Street; Rainy Day' by Gustave Caillebotte, whose work I wasn't familiar with and the beautiful jeweled box off in it's own small room in a corner.<br><br>This was a wonderfully amazing visit and I'm so excited to return to see 'Nighthawks' when it's back on display!", "pics": null}}, {"review": {"des": "This is my favorite art museum in the US.. best I've ever been to in recent years. I budgeted 2.5 hrs to be spent and it was most definitely not enough. Toward the end of my budgeted time, I was speeding through the sections hoping to squeeze in as many pieces as possible before I had to leave... I don't think I've ever done that at a museum before. I am a big Impressionist fan and was blown away by how incredible the section dedicated to it was here. And I couldn't believe how beautiful this space overall! 1st floor galleries, 3rd floor modern art section, Chicago skyline you can see through the glass windows... even the museum store is fantastic. The only thing I didn't like was how I had to cross the gallery cafe to get to another side of the building, but it is not a big deal.<br><br>Take advantage of free admission with BoA credit card every first weekend of the month, but it's most definitely worth paying full price for at any time. If I ever live in Chicago in the future I plan on becoming a member.", "pics": null}}, {"review": {"des": "This is another one of those places that is so amazing, that I don't have enough superlatives to describe it. The place is so huge, and filled to the brim with incredible art, that half a day is barely enough to scratch the surface.<br><br>My only complaint, if I had one, is that even with maps I kept getting lost and had trouble finding the exhibits I wanted to see. Plus, I felt like the restrooms were a little too hidden.<br><br>Other than that, being able to see original art by the world's most famous and talented artists was definitely awe-inspiring. I love that I could get so close to the pieces and really study the details.  Another benefit to the place being so large is that no one area was so crowded that I couldn't take all the time I needed to ogle a masterpiece.<br><br>My favorite piece of all was the Chagall's America Windows exhibit. It was hidden in kind of out of the way place, but it is 100% worth it to find it.  Wow!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/m0RkI6HHKts1Hc8QmhCjPA/348s.jpg", "caption": "Just a bizarre cool piece I loved."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GLAAuzmmVeUvi4jo4WrqEg/168s.jpg", "caption": "Andy Warhol does Marilyn Monroe."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8RoD0E5PBllpjQqmyBo5MQ/168s.jpg", "caption": "Two panels of Chagall's America Windows."}]}}, {"review": {"des": "Wonderful museum! I still don't feel like I got to fully explore it all. <br><br>Great place to be! So many exhibits and so many great spaces to be in. Definitely worth the money and a great way to spend some time in Chicago. <br><br>Would say that the lines could get long, but definitely worth it.", "pics": null}}, {"review": {"des": "It's sooo big...I regret not coming here earlier...if I had longer time to stay, we would have stayed longer...but we did this in 2 hours. <br><br>The line is long...we got the Chicago Explorer Pass, so it counts as fast pass, go to the receptionist and he'll exchange it into tickets for you. Skip the whole line and save some time for some art! The ticketing lady did not tell us this and she was super rude. The guy who helped us was super nice though. <br><br>There were many rooms and 3 floors. We initially took our time but noticed the time and had to go to dinner, so we started scanning through each room and couldn't read everything. The art work in here is cool- they had a Van Gogh room...we aren't art-loving people (but we enjoy seeing it) so we weren't sure if the paintings in there were the real deal because there's a Van Gogh museum in Amsterdam...do they share or something? Also the sculptures in the Asia exhibit were awesome...again we questioned the authenticity of it but asked a staff and she confirmed everything here is original and that just blew our minds!!! Crazy how well they are able to preserve it. We are glad we asked and came to see actual art!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zUDsBT51MQfAPQIZ5B0T9Q/348s.jpg", "caption": "Cool art"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/riAeXosf1maUIoEBKnZCOw/168s.jpg", "caption": "Art"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/cmagIrqwnEFsnpC4Flmlrw/168s.jpg", "caption": "Painting"}]}}, {"review": {"des": "Ah yes, a Chicago staple. I hadn't been here since I was a kid on a field trip, so a visit was overdue. <br><br>Be warned that you have to pay to check bags, but I didn't mind that bit. <br><br>The layout is confusing but there's maps available and pretty good signage to help you navigate your way. I was nursing an injury and had to sit frequently. I was very relieved with just how many benches there were, as that's not the case in all museums. <br><br>The staff was a bit off putting. There were workers who were overbearing and lecturing to captive audiences, which was a bit much. Then there was the security guard who was breathing down the neck of anyone who was under the age of 40. Art museums are quiet, contemplative places. It's really uncomfortable to be trying to admire art in a small room with a dude just staring you down from two feet away. <br><br>The piece I most wanted to see was on loan, which was disappointing but it happens with all the museums so, I understood. <br><br>This is a place worth going to if you're visiting the city, or if you're a fan of art or history. Just be aware of some staffing issues; it's not a dealbreaker, but I hope you get a better experience with them.", "pics": null}}, {"review": {"des": "I have nothing bad specifically to say about the Art Institue, I've simply seen better - so I was a bit underwhelmed. It's a staple in Chicago, so I'd definitely recommend visiting. But I'd prefer the MoMa in San Francisco or LACMA in Los Angeles. I did love their collection of contemporary art although I wish it was larger and more extensive. This is an average museum that's still worth a visit. The architecture on the exterior is the best part of the museum - it's beautiful! No real complaints.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Y73IkilnyDGoH0hOtT05xA/348s.jpg", "caption": "IG @jessijaejoplin"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YayKRGCfibR7gfga-jDw0Q/168s.jpg", "caption": "IG @jessijaejoplin"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HjRUxwwEnWR1H_vBo7jXuA/168s.jpg", "caption": "IG @jessijaejoplin"}]}}, {"review": {"des": "Saw the museum for about 1.5 hours. Just the right amount of time to see all the highlights at a leisurely pace. Definitely could easily spend another 60-90 minutes here just exploring the European Art section. <br><br>Interior is modern and spacious. Each gallery area has its own theme to go with the art. <br><br>American Gothic, Monet water lilies, Nighthawks were definitely the highlights for me. <br><br>Purchased the Sky tower & Art Institute combo pass in person. Saves about $6 and includes fast pass to sky deck in Willis Tower.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/t2dqwr4wqQR5Vq_v1Cjz5Q/348s.jpg", "caption": "American Gothic"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hFXfc2_EghSl4iBIbnhUZw/168s.jpg", "caption": "Water Lillies"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S_ig1OiZvqowATDYhf2cgw/168s.jpg", "caption": "Nighthawks"}]}}, {"review": {"des": "A must visit when in Chicago. Usually for me it's an all day outing. Today I had about an hour and a half to kill so I just went for the current exhibit. This was a wonderful way to do it and I'll try to do that more often.", "pics": null}}, {"review": {"des": "I was really impressed with the Art Institute of Chicago! I'm no art expert, but I do enjoy looking at a variety of art, and the Institute has an extensive collection - 3 floors and 2 connected buildings of everything from modern and contemporary art to architecture to Impressionism to photography to Asian art, etc.<br><br>We spent ~3 hours in here and ended up skipping a few sections of the museum as we realized we were running out of time. I did get to see all of the exhibits that I was most interested in, but for a really thorough exploration of the museum, you could stay here for the entire day! So much to see.<br><br>There were actually quite a few famous pieces that I recognized - Nighthawks (nighttime view of a diner with a few people inside), American Gothic (woman and farmer guy holding a pitchfork), lots of water lilies by Monet, Van Gogh's self-portrait, Georgia O'Keeffe's cow skulls and clouds, and more.<br><br>Also really loved the intricate detail in the Thorne miniature rooms in the lower level!<br><br>For lunch, they do have two cafes and a restaurant within the museum; but you can also exit the museum, eat nearby, and then re-enter with your ticket on the same day. No open drinks allowed inside (I chugged my coffee right outside the entrance), but water bottles are fine.<br><br>Worth a visit? Definitely! This place is a treasure.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Pg9A2jpu7X_L3tPxD-8maA/168s.jpg", "caption": "Beautiful glass and wood stairs and huge windows - love the space"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T6CJEyK4IIcWk_vBpxWsQg/168s.jpg", "caption": "Love all the natural lighting in this entrance area"}]}}, {"review": {"des": "World Class<br><br>If you appreciate fine art, a visit to the Art Institute of Chicago will enhance any visit to the area. I make sure to schedule at least a half day to spend at the AIC every time I'm in town. The permanent collection is outstanding but what has struck me on several occasions is the quality of the special exhibits, which are an excellent demonstration of the curating staff's skills.<br><br>The AIC is huge - 2nd only in sheer acreage to New York's Metropolitan Museum of Fine Art of museums in the US. For first time visitors, the institute's map may be a bit confusing - my only real criticism of the place - but floor staff are plentiful, helpful, and knowledgeable.<br><br>I can also recommend the cafe on the lower level for lunch. Outdoor seating in warm-weather months is delightful. Parking is available under the adjacent Millennium Park, which is another downtown Chicago gem worth making time for.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/c0Frnum7xxXqndoPeaL7nA/348s.jpg", "caption": "Gustave Caillebotte's Rue de Paris, temps de pluie (Paris Street, rainy day) is but one of AIC's impressionist gems."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lHGzyMxEc7XiReu9oRr6-g/168s.jpg", "caption": "Although the AIC's collection is best known for works from the last few centuries, it does include fascinating examples from ancient times."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hwqxnRPZPvXLRiXBmRZk0Q/168s.jpg", "caption": "Quality of special exhibits curation is noteworthy. A recent John Singer Sargent exhibit exemplifies what this world-class museum offers."}]}}, {"review": {"des": "Wow. I'm not big into museums and I'm not big into art but this was a very enjoyable experience. Seeing familiar art throughout made this an incredible visit. <br><br>The museum is organized and well with many employees throughout. It has a great layout and there's enough space to enjoy and not feel too crowded other than the really popular pieces. If you go early on a weekday when they open, I think you could easily enjoy a couple of hours with little traffic. <br><br>If you're in Chicago and just have one day to be a tourist, the Art Institute should be at the top of your list. Well worth the price of admission I would not hesitate to return. Also included in the City Pass we purchased.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FOrE9fxSlQ-5t_YYAzQFUA/168s.jpg", "caption": "I know this piece - we all do, right?"}]}}, {"review": {"des": "My favorite art museum and I've only visited it once just recently. Upon walking in and paying for my admission, I was asked where I was visiting from. I said Arizona and was given the warmest welcome (thank you!). I truly loved every minute at the Art Institute of Chicago. Anytime I had a question, it was answered kindly and if I needed help finding specific art collections, I was guided with clear directions to the exact location. Even visiting the gift shop was fun. While I admired the jewelry, I was encouraged to try on the beautiful pieces. I can't say enough good things about this museum. I absolutely loved the art, but the people made it an even better experience!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Z0bnQt_gkhAh5CyxnMqATw/348s.jpg", "caption": "Painting by Claude Monet"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oX5QsJicwR82py-hPyAMzQ/168s.jpg", "caption": "Painting by Claude Monet"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Vi_2fw8k0SMBpnjlE8qE3A/168s.jpg", "caption": "Haystacks by Claude Monet"}]}}, {"review": {"des": "Time to spare before the airport but not enough time to see this magical place. The paintings , art are incredible. A must see. Paid $25 dollars for entrance fee plus additional $7 to see Special exhibition of John Singer Sargent. Was able to see Monet, Manet and van Gogh, Seurat and my favorite.......Jean Leon Gerome for the Portrait of a Woman. <br>If you have time, definitely stop by this museum!! Trust!", "pics": null}}, {"review": {"des": "I absolutely loved this museum! Wish I had more time here so I could more carefully look at everything, we only had 2 hours to quickly walk through the majority of the exhibits. The collections and area is expansive to the point that you can get lost in there without a map. Especially enjoyed the medieval armor and impressionist galleries. Staff are helpful, bathrooms are plentiful and clean. This place puts every other art museum I've been to so far to shame!<br><br>During busy season there are long lines at the entrance. Chicago Go pass and special passes have separate line to get in and bypass the regular line.", "pics": null}}, {"review": {"des": "This is a world-class museum, comparable to the likes of the Metropolitan Museum of Art and the Louvre. The Art Institute is a must-visit for any art lover in Chicago, and has something for everybody. It's such a peaceful place and a good place to spend hours if you need a break from the world. Its rotating exhibits are often really good, and I love stopping by as often as I can (not nearly as often as I'd like to) to check them out, as well as walk through their collections of Islamic textiles, Asian art, Impressionism, and anything else you might imagine.<br><br>The Art Institute is surprisingly large, but not in an overwhelming way. I love that it has art from all eras and periods, and really caters to a wide range of tastes. The AIC is a gem, and one of my favorite museums in the world.", "pics": null}}, {"review": {"des": "The Art Institute is one of most prominent Chicago attractions for everyone who loves art. It is mostly known for the impressionist paintings.  However,  besides the fabulous impressionists collection, I  also really like their modern art, ancient Greek/Roman section, and the Miniature Room collections. Every time I visit, I spend hours wandering through different rooms and reading  about people depicted in the paintings. My When I get hungry and tired,  I make my way to a cafe downstairs and sit by a fountain in a courtyard.  Afterward I  am energized and ready to explore the Art Institute again.", "pics": null}}, {"review": {"des": "There's a reason the Art Institute of Chicago is one of the highest rated museums in the country: it truly has a phenomenal collection and great rotating exhibitions. I particularly loved their glass paperweight collection to awe over the fabulous Paul Stankard's work. The Tomma Abts exhibition was a showstopper, and the exhibition on the Hairy Who was enlightening to learn about some of the Chicago art scene. I'm sad I didn't get to go through the whole museum (there just wasn't enough time!), but this is a must-see in Chicago!", "pics": null}}, {"review": {"des": "Worth the price of a trip to Chicago! This museum is amazing and while some of the workers are a tad rude, the art doesn't snap at you or yell at you, so if you can ignore the nastiness it is amazing! Seeing some of the amazing art that I teach my high schoolers about every year brought tears to my eyes. <br>The layout is fantastic. Everything is labeled well. The museum itself is HUGE! I could easily spend 12 hours wandering around and still not truly see and soak in everything! The gift shop is large and designed so you want one of everything! <br>Definitely get the City pass if you can - you get the  audio tour included!", "pics": null}}, {"review": {"des": "My preference will always be historical artifacts, statues, and arts from different cultures, civilizations, and time periods. We spent 4 hours in here with so much to see, and not enough time to stroll through every exhibit.<br><br>Favorites<br>- Anything with Asian, Indian, and Egyptian art and history<br>- Ivan Albright<br>- Christian art<br>- America Windows by Marc Chagall<br><br>Security - Friendly, helpful, and eager to assist you in finding your way and informing you about today's highlights.", "pics": null}}, {"review": {"des": "After many work trips to Chicago, I finally enjoyed a personal trip, allowing an afternoon to enjoy this beautiful art institute.<br><br>Ticket purchase at the entrance was swift, and they offer ticket combos to other attractions, such as the Willis Tower, if you so desire.<br><br>There are three floors with endless exhibits covering many eras, styles and cultures. It is a beautiful, clean white space that is easy to navigate through, even on a busy weekend. The 1st floor is the largest but there are ample pieces on both the 2nd and 3rd floors as well.<br><br>I would highly recommend a visit when you are in Chicago!", "pics": null}}, {"review": {"des": "Can I go back? I want to go back. <br><br>I spent hours in this museum and I still don't think I saw all the nooks and crannies that I needed to see. <br><br>Conveniently located at the end of Millenium Park, I wandered into the Art Institute of Chicago and used my Chicago CityPass for expedited entry. Love it. Though there were various school / class groups in the museum on the morning I visited (Thursday, May 3rd... I think?), the museum is large enough that it wasn't a huge disturbance (unless they were yelling or running around one of the halls - but that was minimal). <br><br>The museum is well organized and the collections of art and sculpture work are just beautiful. I can understand why the museum is so highly rated. Even the outside of the building feels like a masterpiece, with the North and South Lions seemingly guarding the building. <br><br>There are, of course, the pieces from Picasso, Matisse, Dix, Van Gogh, Renoir, and Monet... but it's so easy to become absorbed in the works that are also somewhat less recognizable. I would be lying though too if I didn't admit to making a point to find \"A Sunday Afternoon on the Island of La Grande Jatte\" by Seurat to stand and stare for a bit, Cameron Frye-style, at the beauty of such pointillist technique.<br><br>TL;DR  What can I say that hasn't already been said? An incredible collection of art that helps rank the Art Institute of Chicago up there as a \"must see\"... just make sure you give yourself plenty of time to really wallow in the experience. This visit should not be rushed.", "pics": null}}, {"review": {"des": "The Art Institute of Chicago is a world class facility. I loved it a lot more than many art museums I've been to, because it has so many classical paintings and some of my favorite impressionist artists. The museum spans 3 floors and prepare to spend 2-3 hours here.<br><br>We arrived at the opening hour around 10:30 on a Friday and there was already a line. However, we got in fairly quickly and were able to check our umbrellas and coats ($1 per item)<br><br>The ground floor house an amazing miniature collection which are tiny scenes of Japanese, Chinese, English and French rooms built to scale with accurate time period furniture. Each one was constructed artfully and you felt like you were peering into a royal's living room. Most impressive was there were multiple rooms that gave the illusion of outdoor scenery or additional rooms. One of my favorite parts of the museum.<br><br>The main floor held Japanese and Korean art. Lots of pottery and Buddhas. A nice display, but nothing I hadn't seen before.<br><br>My absolute favorite floor was the upper floor. This is where they have a whole wing of Impressionism art include Renoir and Degas. My parents had some prints of these hanging in their living room as I was growing up and it brought back so many nostalgic memories. There were also many Italian Renaissance paintings and a whole room decorated to weapons and armor.<br><br>The Art Institute is another must visit if you are in Chicago. It's amazing representation of fine art and a world class museum.", "pics": null}}, {"review": {"des": "LUXURY to the max at $150 per year.<br>I hope more and more people support this great institution, one of the very best museums in the world.<br>Lucky Chicagoans....", "pics": null}}, {"review": {"des": "So much to see here! <br><br>The Chicago photography exhibit was really cool.<br><br>We went with our city pass.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/44_0VEgBG3hEc2GzufRowA/168s.jpg", "caption": "Florine Stettheimer!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/e5R4lE1CN9Sb0Bj9EQM24w/168s.jpg", "caption": "Sports illustrated photo shoot in the museum"}]}}, {"review": {"des": "This is my home away from home and absolute sanctuary. Anyone who finds themselves in Chicago, either as resident or visitor, needs to spend at least a few hours in this gem of an institution. My current favorites:<br><br>Always on View<br>1) The Rock by Peter Blume - Such a stunner; an allegory for humanity and our place and symbiosis, or lack thereof with the Earth. See it in the American Wing 1900-1950.<br><br>2) Painting with Green Center by Kandinsky - I think Kandinsky's work simply blows away what his contemporaries were doing (yes, even Picasso). See it in the Modern Wing, 3rd Floor<br><br>3) The Geranium by Henri Matisse - Some of the best use of color I've ever seen. What a master. See it in the Modern Wing, 3rd Floor<br><br>4) Haystack Series by Monet - Yes of course the AIC has a totally ridiculously extensive Impressionist collection (Thank you Ryerson and Palmer). But it never got better than the Haystacks by Monet. This series got Kandinsky into art. Enough said.<br><br>5) The entire Bergman collection - The gold standard for collectors (sorry Edlis). Followed their hearts and not their wallets, and it shows. My highlights are The Banquet by Magritte and Gorky's Self-Portrait, but it's all amazing. <br><br>I could list 50 more but want to attempt conciseness. Message me for more recommendations. <br><br>Limited On View<br><br>1) Finnish Painting by Pope.L  - A visual vocabulary for our time now. See it in Contemporary Art, 2nd Floor<br><br>2) The Drawing Room by Nicole Eisenmann. One of the best artists alive.  See it in Contemporary Art, 2nd Floor<br><br>What not to see: Many elements of the Edlis collection, especially the works by Koons and Hirst. All ego from the artists, galleries, and collectors convincing themselves that this stuff is important. Sorry for the cliche, but the emperor wears no clothes. (That being said, the Lichtenstein and Twombly in their collection are both incredible so I'm not a total hater).<br><br>I live across the street from the AIC, so send me a message if you'd like a personalized tour free of charge :).", "pics": null}}, {"review": {"des": "Wow, huge art institute!<br><br>You can literally spend the entire day here admiring all the art pieces.<br><br>The last time I was in Chicago, we came too late and the museum was closing. I made it this time!<br><br>Love the Van Gogh and Andy Warhol pieces. Quite frankly, I don't get modern art....<br><br>My highlight was finally seeing American Gothic!", "pics": null}}, {"review": {"des": "Lots of art collections to see. This place has several famous pieces such as Van Gogh, Monet, etc. Also, if you want to know more about American History and the past Chicago with portrait photography, this place is for you!<br><br>Art Institute of Chicago is a must go place for people who love art museum! If I live in Chicago, I would definitely register for a membership here!", "pics": null}}, {"review": {"des": "After living in the Chicago area all my life, it took me moving out of state and coming back for a vacation to finally get me to visit the Art Institute. For my first time being here, I was certainly blown away. First off, by the shear size of the gallery, second, by the incredible work. It was awesome to see such famous pieces that I've only ever seen in books or on the internet. The gallery was enjoyable to walk around, clean, easy-ish to navigate, the audio tour was enlightening, the gallery cafe was decent and moderately priced, and the staff were for the most part welcoming to interact with.<br><br>We did end up checking in our bags, which was quick, priced well, and pretty pain free. It was nice that we didn't have to worry about finding a place to keep our stuff as we were between lodging locations.<br><br>Overall this museum exceeded my expectations. It was nice to finally visit somewhere that I've only just passed by dozens of times. Great tourist spot for young and older adults, but certainly leave the kids at home for this one.", "pics": null}}, {"review": {"des": "Definitely make sure you have a full day if you plan on trying to see it all...this place is HUGE!  Located right next to Millenium Park it's an easy walk from all the major areas of Chicago.  <br><br>We stopped by the Art Institute of Chicago because of many recommendations and it was included on our CityPass.  It is split into two separate buildings, with one being more traditional and one being more modern.  Each building has multiple floors housing a ton of exhibits as you weave your way through all the hallways and corridors.  <br><br>They have just about everything from a huge collection of impressionism art to suits of armor.  It was a great way to spend the day and a must stop location if you're in the area.", "pics": null}}, {"review": {"des": "Used the Chicago city pass to get a fast pass entrance into the art institute. I don't think a fast pass is necessary during the week, not sure if it's a different story on the weekend.<br>There is a lot to see, there is a lot of European art, a smaller collection of American and Japanese art and some other ones. There are a good number of pottery pieces which I was happy about. Two things were a bit annoying. 1. They ask you to check your bag at random. There were a lot of people with bigger bags left in but they asked me to check in mine. (FYI $1. Not sure if you can get it and return it if you need something from it) so maybe take a very small bag to reduce the risk if you don't want to check in things. 2. Some of the displays were very poorly labeled. There were a good number of pieces in one display and no numbers to see which description referred to which piece. Also in a lot of cases the description and the piece were placed far from each other. I wasted a lot of time trying to just match the descriptions to the pieces. Also some pieces were placed too far up out of sight or too far away to see the details.<br>Their alarm system was going off constantly as it seems to get triggered when people aren't even touching things.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KE-OQQpSvK8JJruIKxTsZQ/168s.jpg", "caption": "Japanese art"}]}}, {"review": {"des": "This is a great museum were you can see arts from Van gogh and Picasso im fact there's something for everyone. The museum is big and it takes at leadt 2 hrs to see it. <br><br>This is as good as museum of fine arts of Montreal but not better than New York museum.<br><br>C'est un excellent musée ou vous pouvez voir des oeuvres de Van Gogh et Picasso. Je pense qu'il ya quelque chose pour tout le monde.<br>Le musée est assez grand et il faut au moins 2 hrs pour en faire le tour.<br><br>C'est un musée qui n'a rien à envier au musée des beaux arts de Montréal mais moins bon wue celui de New York.", "pics": null}}, {"review": {"des": "Talk to the Curators<br><br>Good art museum. Nice Impressionst collection. Don't miss the Chagall Windows, the Thorne miniature room collection, and the original trading floor of the Old Chicago Stock Exchange. <br><br>Ask the curators or security guards about the modern art and you will hear some very interesting stories. Try to avoid bringing in a large bag as you will have a long line to check it in and out.", "pics": null}}, {"review": {"des": "I came for a project and it was a great experience. I went to check my bag (mini pack pack) in and was told that it would be $3 even though the sign says $1 per item. Other than that, it was a great experience.", "pics": null}}, {"review": {"des": "I was so excited to come here, but left disappointed. First of all, we had to check in all our items and with a cost as well. Most of the museums I've been to let us just turn our backpacks to the front of our bodies and if we did have to check anything in, it was free. I understand that they want to preserve all their art, but at least be friendly about it. Everyone was so rude.<br><br>My favorite arts were in the renaissance room. I remember learning about all those pieces in my art history class; so to be able to see them in person was beautiful and breath-taking. I was able to see a lot of famous pieces and I also saw some strange art as well, but hey.. who am I to judge what art is. <br><br>Overall, it was okay, but not as great as I thought it would be.", "pics": null}}, {"review": {"des": "What can I say.... amazing! We spent 4 1/2 hours (about 20 min of that to eat) and we didn't see everything. I highly recommended to everyone! I will be back. You can take pics of everything (just no flash). The people that work there are very helpful! I see them helping numerous people and seemed happy to do so. We upgraded to the fast pass and for me it was worth the extra $. I knew it's be busy on a Saturday afternoon and there as a line but we were able to walk right thru. No waiting. It can get confusing as to what is where and where you are in the building but it's still all so wonderful. I will definitely go back again.", "pics": null}}, {"review": {"des": "This or the Met? This or the Lourve? These are the big questions that I asked myself before visiting. I don't know why I thought it was a contest. But if it were a contest, the Art Institute of Chicago would be a contender!<br><br>There are so many beautiful pieces, I'm so happy that I went. We arrived early and waited in a short line. Around the time the doors opened, the line grew exponentially. We didn't buy the pre-tickets, they cost a tiny bit more, so we went without. We usually fast pass everything, but because we arrived early, it was not needed.<br><br>We ate right before we arrived. We were able to stay for hours and enjoyed it immensely.", "pics": null}}, {"review": {"des": "Wow! Ready to spend a day at the museum and explore the world? Want to travel to Greece, Japan and Paris in one day? This is the place. Beautifully curated exhibits that combine both art and history. <br><br>Make sure to allot a sufficient amount of time to tour this place because it can take a while to fully see all the exhibits. It took me about three hours. <br><br>Remember to bring your student ID for a discount and note that big items such as backpacks will need to be checked in.", "pics": null}}, {"review": {"des": "Wow I have not been at the Art Institute of Chicago for at list 20 years.  I had such an amazing time looking at such great exhibits specially all the nice gold bracelets and gold coins.  How can you not like all the beautiful statues and the nice paintings. <br>There is something beautiful to appeal all of us.  I was also admiring the quilts and the gorgeous furnitures.  I was contemplating the gorgeous cut<br>Mosaics and relics.  <br>Thank you for having a free admission for Illinois residents.", "pics": null}}, {"review": {"des": "The Art Institute of Chicago easily resides in my list of Top 5 Art Museums in the U.S.<br><br>With over one million square feet across multiple buildings (connected on the first floor), the Art Institute displays an impressive collection of art, history, and culture including:<br><br> * Medieval or Modern<br> * European or Indian<br> * African or Roman<br> * Asian or American<br> * Impressionist or Neoclassical<br> * Christian or Islamic<br> * Photography or Film<br> * New media or Ancient<br> * Sculptures or Paintings<br><br>Tips for visiting:<br> * Open 362 days a year 10:30 - 5:00<br> * Open late Thursdays until 8:00<br> * Closed Thanksgiving, Christmas, & New Year's<br> * Adults $25; Seniors/Students $19<br> * Children 13 and under free<br> * Everyone free Thursdays after 5:00<br> * Discounts for Chicago & IL residents<br> * Go Chicago and CityPASS accepted<br> * Photography without flash is allowed<br> * No backpacks or large bags<br> * No food or drink in the galleries<br> * No on site parking except valet<br> * Nearby are several parking lots<br> * El Train, Metra, or bus are good options<br> * Museum dining are a couple small cafes<br> * The Artist's Studio is hands-on for kids<br> * Download the free Tours app with 50 tours<br> * There also 80 PDF mini-tours available online<br> * Audio Guides are $7/person<br> * Were comfortable shoes<br> * Check your coat or bags ($1 each)<br><br>Here are some of my favorite art pieces ... so far:<br> * The Drinkers (1890) by Vincent van Gogh<br> * Paris Street, Rainy Day (1877) by Gustave Caillebotte<br> * A Sunday on La Grande Jatte (1884) by Georges Seurat<br> * The Mexican Major (1889) by Frederic Remington<br>  * Stamford after Brunch (2000) by John Currin<br> * Ohhh ... Alright ... (1964) by Roy Lichtenstein<br> * Little Dancer Aged Fourteen (1879-1881) by Edgar Degas<br> * Ballet Dancers (1885-1886) by Henri de Toulouse-Lautrec<br> * Water Lily Pond (1917-1919) by Claude Monet<br> * Woman and Child at the Well (1882) by Camille Pissarro<br> * Mater Dolorosa (Sorrowing Virgin) (1480-1500) by the Workshop of Dieric Bouts<br> * Lotus Lilies (1888) by Charles Courtney Curran<br> * The Song of the Lark (1884) by Jules-Adolphe Breton<br> * Madame de Pastoret and Her Son (1791-1792) by Jacques-Louis David <br> * Old Man with a Gold Chain (1631) by Rembrandt Harmensz van Rijn <br><br>Whatever your art passion or interest, the Art Institute of Chicago has something for everyone ... even you.", "pics": null}}, {"review": {"des": "This is my absolute most favorite art museum! I thought I fell in love with the MoMa in NY but that's until I came to Chicago I realized this is my favorite museum! <br><br>We were given a map of the museum along with a voice recorders that would give you descriptions of the paintings. We loved all of the exhibitions!  We literally walked around for hours just looking at them, reading the descriptions, and taking pictures. We even had a coffee break in between. <br><br>The museum is big enough where you don't feel crowded walking around which is a plus. The restrooms are huge and super clean. All of the employees were nice throughout our whole visit. Of course the Andy Warhol, Picasso and Dahli were some of my favorites. <br><br>Definitely buy the City Pass next time you're in Chicago. This was one of the 5 things included in the packet for about $100.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pq4Og8aifQyhGh8Bk7XXTg/168s.jpg", "caption": "Mona Lisa"}]}}, {"review": {"des": "One of the best museums in Chicago, maybe even in the entire country! I spent 3 hours in there and didn't even see everything. Their impressive collection is very vast and massive. The information people there are very helpful and knowledgeable. One thing to note is that they rotate their pieces out, sometimes for months at a time. They said it was to loan the artwork out, or sometimes it was to preserve the pieces. It is a bummer when you come from out of town and can't see some of your favorite pieces. Other than that I have nothing to complain about. This is one of my favorite things to do in Chicago.", "pics": null}}, {"review": {"des": "Beautiful.  Amazing selection. <br>This is a must stop if you are an art fun.  Even if you're not.  There is a great selection.  Something for everyone.", "pics": null}}, {"review": {"des": "Large art museum in the heart of downtown Chicago next to Millennium Park.<br><br>$25 admission for non Chicago residents. <br><br>Not a bad way to get your art on for a few hours before the main event at the friendly confines of Wrigley Field.", "pics": null}}, {"review": {"des": "I was lucky enough to attend two live musical performances at Fullerton hall, one outside during the summer and the other was inside of Fullerton Hall. Joan Of Arc performed a live score to old film Joan Of Arc and then I saw Beauty Pill. Such incredible experiences inside and out of a BEAUTIFUL venue. My friend and I could not appreciate the glass ceiling enough. The seating inside is pretty cramped but there is a lot of it so that is a plus. <br>Sound was great.<br>Staff was very friendly.<br><br>I hope they have more live events next summer!", "pics": null}}, {"review": {"des": "I wouldn't consider myself a \"cultured\" person. I don't really care if people I know or don't know believe I have a deep understanding or appreciation of art. <br><br>But, after walking out of the museum I feel like I got to see some cool sh*t. <br><br>And, let's be real. If the pieces of art weren't worth $50 million dollars a piece you'd feel less cultural gravity towards them, so there's some materialism masquerading as people feeling cultured, but hey. Cool sh*t, right?", "pics": null}}, {"review": {"des": "What can I add to many perceptive reviews?  Well, we visited Monday morning at opening time and had a minimal wait at the Modern Wing entrance.  We never felt crowded or rushed on any way.  2.5 hours was just enough time to see everything but a true art lover could spend much longer.<br><br>The chance to see Monet, Picasso and other immortals should not be missed.  As an electric utility retiree I was pleasantly surprised to see The Lineman, a 1927 painting that pays homage to its subject.", "pics": null}}, {"review": {"des": "If you visit the Willis tower you can purchase a combined deal for Willis and the Art institute of Chicago. It's worth it!  They are only a short uber ride away from each other and easily doable in one day. There are many exhibits for all kinds to see. Starting from older more traditional art to more of a modern expressive art. Either way you get caught up in the time and effort put into each piece and admire the creativeness each exhibit offers. <br><br>I can see why this is a popular spot to visit in Chicago. Also it's right next to the bean so go ahead and snap a pic of a reflection of yourself while in the area.", "pics": null}}, {"review": {"des": "Simply beautiful! Such a vast amount of art and very diverse as well. The exhibitions are very organized and the space is wonderful. I definitely recommend getting an audio tour added to your ticket to get the full experience. You get to listen to the curator speak about certain pieces of the art and there are wooden benches to sit on while you listen.<br><br>Only little negative comment that I want to make is that in the section where Asian art was displayed, I believe the Korean category was a little lacking. I am Korean so it could definitely be a bias statement but the amount of art depicting Korean history was definitely a lot smaller than the rest.", "pics": null}}, {"review": {"des": "One of the best art museums anywhere in the world and it's right here in Chicago.<br><br>The most important things here are the pieces that you know and love from \"Ferris Bueller's Day Off\". The other pieces are not that bad either.<br><br>And if you are a member here you get to go to the following art museums for free:<br><br>Cincinnati Art Museum <br>Cleveland Museum of Art <br>Dallas Museum of Art <br>High Museum of Art (Atlanta) <br>Los Angeles County Museum of Art <br>The Minneapolis Institute of Arts <br>Museum of Fine Arts, Boston <br>Museum of Fine Arts, Houston <br>The Nelson-Atkins Museum of Art (Kansas City, Missouri) <br>Philadelphia Museum of Art <br>Saint Louis Art Museum <br>The Toledo Museum of Art <br>Vancouver Art Gallery <br>Walker Art Center (Minneapolis) <br>Whitney Museum of American Art", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SUzAi2dza5pE_3V6uswHVg/348s.jpg", "caption": "Soviet Propaganda"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3z_C9D7NUC5r1lvNxr5c0w/168s.jpg", "caption": "Soviet Propaganda"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VTgp0h09x5hly9LcZ3nplg/168s.jpg", "caption": "Diego Rivera"}]}}, {"review": {"des": "Evoking a wondrous garden maze with surprises around every corner, the Art Institute of Chicago is quite simply one of the best museums you'll ever visit -- anywhere in the world. Take the time to savor its treasures, and you'll leave with memories for a lifetime. From classical Greek and Roman statuary to iconic American paintings, there's something here for every taste - a virtual cornucopia of world art that both overwhelms and stimulates a hunger for more.<br><br>I spent more than two glorious hours wandering the Institute during a recent business trip to Chicago, and could easily have stayed an hour more. There are far too many highlights to mention, but if time is pressing, head straight for the second floor Impressionist wing, where you'll be greeted by works by Monet, Degas, and other masters. Seurat's  massive 'Sunday on Le Grande Jatte' is the centerpiece here, but every gallery is packed with treasures that would make an art student blush. From Van Gogh's 'Self Portrait' to Renoir's 'Sisters on a Terrace', the Institute whisks you on an unparalleled sojourn through European painting and sculpture. Few other American museums can boast an Impressionist collection this good - it rivals both New York's Met and the Smithsonian's National Gallery for scope and scale.<br><br>Your next priority should be the American Masterworks wing, where you'll find Edward Hopper's classic 'Nighthawks' painting and the iconic 'American Gothic', along with a trove of masterworks from John Singer Sargent, James McNeill Whistler, Mary Cassatt and Georgia O'Keeffe. <br><br>The museum also has a fascinating gallery of medieval and Renaissance art, including armor and weaponry from the 15th and 16th centuries. The Asian galleries are breathtaking, as are the immense collections of African and Islamic art. And don't leave without taking in the spectacular Modern Art wing on the third floor, which boasts works by Picasso, Matisse and Allbright. <br><br>The Art Institute of Chicago is one of America's greatest treasures, and a must for anyone spending time in the Windy City. You'll leave enriched beyond measure, with a new appreciation for America's artistic cultural heritage and place in the pantheon of world art.", "pics": null}}, {"review": {"des": "Probably can't add more to the already glowing reviews of this place. I got here on Saturday morning about a half an hour before it opened. We started queuing up about 5 min ahead of time. <br><br>If you have a pass or bought ticket ahead of time you don't really need to get there that early, but if you buying tickets at the museum get there early. It got really crowded<br><br>There is so much to see here. I gave myself a 3 hour time limit  and I didn't even get to see everything. The impressionist gallery was incredible. Coming here was one of the highlights of my trip.", "pics": null}}, {"review": {"des": "Took the family here over the weekend. Wow! An incredible experience. Great tour of some of the blockbusters I remembered as a kid. <br><br>Family loved it. Food at the restaurant was just OK.", "pics": null}}, {"review": {"des": "What more can be said about the Art Institute?  It is a fantastic museum and I must-see place for everyone visiting Chicago.  To start, it is in a fantastic location and even the outside is stunning.<br><br>The only downside is that it is often crowded--and then in the winter, the lines to check coats can be long.  It is best to visit during a weekday and in the morning if at all possible.<br><br>There is so much art to see here that it is hard to recommend any one area.  One great feature of museum is that the visiting exhibits are often very worth observing--and they have saved a large area for them.<br><br>The gift shop is also very good.  Overall, just a perfect museum.", "pics": null}}, {"review": {"des": "This place is MASSIVE!! From the outside, I had no idea how big it was!! You could probably spend a week on here and still miss some of the art. Note: they loan art out to other museums, and they change the art up. We had a couple pieces we wanted to see but one was in NYC and the other is temporarily off exhibit so other pieces can be displayed. Whatever your art pleasure is... sculpture, paintings, fine china.. it's all there!", "pics": null}}, {"review": {"des": "This museum is pretty big with a lot of different themes. You can spend a whole day here looking at everything or if you have certain preferences, you can spend a couple of hours as well. <br><br>My favorite part was the room with mini versions of different rooms in Europe and America. The detail of each room is so impressive. <br><br>The only critique I have is that the stairs are confusing. Only certain stairs will get you to certain places, otherwise, you have to go to the first floor to connect.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zJGK46Kps3sSx5BZzPOqsA/168s.jpg", "caption": "One of the mini rooms"}]}}, {"review": {"des": "This is in my list of Top 5 US museums. It is the second largest museum in the US, behind the Metropolitan Museum in NY, which is quite telling. I will say that there is a story behind the way the art is grouped together, where the rooms seem to flow into one another for each time period and artistic theme. <br><br>My favorites were the Japanese wood block prints in the Lower Level and the Impressionist Claude Monet Room on the second level. I'd recommend starting at the Second Floor and making your way down for new visitors. So surreal to stumble upon art that you see everywhere (Sunday at the Park for example), and have a moment of realization that this is the original artwork. So beautiful, and so neatly organized. The staff are super helpful too. And watch out for free days for Illinois residents, like Free Resident Day and Chicago Museum Week.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/3LL_c1qKvccVziFD7EnW4g/348s.jpg", "caption": "Claude Monet."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NweSznN5KLpodaI1JUrgmw/168s.jpg", "caption": "Claude Monet."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UKyf6qbvP79b_XYPurO-rA/168s.jpg", "caption": "Sunday at the Park."}]}}, {"review": {"des": "We were worried about coming here during Museum Week, as we thought it would be packed since it's free to Illinois residents. But since the Women's March was starting just down the block and security wouldn't let anyone in with posters, it was very empty that Saturday morning. The spaces are great, and if you love modern art then you'll really like this place. I greatly enjoyed the furniture from different eras and regions, but they weren't all gathered in one place so sometimes they'd just pop up while you're randomly walking through the Impressionist section or the American Modern Art section.<br><br>I wasn't very impressed with the Chinese/Korean/Asian section, but perhaps I've been spoiled by the Asian Art Museum in San Francisco. You can't really compare an entire museum on Asian art and artifacts with just a section in a regular art museum, so I guess AIC did the best with what they had. It was alright.<br><br>The part the surprised me the most were the exhibits downstairs. There was an entire room dedicated to paperweights. I didn't know that was a thing, but apparently even Truman Capote was a collector. There's another room that's titled Miniatures but it's more like dioramas. They're AMAZING. I was incredibly impressed by the dedication the artists put into every little detail. That was perhaps the highlight for me, because I don't know any other museum in the world that has this. And if there are others, please PM me cause I'd love to check those out.<br><br>One serious issue I had is that it's not easy if you're handicapped or physically weak to visit this museum. I had badly sprained my knee before my trip and needed to take frequent breaks at the galleries, but there weren't enough benches available. When we wanted to check out another exhibit and it wasn't connected to the main building, it required going down, walking through entire sections of another building, walking through other exhibits, before finally getting there. The elevators are around, but really they should have some ramps instead of all these stairs. And they need a lot more benches. The dioramas had none and if you sit on the steps, security comes and tells you to stand up or sit outside.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZfBNdaQebFnWxogO2xoiyg/168s.jpg", "caption": "A bank teller's window"}]}}, {"review": {"des": "Very good museum with an interesting array of exhibits covering nearly all periods and world geographies. I was particularly impressed with the Impressionist exhibits as I was not expecting to see so many Monet's, Manet's and Renoir's which rivaled the Met and the Louvre.<br><br>There was also a good amount of American arts in various medias with the paintings and sculptures being the most impressive. Plenty of Remington's and Hudson River School works to keep you happy.<br><br>The Ancient World was also well-represented with Roman, Greek, Etruscan and Egyptian art and artifacts to view. <br><br>Museum is large enough to offer something for everyone and small enough that you can see most of it in one day. Decent on site café as well.", "pics": null}}, {"review": {"des": "Too far, and too much walking. I've got a better collection in my condo.  And don't have to drop a lung walking up 2 flights of stairs to see a red dot in a square called modern art.  What I did like was the coffee in the outdoor cafe.  Ask for extra cream. <br>-Helen", "pics": null}}, {"review": {"des": "I started out when it opened at 10:30am and stayed until 5pm! There was so much to see. I started downstairs with the glass paperweights and the miniatures. I loved the meticulous detail of the miniatures. It doesn't take too long to look at the paperweights and read how they are made. I then made my way to the modern art wing. Don't forget to see Chagall's America Windows. It was beautiful. Being half Greek and married to an Italian, I had to see the the Greek, Roman, & Byzantine Art. On the 2nd level I visited the European art, Impressionism, & Contemporary Art. I took a quick break for lunch around 2:00 and to rest a bit. It was a wonderful day. And while I tried to see everything, it was difficult. I got more than my money's worth. I recommend using the audio to enrich your experience.", "pics": null}}, {"review": {"des": "They have lots of great pieces here, but it's very confusing to navigate. Most of the buildings don't connect to each other, so we had to ask for help at least three or four times to find a specific piece we wanted to find.<br><br>To be honest, I'm not a big museum person, but we bought a Citypass and my friend wanted to check out the art institute. I have been before but probably not since 2009 or 2010. With the city pass you also get an audio guide gadget which was fun, you walk up to a piece that has a number on it and can type in that number on the gadget and listen to some commentary about it. I liked this much more than just walking up to the piece and reading about it. We only had about an hour or two between engagements, and we probably could've spent more time here. If you are not an Illinois resident, it will cost you about $25 to get in here ... The best time to go if you are a resident is on Thursdays because I believe it's free for residents that day. <br><br>Overall I liked this place but they could've been more clear with directions.", "pics": null}}, {"review": {"des": "Pros: Beautiful collection of amazing masterpieces. It is a MUST while in Chicago. Check the schedule, it closes at 5pm most days, I went on Thursday when it closed at 8pm. I was there from noon until they kicked me out and I didn't see all the exhibits, so make plans to be there all day or go at least two days if they close early. I highly recommend paying the extra $7 for the self guided tour, it enhances the experience and allows you to further immerse yourself in the art. <br><br>Cons: Got lost getting to their restaurant Terzo Piano, took me about 30 minutes walking up and down the stairs, but it was worth the effort, so get very detailed instructions if you are close to missing the lunch (it's only until 3pm). This is super nit picky, but I wish all the art had an audio option, since it enjoyed it so much!!<br><br>Cannot wait to go back!!!", "pics": null}}, {"review": {"des": "Easily one of the best art museums I've been to in my lifetime. If you're an art history buff or have even taken some art history classes in the past, you will definitely appreciate this one. The highlight of the museum for me was for sure their stacked Impressionism collection featuring plenty of pieces from van Gogh, Renoir, Monet, Cezanne, Seurat, and many other well known artists of the era. The modern wing was pretty cool to see and had some pieces from Picasso and Warhol as well. I've taken my family here when they visited Chicago and they were just as impressed with the extensive collection. <br><br>Expect to spend several hours here when visiting as there are plenty of galleries to walk through and enjoy.  If you have a college student ID, be sure to present that to take advantage of the student price and also note prices are cheaper for both Illinois and Chicago residents. And you're under 18... it's free. Great spot to bring the kids and teens and make a learning experience of it. <br><br>'Til next time, cheers!<br><br>271/365", "pics": null}}, {"review": {"des": "I really enjoyed my visit to the Art Institute of Chicago even though I only got to see the Impressionist part of the museum. I was here with a conference group that held a social afterhours, thus we were only granted access to part of the space. However, Impressionists are my favorite and the Art Institute has quite the collection on display. During my visit, I got to see a few Renoir's that I had not seen before featuring flowers and portraits. There were plenty of Monet's work, as well. Not his typical water lilies but rather landscapes. I was also surprised to see van Gogh's \"The Bedroom.\" I have never seen it in person, and having studied it art classes it was the highlight of my visit. Additionally, there was one of van Gogh's self-portraits that while still using van Gogh's style of thick brush strokes, also exhibited a bit of pointillism. The reception was downstairs from the gallery and outside in the courtyard. The Art Institute's staff was wonderful and made sure that when food ran out it was quickly replaced. There was a lot of options to eat and drink, making the event held here perfect for socializing.", "pics": null}}, {"review": {"des": "The art museum here is really a must do on your list of things to see in Chicago. It's easily accessible on Michigan Avenue and can be found by bus, train or uber.  I came here because I had purchased a city pass and really really wanted to go very badly.<br><br>Walking in the museum is an experience, as there's lions on either side and a beautiful staircase leading in.  I checked in at the ticket counter and checked my coat for $1.  Also, you can upgrade and get a thing that tells you all about the art you are looking at.  I got a free upgrade but passed since I wasn't really interested.<br><br>There are a ton of wonderful exhibits, and a lot to see. I loved the stained glass (I think it's Chigals stained glass exhibit), the china exhibit and the American Art section.  They also have two gift shops available, where you can purchase a lot of good stuff. The gift shops can be pricey, but I found a few things here that I liked, all for under $10.<br><br>One of the cooler displays was the miniature room displays on the lower level.  It was absolutely stunning and cool.  So many different rooms and they all were super cool to look at. Definitely a must see.  Also, they have a lot of other displays that you can check out while there, and the staff is reasonably helpful.<br><br>Also, I strongly recommend ubering in or taking a bus, because parking is $28!  Yikes! You can eat in the museum, but I reccomend going to one of the restaurants on Michigan Avenue instead. It's one thing to grab a cup of coffee, but save your $$ and eat elsewhere!", "pics": null}}, {"review": {"des": "Chicago has some of the greatest museums in the world, and the Art Institute is no exception. When I lived in the city, I was a member here and used to visit all the time. Still, I'm not sure if I ever really managed to see everything as it would likely take weeks to really absorb everything this museum has to offer.<br><br>The museum has an enormous range of periods and styles in its massive collection. If you only have one day, it can be overwhelming to try to fit in everything you want to see, so plan accordingly. I definitely recommend checking out the floor plan online before you visit so you can make the most of your day. Time will fly by during your visit and the museum will be closing before you know it!", "pics": null}}, {"review": {"des": "Excellent art museum located smack dab in the middle of the city.  This is definitely one of those museums where it might not be possible to conquer it all in one visit.  There's so much impressive art work all over the place, you really can't do it justice in one visit.  <br><br>Admission is $25, but worth every penny.  Some highlights for me were the Asian art, they had an interesting modern Indian artist that had bright and thoughtful pieces sprinkled throughout the exhibit.  The collection of impressionist/post-impressionist art is massive - so if you like Monet, Matisse, Pissaro, Van Gogh, Gaugin, then this is the spot for you.  Picasso is quite present as well.  There's also some space dedicated to Andy Warhol, which was another highlight.  <br><br>It also had just the right amount of contemporary art.  Sometimes when visiting other museums that are heavy on contemporary art, I leave oftentimes thinking \"I could have done that\".  While there are some pieces like that, it's definitely a small amount and always worth a quick look, right?  <br><br>An imperative for any visit to Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Jl0t5MrhhxljwD9GIFEPrQ/168s.jpg", "caption": "Art with a view.  I see you Chicago...."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zcOSwGPT4GZbtr1SwqTXwQ/168s.jpg", "caption": "Hey Liz....."}]}}, {"review": {"des": "I had high expectations for Art Institute of Chicago, and my expectations were exceeded!<br><br>First of all, the Institute is MASSIVE. I'm not exaggerating when I say it'll take you at least a full day to check everything out at a leisurely pace. Definitely have to take water breaks and snack breaks.<br><br>Speaking of water breaks, I was guzzling some water in one of the galleries (art makes me thirsty!), which is against museum rules, but security was very professional and gentle in letting me know. SFMOMA, hope you're taking notes!<br><br>Anyway, there's guaranteed to be something for every taste and interest in this museum. My personal favorites were the Thorne Miniature Rooms, the armor collection, and the quilts. They had an extensive collection of classical art as well.<br><br>Admission isn't cheap but well worth it. I believe they have some partnerships with some companies for discounted or free admission, so it doesn't hurt to bring your company badge and ask.<br><br>Definitely a must-visit when in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/21hARbMxPgOqeSh8wVBADw/168s.jpg", "caption": "Quilt"}]}}, {"review": {"des": "A must see and do if you are in the area. So many paintings, so little time. The impressionist gallery I could spend a week in. There a plenty of other genres for those not enamored with those artists. <br><br>Allow at least half a day to the entire museum. More if you're an art nut. Parking is right across the street at millennium park.<br><br>Go and then go again. One can never experience too much art.", "pics": null}}, {"review": {"des": "The Art Institute of Chicago has something for everyone.  This wonderful Art Museum is well-known around the world.  The building itself is an architectural wonder. Take your time and you the wonderful Building inside and out. <br><br>Every style of painting is represented here from Modern,  classical,  renaissance,  to abstract and more. <br><br>Its not just paintings either.  They have exhibits with sculptures, antique furnishings, pottery and much more. <br><br>Famous works of art such as American Gothic, A Sunday afternoon on the island of La Grande Jatte, The Bedroom,  Nighthawks, The Guitar are all displayed here for your enjoyment. <br> <br>Degas, Matisse, Monet, Picasso, Renoir, Rodin, Seurat, Toulouse-Lautrec, and Van Gogh are some of the artists whose works are on display as well as many others. <br><br>We went here in January to see the excellent Vincent van Gogh exhibit that featured many of his works from around the world. There are always special exhibits on display here.<br><br>Enjoy a quiet place, step back in time and feast your eyes on some of the most beautiful artwork on the planet.<br><br>Oh,  and the #realrenoir is here,  just like it's  been for many,  many years.", "pics": null}}, {"review": {"des": "As Chicagoans, we are lucky to have this enormous museum of different styles of art available in a convenient spot with a very reasonable admission price (and free on Thursday evenings!). With rotating exhibits that cover everything from ancient Chinese artifacts to architecture to armor to quilts and more -- the art available to enjoy changes frequently. <br><br>This is the 2nd largest art museum in the US with approximately a million sq feet of space. It is very photography friendly although there are a few minor restrictions on certain exhibits. With the size and variety of the museum, it's great for bringing groups for educational and work related outings, but also great to enjoy by yourself. On a rainy day, there is really no better place to enrich your art experiences but this is also a great place to visit on a sunny day as well.<br><br>Overall, one of the best attractions to visit in Chicago. This should be on everyone's list of sites to visit.", "pics": null}}]}