{"name": "au-cheval-chicago", "reviews": [{"review": {"des": "I thought I had reviewed after I visited Au Cheval but it's likely that I was too full to move, let alone type the glowing review that this place deserves. <br><br>America and beyond, you've heard everyone important (and even the unimportant) tell you that this is the best burger ever. News flash, no one lied to you. It really is amazing. It's juicy but not greasy. The bread is perfect. There's no obnoxious sauce. It's just a basic bitch. BUT Miss Jackson if you nasty, you must get it with pork belly and egg to get the entire effect. If you heed my advise, you're going to need a wheelchair to roll you out of there especially after you have the 2nd star of Au Cheval's line up...<br><br>THE MOTHER FORKING BONE MARROW. HOLY SHIRT. <br>It's fatty. It's greasy. But the flavor is like a stick of meat butter. Then, they give you this ridiculous beef cheek marmalade with it that is sweet and supple and ooey and gooey and it's just...heaven. And entirely worth the food coma that all of this rich food is going to put you in. <br><br>Luckily at the time of my visit, Nosh and Booze was open next door and they provided Fernet to keep us from dying. Reason 736292 that I love Chicago. <br><br>To sum up, yes, you're going to have to wait in line to get in. Suck it up. Give them your name and go fork around for an hour or whatever. It's Chicago, there are drinks everywhere. This is a place not to be missed in your culinary lifetime and even if you have a food baby after you leave, the satisfaction from your meal will keep you warm forever.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qeWZNiofMACweax0oDlQyw/348s.jpg", "caption": "The best burger you will ever eat in your entire life. Not pictured but worth mentioning, the bone marrow appetizer that you MUST eat."}]}}, {"review": {"des": "This is the best burger I've ever had. <br><br>The wait: I arrived at a reasonable hour on a Tuesday (party of one), put my name on the list and was told it was going to be 45 minutes. I'd heard it was worth it, so I waited and stalked the bar. I lucked out as five short minutes later a single chair opened up and I scooted in. None of my Chicago based colleagues believed me that it only took five minutes for me to get a seat but, luck was on my side. Also, snowy roads. It was relatively empty. <br><br>Drink: I ordered a cocktail - a good not great French 75. I expected it to be slightly better than it was since they have Bees Knees on the menu but whatever, it was fine and didn't distract from the main event.<br><br>The Burger: I ordered the cheeseburger with bacon and and egg, because obviously that is what you should do the first time you go to Au Cheval. As you can see in the multitude of photos taken from different angles, the drippy egg/ bacon combo is a joy of flavors. The bacon is probably tied with the best bacon I've ever had in my life at a small breakfast joint in Providence, RI. It's thick cut cured pork belly with the perfect balance of fat and meat. Heaven. I didn't mind the mess and scooped up the yolk with the bun and a few fries. Cutting it in half helped manage the pile.", "pics": null}}, {"review": {"des": "I mean, this is how I have imagined a burger should taste. <br><br>Au Cheval is a staple in Chicago and for a very good reason. My parents were out of town, so of course we had to take a visit. Living here, I knew the wait would be on the longer side (Friday during late lunch), but their wait was exactly on time and what we anticipated. <br><br>On top of the burger we also had the bone marrow, which could compete with the burger for the best item on the menu. <br><br>We left leaving happy and full, my parents now having a holistic Chicago experience.", "pics": null}}, {"review": {"des": "5 Star. 5 Star. 5 Star. <br><br>The best burger I have EVER had! Every time I'm in Chicago I always try a new burger place. <br><br>I got the single cheeseburger (2 patties is on it) with the bacon (pork belly? Yes please) and an egg! TO DIE FOR. <br><br>I got the fries with the garlic aioli dip. Amazing as well. I hear the hash browns are super good as well. I will be back so I'll get those next time! <br><br>For dessert I had the gelato with all 3 flavors! Ahhh-mazing. <br><br>I'm moving to Chicago and this place makes me consider moving a little earlier;)<br>If you are in the area do not hesitate to come here. Make room and grab a burger! <br><br>Btw: service is awesome!", "pics": null}}, {"review": {"des": "A true life-changing experience. French-themed, upscale diner whose main attraction is a burger. If you're looking to go to Au Cheval, I would recommend going during off hours (before/after lunch/dinner). I've been fortunate both times I've been here to wait only 30-45 minutes. I always ask what the wait is on my way out the door and have been told as long as 2-3 hours (insane). <br><br>This place is really terrible for big groups. Most of the seating arrangements are for 1-4 people. They do have 2 larger booths that may accommodate up to 6 but I image they are hard to come by. <br><br>I ordered the single burger with bacon (pork belly) and an egg. The single burger is actually 2 patties and the bacon (2-3 slices) is as thick as the patty! I usually am anti-egg on my burgers but had to go all out for my first experience. I am glad I did!! The egg was a perfect compliment to the burger and was so subtle. If I could choose one word to describe the patties, it would be succulent. So incredibly juicy and tender. And don't even get me started on their 5 star buns....<br><br>Their burgers are the epitome of the ultimate clash of flavors that just work. Between the buns, patties, bacon, egg, and cheese. I would recommend this burger to burger lovers and non-lovers.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VyJLhuoIG1g9XjMFbM0G3g/348s.jpg", "caption": "Look at that pork belly!!!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6lRy8fY2VLhjXbIBXhikow/168s.jpg", "caption": "Good lord."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/akUmDW2qHmesnNW7HcofCg/168s.jpg", "caption": "B&B pickles  their fries with that miracle sauce"}]}}, {"review": {"des": "What an experience!  We waited 2.5 hours to try Au Cheval!  We checked in, they texted us and we were able to text and get a text back anytime to check our spot in line.<br><br>We went over to the Mexican restaurant next door to wait and walked around until it was our turn.<br><br>We got to sit at the bar right next to where the Chef was expediting.  It was such a cool experience to see them in the zone feeding everyone and making every single order custom!<br><br>We started with the fries which had a fried egg and were delish!  We then had burgers where I got the single and my boyfriend got the double.  We got the egg on it which i OBV recommend!  They were SUPER heavy but it was great!  <br><br>We are very lucky and excited that we were able to try Au Cheval!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lSJQS8uq3S1XFW4-BXiBEw/168s.jpg", "caption": "Fries  dat sauce doooeee"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/HXLaL21hfVeMrFj0qKggOw/168s.jpg", "caption": "Single Burger with Fried Egg.  Greasy but amazing!"}]}}, {"review": {"des": "If you are at all familiar with Au Cheval you likely already know you will wait to get in. Expect at least 3 hours or somewhere near that timeframe. Have no fear though-you can leave once you check in and they will text you when your table is ready. And there are plenty of fun bars nearby! <br><br>Once you are finally seated be prepared to indulge and enjoy and make sure you are HUNGRY. I mean, i am sure after the lengthy wait you will be, but had to say it anyways. If you order a single burger it will have two patties on it anyways, perfectly melted cheese, a delicious bun, some sauce, pickles and you can add an egg and bacon(which is nearly as thick as one burger patty). And I recommend trying both. <br><br>And even though you will be plenty full with the portion of the burger try the fries too. They come with a delicious garlic aioli!! <br><br>The ambiance in Au Cheval is great and they are efficient and accurate with your orders. I have been there a few times and can't wait to get back, even if I did have to eat dinner at 11 pm!", "pics": null}}, {"review": {"des": "Anytime a restaurant or dish achieves the distinction of being the best in the city, country or world several things will usually happen. ..<br><br>One, crowds and wait times will grow exponentially. <br><br>Two, service will suffer until the business adapts to new found fame. <br><br>Three, sheep will rave and blindly profess their love and adoration (while affirming it's the best in the entire city despite never traveling South of Roosevelt). It may be the best, but how would you know? Lol<br><br>Four, Foodies with well versed palates will mostly agree with the awesomeness bestowed, but some will reasonably disagree. <br><br>Five, haters who know very little about the nuisances of delicious food and the science behind it will overdo it with unreasonable critiques.<br><br>Six, every new competitor will be touted as the \"fill-in-the blank Killer\".<br><br>Au Cheval has experienced each of these. Being ranked a top burger has been controversial to some, but that's one of the great things about food. We're all entitled to like or dislike whatever we choose. But. ..with that being said anyone who says this isn't a great burger is just plain wrong ;-)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QSBrc6PGTOUW3YtLhSXm_w/348s.jpg", "caption": "Hemingway Daiquiri(Ernest Hemingway, 1920) - el dorado 3 yr. rum, maraschino, grapefruit, lime"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/j2WWZUKs3EbQ9kGK268YgA/168s.jpg", "caption": "House Root Beer Float"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/G3byuOgcJjtdUI2SPtEdAQ/168s.jpg", "caption": "The Saint John Burger - two 4oz patties, house-made bun, watercrest, pickled walnut dressing, pickled red onion, dijonnaise, welch rarebit"}]}}, {"review": {"des": "Sigh.....I hate that my review is only 3 stars.  <br><br>Au Cheval was on the map for my gf and I when we had a weekend getaway to Chicago.  Several friends recommended it, many told us to get there as early as we could, and all of the recommendations and advice were backed up by several yelp reviews and articles saying how amazing this burger place was.<br><br>We showed up around 10:45 am on a Saturday, and sure enough, a line was getting close to being out the door.  Staff told us it would be 30 minutes or so, but fortunately it was only about 15 minutes worth of waiting.  <br><br>Let me also say that staff were great, both with explaining dishes, giving recommendations for tourists and getting us seated very quickly.  Kudos guys!<br><br>So we ordered the following:<br><br>Crispy potato hash with duck heart gravy ($10.95)<br>Cheeseburger au cheval ($12.95) + 2 extra patties ($4)<br><br>Both dishes came out at the same time, and we split both of these.  Starting with the crispy potato hash, it comes as listed, very crispy potato hash, chopped pieces of duck meat with organ meat from the duck as well.  A Sunny side up egg completed the package, which made the dish all the more moist once the yolk was broken.<br><br>The potato hash was super rich with its gravy, and while it was flavorful, I personally couldn't eat more than a few bites because with each bite, my mouth was coated with butter/oil.  It's hard to make certain greasy spoon dishes seem healthy, but at least for the hash, it just was so saturated with grease.  I think it's a much better dish if shared between several people, but for me, I just thought it was too rich, although the flavors were nice.<br><br>The cheeseburger was pretty big!  The meat was also moist and juicy leaving not a single bite that was dry.  Great cook on this burger!  The big problem, which made me take off stars was just how salty things were.  <br><br>It could have been the cheese, it could have been the seasoning, it could have just been an off day for the chef, but man it was loaded with salt.  <br><br>In front of Au Cheval, there is parking, although a very small amount.  Not being a regular and walking to this burger shop, I can't speak on where else you can find parking.<br><br>Would I have rated my experience much more highly if the burger wasn't super salty?  I definitely would have given it 4 stars at the least.  I really enjoyed my time in Chicago, and plan to visit again before the year is over.  I'll likely give Au Cheval a second chance and hopefully my experience will lead to a much higher review, but for now, it was a bit off for us.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FKXlJXKmzeBzjNdZb3h79w/348s.jpg", "caption": "Crispy potato hash with duck heart gravy and an egg"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/DZRHyXik7BfsClzYATIRnA/168s.jpg", "caption": "Cross section of Au Cheval cheese burger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5EVHVgslcQumDQHajPpTwg/168s.jpg", "caption": "Au Cheval cheese burger"}]}}, {"review": {"des": "YESSSS.<br><br>Came early, around 10ish on a weekday<br>Got the duck heart gravy hash, the single cheeseburger +bacon/egg, and the foie gras scrambled eggs<br><br>The duck heart gravy hash paled in comparison to the cheeseburger and scrambled eggs<br>But was still really delicious<br>The gravy was amazing<br>The leftovers were great, but a bit salty<br><br>The cheeseburger was perfect!<br>Simple but delicious<br>The bacon was so thicc<br><br>The scrambled eggs though<br>o m g<br>they were the best eggs I've ever had<br><br>Will definitely be back next time I'm in Chicago", "pics": null}}, {"review": {"des": "Hyped as one of the best burgers in the US, Au Cheval is known for having excellent food. I've been trying to go for years - with absurd wait times as the blocker - and now that I've checked it off the list, I can say that it's good but there are plenty of other amazing restaurants in Chicago. What can I say that others haven't? Well...<br><br>1. Pro-tip: Go alone. I was in Chicago on a work trip, and ended up snagging at spot at the bar with no wait time. <br>2. Add bacon and an egg to the burger. Just do it. <br>3. The food is good. While it is one of the better burgers I've had, I wouldn't say it's the best. The meat and ingredients are quality and it lives up to its deliciousness, but it's not a unique concept. <br>4. Cocktails are solid but not the best cocktails I've ever had.<br>5. Fries are pretty standard, as with the other food. Au Cheval really takes the best ingredients and cooks it well. When it comes to unique flavors, that's where I feel like it's missing something.<br><br>It's worth the visit in Chicago no matter what. It's delicious, well-priced, and will satisfy any food craving you have. Now that I've been once, I wouldn't necessarily go again.", "pics": null}}, {"review": {"des": "Honestly the best bacon I have tried with their burger! It is to die for! You have to try their crispy hash browns and fires. <br>I thought Denver, Colorado had the best burger. You proved me wrong again Chicago!", "pics": null}}, {"review": {"des": "I will admit that the burger is amazingly flavorful and definitely worth the money, but it is not worth the wait. Trust me. <br><br>I went on a Monday night around 6pm, hoping it would not be that long of a line. I was quoted 3 hours. Since I am from out of town, I figured what other opportunity will I have to try this? So I waited. Finally got called around 8:50pm which is pretty close to the 3 hours I was quoted. Ordered the pickleback shot, single cheeseburger with egg and bacon and crispy fries. The shot was strong and totally worth it! The burger was great but honestly I think I've had better elsewhere (Bachi Burger in Las Vegas!). The fries were disappointingly too salty- nothing to write home about. All in all, if I'm judging the food only, definitely a 4 star. But heed my warning, don't wait more than 1 hour for it or else you'd be left disappointed.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zG0r7zrujjReGgPNaS5HOg/348s.jpg", "caption": "Crispy fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bBl34LFGCZBQyfjkvI03yg/168s.jpg", "caption": "Single cheeseburger with bacon and egg"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/JtybZPYuVud1moh5_EcFnQ/168s.jpg", "caption": "Pickleback shots! Very strong, and yummy"}]}}, {"review": {"des": "BEST DAMN BURGER EVER! I am still reminiscing about this and dreaming about when I will get a chance to bite into this amazing burger once again. Of course, there's the infamous 2-4 hour wait here but just takes some strategic planning. We arrived at 4pm to place our name on the waiting list with an estimated 1.5-2 hour wait. Instead, it turned out to be ready in less than the hour and a half for a table of five. I'd highly recommend coming early and assuming a long wait, so it's no surprise.<br><br>Since I did not know when I'd be back in Chicago again and made it through the wait to eat here, I went all the way with the Double Cheeseburger ($14.95) with Egg (+$1.00) and Bacon (+$3.50). Even though this comes out to a pretty pricey burger, it's well worth it! Take note that the Single Cheeseburger comes with two patties while the Double Cheeseburger comes with three. The waiter warned me as I made my order for a double, but challenge accepted. In the end, I won victory and finished the entire burger plus some of my friend's leftover bacon from her burger. Trust me, I could leave no bacon behind because this thick, juicy, glazed and peppered bacon was out of this world! The bacon is an absolute must!<br><br>For the table, we also shared two orders of the fries ($6.25) per waiter's recommendation. The fries were undeniably crispy, salty, and fatty --so good! They were paired with an aioli sauce that was light yet creamy. I couldn't help but add some onto my burger as well. This is a must everytime in Chicago from now on --worth the wait!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2AkjPafjV_buvLdfHXYXng/348s.jpg", "caption": "Double Cheeseburger with Egg and Bacon."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qkGSQ6gzgVr9zzc7ls69tw/168s.jpg", "caption": "Double Cheeseburger with Egg and Bacon."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JW5ZnHDVOP38BsTQwReMVg/168s.jpg", "caption": "Double Cheeseburger with Egg and Bacon."}]}}, {"review": {"des": "Worth every minute of wait time.<br><br>This was hands down, the best burger I've ever had. The combination of the thick cut bacon, fried egg, cheese and meat was just perfection. I cannot stop thinking about this burger. Fries were also on point, and the garlic aioli they make should be bottled and sold, because I'd buy it by the pound. <br><br>The atmosphere is very nice and casual and dark. It was my birthday and they surprised me with a sparkler in my burger and also a huge dessert!<br><br>Such a great experience and exceptional meal. I hope to come back again soon!!<br><br>@sweetviews.sk for more!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UMIonlXn5snmPw7zEdFyNA/168s.jpg", "caption": "Salad was also very very good!!"}]}}, {"review": {"des": "This place is amazing. Only complaint is the wait time but who cares; it's not their fault because this place is amazing! Everyone in town, out of town, and from all over the world are coming here. I've been here a couple times already and had an extensive wait time (1 hour and 45 minutes the first time and 2.5 hours the second time). Yes, I know what you're thinking--\"Is it really worth it?\" YES. IT. IS. The restaurant itself is small so to dine at a table requires your name on an exhaustive waitlist. There's been a spot at the bar the times I've came but my party and I preferred the table option. There are a few Small Cheval locations around town that's just a little sister to Au Cheval with limited seating and fewer menu options but the same amazing burgers. <br><br>Now the food...*inhale*<br><br>The traditional single cheeseburger comes with juicy, perfectly seasoned DOUBLE patties on a beautiful, buttery brioche bun. An accomplished layer of melted cheddar cheese on each patty dancing with it's accompaniment, Dijonnaise. Crunchy bread and butter pickles placed on top of my requested slabs of thick-cut peppered bacon and fried egg. It's partner in crime, French fries, is escorted with an aioli that are both showstoppers by themselves. Fin.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/03QhJBZEkJDT7svJv-u_VQ/348s.jpg", "caption": "Single cheeseburger"}]}}, {"review": {"des": "What does \"Au Cheval\" mean? It literally means \"a fried egg on top\" and that is what is recommended when you order a burger here. Consistency named the best burger in America, I dragged my husband here for lunch while we were in Chicago. We got there pretty early so we didn't have to wait too long but the restaurant is very small so I would avoid going in big groups if possible. We sat at the counter and got to see the chefs in action. <br><br>We started our meal with their wings (general jane's honey-fried chicken with chili, sesame seeds & cilantro) and they were finger licking delicious! When you order the burgers here be aware that their single cheeseburger is actually a double patty. My husband ordered their double cheeseburger thinking he'll get two patties but he ended up with a monster of a burger he barely finished. With that said, their burgers are delicious. Juicy and straightforward and nothing fancy here. I wish it was served a bit hotter though. For some reason it wasn't as hot as I would have liked and yes I am talking about the temperature. But anyways, was it the best burger in America? Unfortunately no but it's pretty darn close. Oh, and one order of their fries are enough for two people so share! <br><br>I've heard stories of people waiting hours for a chance to try one of their burgers. I don't think I would wait that long. I highly recommend you come early and during the week to avoid that kind of wait. The service is super friendly and you're bound to walk out of here happy no matter what! 4/5", "pics": null}}, {"review": {"des": "After nearly 3.5 years and multiple failed attempts to visit Au Cheval, I finally made it through the doors and to a table on 10/22/18. Fun story: the first time I came here in 2015, I made the mistake of trying to eat dinner here with a group of 3 on a Saturday night. When I walked up to the hostess and asked for a table, she said (with a perfectly straight face), \"sure I'll put you down, the wait will be about four and a half hours\". ... Fast forward to 2018, my friends and I decided to grab lunch on a Tuesday and expecting at least an hour or two wait, I was shocked to find that there was...(get ready for it..) NO wait for a table for three. I got over it quickly after reminding myself that I have suffered enough in the last three years so totally deserved this.<br><br>As for the food, we ordered a few classic single cheeseburgers + bacon + egg, fries, and the matzo ball soup. The reason for the four stars is that the burger was good, but it wasn't as spectacular and memorable as I imagined it would be, especially given the hype. The patty was juicy and flavorful, and the egg was a great edition, but I think I probably could have had it without the bacon. The fries were crispy and the delicious, and the soup was also just okay. <br><br>I would certainly come back if I knew the wait time was appropriate, but otherwise Small Cheval is probably just as good.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/tMib8PxD7d6IHw2ClvdT_w/168s.jpg", "caption": "Matzo ball soup"}]}}, {"review": {"des": "I don't entirely get the hype. It's a decent burger, but I don't think it comes anywhere close to the best burger I've ever had.<br><br>Luckily I was able to get in without a wait by going in the afternoon on a weekday, but I hear it's a long wait at any other time of the day. Still, the entire restaurant was still about full. <br><br>I ordered the single cheeseburger for $12.95 and it came out relatively quickly. The soft brioche bun is actually pretty nice actually and has a mild sweetness. Everything else was pretty boiler-plate: the pickles are a little bit tart, the burger is decently moist and flavorful, and it has a slice of melted American cheese. To be honest, it tastes like a burger that you would cook at home. <br><br>The burger is by no means bad, but definitely not amazing - probably worth exactly what I paid for it. If I had to wait an hour for this burger, I'd be pretty disappointed. But overall, it's still a fairly good burger.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hpE78Y8w8Zlb36WO7nxpGw/348s.jpg", "caption": "Single cheeseburger - $12.95"}]}}, {"review": {"des": "Hmm. This burger was the best burger I have ever had. Even 1 month later I am still thinking of this burger. It is worth the 3.5hr wait!! <br><br>Crispy potato hash with duck heart gravy. THIS WAS ACTUALLY REALLY GOOD! The hash browns were thin and crispy. The duck meat and heart gravy was so savory.<br><br>Thick cut peppered bacon. These are THICK pieces of bacon! It was essentially pork belly. The only thing is, it is on the sweeter side.<br><br>Double cheeseburger. AND HERE IS THE LEGENDARY 3.5HR WAIT DOUBLE CHEESEBURGER, WHICH ACTUALLY HAS 3 PIECES OF BEEF IN IT. IT WAS 10000X BETTER THAN IT LOOKS. IT WAS SO. FREAKING. DELICIOUS.<br><br>Pros:<br>-fattiest beef patties ever. They take their meat seriously in Chicago<br>-food is good all around<br>-service was amazing<br>-the wait isn't so long when you wander and do other things. You can reply to their initial text as many times as you want to get an update on how many parties are ahead of you <br>-plenty of nearby restaurants and bars to walk around to <br><br>Cons:<br>-just the long wait but it's worth it<br><br>Tip: do something else while waiting!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yd7DpUZyDycyrSHOF8SCzg/348s.jpg", "caption": "Chocolate Martini. Godiva dark, Tito's, Bailey's."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JWahAnHz1GAeCP4h0Qvqnw/168s.jpg", "caption": "Double cheeseburger."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tvVwVixQ8Z6mpqBZGf_ySg/168s.jpg", "caption": "Double cheeseburger."}]}}, {"review": {"des": "I can't believe I didn't prioritize this place throughout the past year or so that I've visited Chicago regularly. Clearly they haven't been hurting for lack of my attention, because this place is BUSY. We knew this going in, and planned ahead. We went at 7 and got our three hour wait time, which was just fine, as they take your number and text you when a table is ready. There are so many great bars within walking distance and we managed to stop at three of them, which was a fun pre-dinner experience. <br><br>As for the burger. What else can be said, that hasn't already been said. I love it. I love it. I love it. I've always been at my happiest with a burger in hand, and this place made me ecstatic. Note that the single burger is actually two patties, and go for the bacon and egg to complete it. They have created a work of culinary art, which most wouldn't say in reference to a burger. But I will. I was in heaven, savoring every bite of it's juicy perfection. <br><br>One other thing worth noting, it doesn't come with fries. It didn't matter one bit to me, but we ordered some to share for the table. The burger will definitely fill you up without fries, so don't feel obligated. However, the garlic aioli makes the fries worth stuffing yourselves for.", "pics": null}}, {"review": {"des": "I don't know if it was all the hype and the thousands of raving burger fanatics, but all I know is - when I put that Double on soft brioche w/egg, pork belly & cheese in my mouth my taste buds were doing somersaults, cartwheels & jumping jacks.  It was a gymnasium of flavor town meats happiness.<br><br>What I really didn't know upon scanning the menu over and over again is that a Double = 3 patties, not 2.  Why are they playing tricks on me? Holy heffer...I mean I kept looking at this burger.  I cut it in half.  It was pretty dark in the smallish bar/dining area, really low lighting which I like.  And it didn't dawn on me until my tummy put the stops on this burger.  It was a beast, but I thoroughly loved it.  One thing I noticed was the egg looked med in size versus large.  Less than the circumference of the burger.  I like eggs.<br><br>I actually wished I had ordered the regular, because I really wanted to try Jane's honey fried chicken too.  We got lucky with a not so long wait.  We arrived around 3ish on a weekday and the super nice hostess told us about an hour and half for a booth.  I know the waits can be crazy here.  I love that they text you when your table is close to being ready or you can text them to check on wait time.  I did this about 10 x's...for real.  We were seated in no less than an hour.  It's a very small space.<br><br>Everything is ala carte. Fries were pretty good and enough for sharing.  My Pink vodka lemonade was happily served strong.  Service wasn't bad, but not the greatest.  Our server checked on us twice but when we requested tea, he forgot to bring it.  Place was jam packed.<br><br>Is this the best burger ever?  Like anything else, taste is subjective.  I thought it was pretty darn great and cooked a perfect med rare.  I need to eat more burgers (well, not really). I also need to try their brunch & limited menu...Check it out.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MMZm4gyXOjegaNh8bTyWuQ/348s.jpg", "caption": "$20 burger. Money well spent!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kjNIGlC-iKuMA6umtsUv6A/168s.jpg", "caption": "It's beautiful. Look at that pink juicy heffer. Come & get it."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/egxw-1seTrD9htkCQ_Dugg/168s.jpg", "caption": "BIG bad boy. Double cheeseburger with egg & pork belly didn't let me down."}]}}, {"review": {"des": "It's been said that Au Cheval has the best cheeseburger in America (by Bon Appetit). Of course, that statement convinced me to want to try it for myself. Even on a weekday, the limited space in Au Cheval can make the wait times long. Luckily we got in within 20-30 minutes around noon on a Tuesday.<br><br>The single cheeseburger ($12.95) for which they are known, is actually deceiving as a single is one with two patties, and a double has three. You have the option of bacon ($3.50) and an egg ($1), which are musts. The rest of the burger is put together with a mayo, lemon juice, and Dijon mustard mix spread with a house pickle. The bun itself, is thick, but toasted well.<br><br>Is it the best burger ever? I don't know about that. But it is a good burger, especially when paired with that center-cut peppered bacon. And for $13-18, not bad considering some places can charge $20-30 for a cheeseburger with just a single patty. They also do a great job on their fries served with garlic aioli and have root beer on draft!", "pics": null}}, {"review": {"des": "Been meaning to get here since Bon Appetit captured the world's attention with their review in 2015. I've tried to eat here on 3-4 occasions, to no avail, unable to tolerate the wait.<br><br>The way it works- you arrive and get your name on the list. They don't do phone reservations, so don't even bother calling. Wait times will be about 2 hours midday on weekdays, 3 hours on midday Friday and weeknights, and 5-6 hours on Friday / Saturday nights. They are open from like 10-1 so you have a pretty wide range of times to make a visit. If you don't want to tolerate the wait, go early (i.e. 10 or 11 am), and you can probably get seated within 90 minutes. There's a SMS service they use that lets you know how many parties are ahead of you. I've found that people attrite a bit more during weekdays, and most people wait it out on the weekend. After your name gets called, you have 10 minutes to arrive, or you get skipped. I recommend walking around West Loop, and visiting the new International McDonalds or BomboBar / Bar Sienna, as I imagine many of you are coming from OOT. <br><br>Once inside, the space is pretty tight. I can't imagine coming here with more than 6 people, and if you do, I recommend breaking into two groups. In terms of the food, the \"thing\" is the cheeseburger with bacon and fried egg. The \"single\" is actually a double, so be mindful in ordering. It's pretty massive, so even the hungriest palates should be satisfied. The bacon receives rave reviews- I'm a crunchy bacon guy and the stuff they use, while good, is closer to what Americans call \"Canadian Bacon.\" The brioche bun is solid, and the cheese is magnificent. The meat, is cooked to a great temperature, but I found it to be rather bland. The sauce is the highlight of the whole thing. <br><br>I would recommend also sharing some fries between 2-3 people- the garlic aioli (same stuff they have at Small Cheval, I believe) is excellent. The whole thing should set you back like $20 bucks. There's a full bar, as well. For those who are veg's, they have a grilled cheese that my friend claims is to DIE FOR. I've heard the rest of the menu is actually quite good as well, but for my first time I had no choice but to try the burger.<br><br>Overall, I have to go with 3 stars here. The food is good, but I found there to be too many flavors at play with the burger at times, leaving it a bit oversaturated. There are too many factors to creating a great burger, that I don't feel comfortable proclaiming that this \"changed my life\" because it really depends how you like your burgers. Further, there is no food worth waiting 6 hours for, especially given the dearth of options there are in West Loop. Anything with such prohibitive barriers to entry can't get a 5 for me. It's worth trying if you're visiting, but not the end of the world if you can't get a seat. <br><br>PSA: Au Cheval grabbed all the hype in 2015 when Bon Appetit named them #1 in the country. What's interesting is that another place in West Loop, The Loyalist, under the Smythe restaurant, was ranked #1 in 2016, but for some reason never got the love that AC did. I know there's significantly less of a wait, and they take reservations. I haven't been yet (should be going in next couple of weeks) and will review when I do.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0OwDRTS6yOUqtlKjkLALqw/168s.jpg", "caption": "Burger with bacon and egg"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VHFFe0tLWu5CUYL74cvbIg/168s.jpg", "caption": "Burger with bacon and egg"}]}}, {"review": {"des": "When I first heard that you had to wait 3 hours to get into Au Cheval, I didn't understand why. Now I do. The three hour wait is totally worth it! The food is AMAZING, the service is great, and it is definitely worth waiting and going.<br><br>I ordered the 32 oz pork porterhouse with foie gras & roasted apples.  I'm not usually a huge fan of pork, but this was amazing.  The meat was juicy and tender, the sauce provided a hint of sweetness that contrasted with the foie gras.  Every bite was just hand-crafted deliciousness.  Great combination of flavors, and worth every penny.", "pics": null}}, {"review": {"des": "This place changed my life. I had to idea that the usual wait time to get into Au Cheval since I went pretty late on a Tuesday night, but I can see why people wait 3+ hours to get in here. Au Cheval is in an unsuspecting building and actually looks like it's closed up, but when you walk inside you're transported into a sexy little diner. Dim lighting, gorgeous decor and blasting music that somehow doesn't make you have to shout to your dinner partners.<br><br>Once you get past the coolness of this place you will look at the menu and immediately want to order everything. It's really not a bad idea. My partner and I got the fries, burger and chicken. Hands down the best burger I've ever eaten in my life and the fries and housemade sauce leave you wanting to eat 4 more orders of them.<br><br>The chicken is fantastic and comes with hot towels to wipe your greasy little fingers once your done, but I would say always go for the burger if you have to choose. In fact, Au Cheval is my go-to place in Chicago now, I don't think I will be able to pass up on this goodness again, and neither should you. Seriously, it's that damn good.", "pics": null}}, {"review": {"des": "This is only the start of my journey of hunting the best burger on earth  Make sure you ask them to add a piece of foie gras in top of that thick-cut bacon and let the fatty juicy of foie gras, silky yolk, bacon, and burger burst in your mouth all together<br>Def worth the wait!!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1RRWnFVZx1k6_dG2tEqWsQ/168s.jpg", "caption": "Double cheese burger with bacon and egg"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uSD4Thrwxu4AqZX2m998vw/168s.jpg", "caption": "Crispy potato hash!!!"}]}}, {"review": {"des": "After all the hype and talks of Au Cheval I really wanted to be absolutely blown away by this place - but unfortunately, I wasn't :(<br><br>Don't get me wrong, was it a solid burger? Definitely.<br>Best in America? ehhhh.. debatable.  <br><br>I got the classic single burger (two patties) with bacon and fried egg on top. The burger was definitely juicy, and the thick cut bacon was great. Pair that with a runny yolk and you do have a winner. However, I really was expecting something different, something more special than just a well made burger. The flavors didn't necessary blow me away, and although the execution was spot on - I guess I expected that for a 2 hour wait time on a Monday late afternoon.<br><br>The fries on the other hand, was really great! The garlic aioli made all the difference. Crisp, perfectly salted - and basically every fries lover's dream.<br><br>So, was it worth the wait in my opinion? Only if you have time to spare.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zI2U29PXjKNgrd9V2jKAgg/348s.jpg", "caption": "Single with Bacon and Egg!"}]}}, {"review": {"des": "I would give this 4.5 stars! <br>Waiting: expect at least 3hrs which I would recommend you going to the worldwide McDonald's and try their menu whiling waiting. The reason for the .5 stars deduction was because we asked for a table and they put down as \"bar\" so we wait an extra 10-15mins which was fine. I think the communication was a little off. <br>The food was amazing! Ordered: bone marrow, fries with farm egg, and double cheeseburger with egg and bacon! <br>They gave us a free dessert because it was my boyfriend's birthday! I love it and I would def go again! <br>Parking: you can find one maybe 5blocks away or nearby street parking.", "pics": null}}, {"review": {"des": "Sadly, Au Cheval did not live up to it's hype for me. We came on a Thursday around 1pm and were instantly seated, which was surprising since I've heard the line is usually pretty crazy.<br><br>We both ordered the burger since that is what they seem to be known for. I added an egg to mine, and my fiancé added both egg and bacon. The burger patty was a tad dry, and was incredibly salty. The saltiness overpowered everything else that was on the burger, and unfortunately made the meal subpar. Definitely not my favorite burger. I don't think this place is worth it, especially if there's a long wait.", "pics": null}}, {"review": {"des": "Talk about food nirvana! Au Cheval is all that everyone says it is-delish & then some! Our table ordered the cheeseburger w/ bacon & fried egg!!  Also had the fried bologna sandwich.  The appetizers we tried were duck heart hash & chiliquiles.  Each dish was so different & sooo good! Will definitely come back!  Bloody Mary's are a must<br>The 2.5 hr wait is no joke but one thing we did was put our name in & walk over to the chriskindle  market in Daly plaza & pass the time until they texted our table was ready!!! The dinner menu on sat starts @ 3!<br>Say Hi Jordan!! He was a super nice host taking our names!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fHi8dHlmOI8lX34nyGTJDQ/348s.jpg", "caption": "Cheeseburger w/bacon & a fried egg"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r7p40dnaAmblijVxja_MoA/168s.jpg", "caption": "Cheeseburger with egg & bavon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aGG-VkufM9Od9wv09n-Jvg/168s.jpg", "caption": "Chiliquiles"}]}}, {"review": {"des": "Great spot for rich diner food. <br>There always seems to be a wait, so it is pretty popular. While we waited, we walked over to the bar two doors down, Lone wolf, which I also highly recommend. <br>I had the burger which was salty but good, the fries, and my husband had the bone marrow off of the appetizer menu which he highly recommends. <br>We had this as our second dinner and was worth the wait.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ay9lzTRxi2AGMmgW-lM8mw/348s.jpg", "caption": "Bone Roasted Marrow Bones , Beef Cheek Marmalade & Toast"}]}}, {"review": {"des": "After reading reviews, I thought I had to wait forever for a cheeseburger. Luckily, I walked in for a late lunch around 4pm and had a seat at the bar without waiting. I got the single cheeseburger and added the egg & bacon. When the burger arrived, it looks sooooooo good! The egg looks so perfect and the thick-cut bacon was <br><br>The burger was juicy and flavorful. It did get a bit overwhelming but the big slice of pickle helped out. Finished everything on the plate. It was a delicious lunch and a good experience since I didn't have to wait at all for a seat. Would come back to try other things on the menu.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qgBWPfVoBYbNR2p1Oosc5Q/348s.jpg", "caption": "Single cheeseburger with eggs & bacon"}]}}, {"review": {"des": "Believe the hype.  I came here for lunch and sat at the bar, didn't have to wait at all at 11:30 on a weekday. I ordered the burger with cheese, egg and bacon. I wish I could have tried other items on the menu...<br><br>The burger is decadent, juicy and full of flavor. I definitely recommend adding the egg but the bacon is personal preference. <br><br>Service was quick and friendly. Hope to come back next time I'm in Chicago!", "pics": null}}, {"review": {"des": "It was not close to being the best burger I've ever had... in fact, it was just an average burger imho. The taste was great but flavors were nothing exciting. However, credit must be given where it's due: the scrambled egg with foie gras and toast was so decadent and delicious. Never had a dish like it and found it quite memorable.<br><br>We had to wait about 25-30 minutes at 11:30 a.m. so definitely come early to avoid the wait. Like a few other reviews have said, I just wasn't impressed!", "pics": null}}, {"review": {"des": "Had outrageously high hopes due to a friend and # of yelp reviews. We definitely enjoyed our meal, primarily due to the ambiance and the sound system, but probably won't come again. Such GOOD music! Great beer selection, too.<br><br>We tried the regular cheeseburger and fries and were blown away by how salty both were. I enjoyed the burger, but it took a lot of hydrating to recover. Lovely service, lovely ambiance--but not totally sold. Sorry to say it!", "pics": null}}, {"review": {"des": "I didn't want to believe it.  I didn't want to believe that this would be the best burger I ever have and no other burger would live up to it.  But I was defeated.  Au Cheval. Is. The. Best. Burger.  I've tried others in the city that are similar (Maudes, Loyalist, Small Cheval) but the bacon, egg, and sauce, truly makes this burger.  I love Au Cheval because they have a limited menu (theres only one burger, you can alter a few ways by adding egg, bacon, another patty, etc), a solid craft beer menu, and awesome service.  <br><br>Minus 1 star for the wait - Yes the wait is terrible.  When I come with guests I always try to reserve a table before 5 on a week day (the spend the wait time exploring the many happy hour options near by).  On a Tuesday I've waited 40 minutes at 6pm, and on a weekend I've been told not to bother putting my name on the list because it'll be past midnight.  That part sucks.  Is au cheval \"worth the wait\"? it depends.  Nothing is worth 4+ hours.  However the burger is the best you'll ever have! No doubt about it.  <br><br>Also try the fries, bacon side(appetizer), and bone marrow -- yum!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cGHz4HJ1qXPUi8TCZByZtA/168s.jpg", "caption": "The bone marrow... delicious on toast with their yummy jam!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iIRlKWOEeVxA8AGd_Vl6qQ/168s.jpg", "caption": "Yesssss"}]}}, {"review": {"des": "Went on a Monday at lunch time to encounter absolutely no wait! We were seated within 5 mins of arriving and ordered:<br><br>Scrambled Eggs & Foie Gras: Amazing! Eggs are fluffy, Foie Gras was very rich and every bite was an explosion of flavor. I could have had a whole loaf of toast with this. <br><br>Cheeseburgers: Fantastic. Very well seasoned patties, melted cheese, pickles, eggs and thick cut bacon on a toasted bun. Every component was well made. Thick cut bacon and egg were a great add. Sweet and salty bacon, perfectly cooked egg, juicy patties. Getting hungry just writing this. <br><br>Fries with eggs and cheese: Fries were crispy but fluffy. Garlic aioli was amazing. Would order simple fries with extra garlic aioli instead of the cheese though! Still great.", "pics": null}}, {"review": {"des": "I moved to Chicago recently, and heard tons of hype about this place. It seemed sure to disappoint, and to be frank, I went in wanting to not like it. But BELIEVE THE HYPE, PEOPLE. Au Cheval serves the best burger I've ever had.<br><br>I ordered the double burger au cheval (with an egg) and a side of french fries. Important tidbit: the \"single\" is actually two patties, and the \"double\" is three. I knew this going in, and I ate all three happily... (no judgment, please! They are thin patties.). Also, they don't bother asking you how you want your burger cooked, which I love. They know the proper way is a nice medium rare just a little pink. <br><br>Even before you take a bite, you can see how juicy it is going to be. I would be lying if I told you I haven't looked back at my photo of the burger multiple times since I went and craved it again. Between the perfect meat preparation, the melty cheese, and the dijonnaise, the burger makes for an incredibly juicy bite topped off with the soft warm bun and thinly sliced homemade pickles. My mouth started watering writing that sentence. <br><br>They absolutely crush the french fries here too. The fries are natural cut, perfectly salted, and have a very satisfying crunch to them. The outside is crunchy without the inside turning to mush, so the texture is amazing. They come with a very flavorful aioli. Truth be told, I'm not always into dipping my fries into a sauce, but this aioli was different. It went incredibly well with the fries. The fries are a large enough portion to share between 2-3 people. <br><br>I've also had their Bloody Mary, which was classic, spicy and peppery. It was excellent enough that I ordered a second. It's topped with pickles and hot peppers and rimmed with celery salt.<br><br>As far as wait time, I'm not sure what the experience is like going at a regular dinner time. The first time I came here was 11am on a Tuesday and the second time was 10am on a Saturday. On both visits, I was able to walk right in and get a seat immediately. I did notice on the Saturday visit the restaurant was full within 10 minutes of getting there, and there was already a line by the time we left. I heard that you can put your name in and leave, and they will text you when your table is almost ready.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mAPfhEpk4lUTC37t6oYKBQ/348s.jpg", "caption": "My wife's \"single\" burger, French Fries, and Bloody Mary"}]}}, {"review": {"des": "I thought the hype was real. At this point they have over 5,500 Yelp reviews and averaging 4.5. Solid. <br><br>As I visit from out of town a huge part of my travels involves food. Au Cheval did not disappoint one bit. Fantastic actually. <br><br>We got the crispy fries with garlic aioli and a fried egg on top to share. This was so good. The yolk dripped on the fries and then the aioli was on point. <br><br>My burger was phenomenal with the thick cut bacon added the cheese was melted and I did get a side of ranch and they added dill to it which just made me that much happier. <br><br>I don't care about price as some reviews stated. Honestly I didn't think it was overpriced and great value for the money spent for the quality of food. Businesses have to make money too people. <br><br>I also told the server that it was my birthday and not only did they bring out my burger with a sparkler on it, we also got chocolate birthday shots. What freaking amazing service and what a great touch. I was smiling the whole night. That's service done right and I definitely will be back without a doubt. <br><br>The only \"negative\" thing about this place, we did wait 2 plus hours to get a table. Good thing there were many other bars around to pregame at. So be patient it's small inside.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/LC3SWXlf48Fsy9PA1S9jvQ/348s.jpg", "caption": "Single Cheeseburger with Thick - Cut Peppered Bacon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6xaXJXDhIRZq1H7x1HxXvA/168s.jpg", "caption": "Cheeseburger A Cheval add Thick - Cut Peppered Bacon"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Vcj9l7i3pdJvF5HzOJ4D4g/168s.jpg", "caption": "Ranch. Unreal"}]}}, {"review": {"des": "If you're ever in Chicago, you must go to Au Cheval. Everything about this place is dynamite. Food, service and atmosphere. However, this is always usually a wait. If you time it right, you can walk right in. <br><br>I always get the burger. You can customize it a bit, choosing between 1 or 2 patties, cheese, bacon (which is a huge slab of pork belly), and a fried egg. I usually go big and get 2 patties, bacon, cheese and an egg. Everything about this burger is perfection. <br><br>Then, I also had the chicken wings. They have an Asian sauce/flair to them and the skin is crispy perfection. Seriously the best wings I've ever had.<br><br>This place never disappoints. I would fly to Chicago just to go back to Au Cheval.", "pics": null}}, {"review": {"des": "Oh Au Cheval, I had been waiting for one of your burgers for such a long time. I recently gave up red meat, but I had to throw my diet to the side for one day of indulgence!<br><br>What I ordered: the burger of course! (Note: a single here has 2 patties and the double has 3.) I got the egg and bacon on top as well. It was absolutely heavenly. The bacon was unlike any bacon I had tasted before. It was so thick and meaty. To drink I had a Bloody Mary. It was strong and not too spicy, but still had flavor. <br>Honestly, I don't know if this is the best burger in Chicago because I haven't been to the other \"best burger\" places, but this burger has to be pretty darn close to the best!<br><br>I will say the line is almost always long here so make sure to leave early so you can put your name in, then take a nice walk around the block or find someplace to get drinkies!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gfSfY2v-MuV1ia1kiGb6Tw/348s.jpg", "caption": "Burger with egg and bacon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sPgpV5GWkxdAEVjMMjapbg/168s.jpg", "caption": "Bloody mary"}]}}, {"review": {"des": "HOLY BURGER ARE YOU KIDDING ME <br><br>ok<br><br>I've been to small Cheval and was underwhelmed. Then I waited 2.5 hours for Au Cheval and was OVERwhelmed. My goodness.<br><br>My friend and I balled out, each getting a burger and sharing the thick cut pepper bacon and the fries. DO JUST THIS.<br><br>Add and egg to your burger 1000%. It was perfectly cooked with all the right toppings. The egg was running and amazing. The bacon HOLY CRAP I could have eaten an endless bucket. It was thick cut and delicious. <br><br>The fries were the icing on the cake. You know when you want to eat them all bc it is so good but physically can't. That's how it felt. We ended up taking food to go and eating it about two hours later because we just couldn't help ourselves.<br><br>This place is worth the wait, just plan accordingly", "pics": null}}, {"review": {"des": "Attention: The single cheeseburger has two burger patties and the double cheeseburger has three!<br><br>I was super excited to try Au Cheval but knew that the wait would be crazy. So I did the sane thing and came here at... 11pm. I wasn't hungry, but I had to try this place so I thought why not squeeze in a second dinner. There was still a 10 minute wait. <br><br>My boyfriend ordered the double cheeseburger because we didn't know that the single cheeseburger was basically the double! He finished it, but complained about how full he was after. I got the single cheeseburger and couldn't finish it because we were fools and ordered extra food. We added their famous bacon on our burgers which were super thick cut and ordered their crispy potato hash. Everything was delicious. My leftover burger was even better the day after! <br><br>This is definitely the place to try if you're in Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AwFM8F5ma9Y9O6xo4IJ2Cg/168s.jpg", "caption": "Crispy Potato Hash"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_ngCW9ZSggan9akdaOKKKA/168s.jpg", "caption": "Single cheeseburger (has two meat patties)!"}]}}, {"review": {"des": "I've been here countless times and yes, if you have a group, the wait can be arduous. However, most of my trips here have been by myself and when you come here solo, the seats behind the bar taps are first come first serve. I'm not going to get into the weeds about best burger talk (it's in my top 3) but if you haven't been, it's worth a try (I get everything but the egg but would recommend getting the egg your first time.) Their house made pickles are great too and cheap lager cans are the icing on the cake. Everything on their menu looks great but haven't strayed from the burger. Not an everyday treat but definitely something worth treating yourself to if you have the time and money.", "pics": null}}, {"review": {"des": "I resisted liking Au Cheval for a while because it just seemed like they had a good publicist and someone at the Red Eye who'd write whatever they asked.  <br>I went 2x before being truly impressed.  Au Cheval is really a good restaurant.  Yes the wait is ATROCIOUS but the food is pretty consistent.  The bacon is WONDERFUL.  one time I went and my date's bacon looked better than mine and they brought me FRESH BEAUTIFUL BACON.  Talk about good customer service!   The burgers are great.  I've heard that the fried chicken dish is great too.  <br><br>Also the burger reheats pretty well if like me, you eat half at the restaurant and take the rest home for breakfast.  <br><br>Pro tip: sitting at the counter doesn't make the service any worse.  <br><br>Pro tip#2: the wait is never as long as they project.  Just day kk and go across the street and drink until they text you.", "pics": null}}, {"review": {"des": "AU-SOME! I'm more than grateful for having the rare opportunity to dine here. The world-renowned Au Cheval lived up to its allure. Boasting gourmet burgers and famous fries, Au Cheval was a foodie's fantasy. We were lucky enough to only wait a short 2 hours to be seated.<br><br>I ordered a single cheeseburger (which is actually two patties) and the poutine fries with garlic aoli. It tasted how Christmas feels when you're a kid. My fiancee got thick cut bacon on her cheeseburger and didn't say much other than \"MMMMMMHHMMM\" for fifteen minutes. I only wish I could have had my burger cooked medium but other than that I couldn't have asked for more.<br><br>This was by far the most juicy flavorful burger I've had in years. Everytime I go to Chicago this will be a must-go! Get here ASAP and see what all the hype is about.", "pics": null}}, {"review": {"des": "The burgers are legit so be prepared for a long wait. I remember this place not having reservations and the layout being long and narrow. I went right when dinner service started on a weekday so I was able to get in right away.<br><br>I like how their burgers have no real gimmicks to them unless you want to customize it somehow. They're pretty straight forward, juicy, and tender. The burgers looked small so we ordered fries and bone marrow. I've always enjoyed bone marrow and this is no exception. The marmalade gave it a nice sweetness.<br><br>I think this might be the closest option to an In-n-out burger out here in Chicago. It is very good, just not as cheap or readily available as the west coast chain.", "pics": null}}, {"review": {"des": "Dang! We got there 10 minutes after it opened and the place was already packed and people were already half way through their burgers!!!! Our wait was about 20-30mins long. The hostess was really nice and friendly.<br><br>Ordered two burgers: one cheeseburger, the other without cheese but with fried egg and bacon. And a side of fries. <br><br>The cheeseburger was very flavorful. The other was a bit on the sweet side because of the bacon. Not too fond of the sweetness. The fries were fries. The dipping sauce (don't remember what it was) was pretty good too.<br><br>This place reminds me of Ruth's Chris back home. Will come again outside the brunch hours.", "pics": null}}, {"review": {"des": "WOAH WOAH WOAH everyone shhh you don't know about this place. lets keep it a secret because i want everything here for myself LOL<br><br>honestly, i think this was one of the best restaurant experiences ever.  from the host being SUPER friendly, to everyone during the dining experience being awesome, it was great.  i didn't feel rushed AT ALL trying to enjoy my meal, and the kitchen is open, so it is super fun to watch all the chefs cook if you sit at the bar, but they seem so calm cool and collected, not frazzled at all, so the entire experience was so chill and relaxing! i could really enjoy my meal without being stressed.<br><br>please please please get the burger, bacon slab, and egg. the bacon is out of this world, and it is SUPER soft. just slices so easily with your teeth. and please please PLEASE get the fries. it is cooked to perfection, with the right size, not too thick or too thin, not too crispy or not too soggy, the chef, she's amazing. i don't think you need to order the fries with egg and gravy, as its kinda salty and pretty heavy if you get it in addition to the burger, but just get regular fries. my friend and i split one burger and one side of the fries (egg and gravy), but we couldn't finish the fries.  next time, i will probably just eat a whole burger by myself. no sharing. nope. not again.<br><br>and please please please get the bloody mary LOL its so refreshing. beer is bomb with the burger too, but the bloody mary is like BOMB.<br><br>i really enjoyed the experience here not only because of the food, but the people who work here, starting from the host to the server to cooks to manager, errbody, made it super pleasant.  the wait was so worth it and the host was super accommodating and friendly and i want to be his best friend.  thanks au cheval! i will be back for sure.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Y-XyeyM8XpsZHgnIlzgjVw/348s.jpg", "caption": "fries with gravy and egg"}]}}, {"review": {"des": "HANDS DOWN the best burger I have ever had!!<br><br>I've been to small cheval but this was my first time coming to Au Cheval. I expected it to be basically the same as small cheval but let me tell you - they are so different! The bacon & the egg on the burger are unlike any other! Definitely a necessity to get both the bacon and the egg even if it's something you're not sure you would typically want. The flavors work so well together and nothing is overpowering. The egg is perfectly cooked, not too runny and the bacon is not your typical fried bacon - similar to Canadian bacon but with so much flavor. A standard burger comes with two patties so expect to be FULL. We order one fry to spilt - the garlic aioli a must.   <br><br>If you're going to come and wait as long as you have to, get both and don't look back.", "pics": null}}, {"review": {"des": "Meh. Typical overhyped food to attract the tourists and i fell for it. Fool me once. The patty was well done and overly salted. All in all, fine, but I've had McDonald's that tasted better. That said, the service was fantastic (even if it was to rush people out), hence the 3 stars. Would totally recommend La Josie across the street though. Phenomenal bar staff and drinks and the food smelled pretty excellent also. When I mentioned I was coming to Au Cheval, the bartender made me walk across to put my name on the list, with no card or anything else to hold my tab.", "pics": null}}, {"review": {"des": "Really is the best burger I've ever had. I've had it sober, not so sober, and many times and still stand by the statement. They can get up to a 4 hour wait though, so be prepared to put your name down and head to the bars in the area. They will text you when your table is ready so you don't have to stick around, which is best since there's really no space in the place to wait even if you wanted to. <br><br>The other food is good, but if it's your first time you really must get the burger.", "pics": null}}, {"review": {"des": "Maybe it was just so over hyped that it came up being 3 to 3.5 stars, but au cheval overall was Okay. They don't have a phone to call them or take reservations online so you have to just show up. It's not a huge restaurant and maybe if you ask, you can get a booth. <br><br>The service is good. The drinks taste delicious. The food was good. Solid 3.5 stars. It's a burger done right. Your order fries separately. I didn't taste the chicken liver but was told it was very good. <br><br>All in all, a nice experience and I am sure I will be back for brunch.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3zPkFLsQ7Fpa-R5lQEYUCA/348s.jpg", "caption": "Chopped Chicken Liver , Salted Butter & Toast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aYjIvvi5eqR1QMSHfvd2Pw/168s.jpg", "caption": "Chopped Chicken Liver , Salted Butter & Toast"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/w8rIDipoWCRZwmM65iYj2Q/168s.jpg", "caption": "Bread & Butter Pickles"}]}}, {"review": {"des": "Stopped here for the fries, and they were A-MAZING! I highly recommend the burger options on the menu as my friend who ordered a beef burger said it was the best burger he had ever eaten. The decor and restaurant vibe is a must to experience and Au Cheval is a restaurant that everyone visits at least once in Chicago.", "pics": null}}, {"review": {"des": "I was blown away by this restaurant. It is pretty small but just beautiful. It has a gilded feel to it with a giant mirror and stencil accents. The light is golden and the booths are plush. Even the bathrooms (unisex) are clean and decorated well. The kitchen is front and center right behind the bar so you can clearly hear and see the buzzing of the workers. The restaurant is just filled with a sizzle, the chatting of the other patrons, and the heavy base of the music they blast. <br><br>You get down to the food and I was just amazed (still am) by how awesome the burger was. Every part of burger was perfect and worked beautifully together. From the first bite it was like my taste buds exploded and melted as the same time! <br><br>A single burger actually comes with two patties, so remember that. Really it's plenty to share and especially so if you are visiting and don't want leftovers. It came on a brioche bun, with bacon, an egg, and what I think was homemade mayo. Whatever their meat blend was, was just outstanding: moist, seasoned and cooked perfectly. The egg could have been a little bit less cooked but that's just a personal preference. The bacon alone was amazing. Unbelievably thick, salty and sweet. And the mayo wasn't just Hellman's, it had to have been made in house. I don't know what was in it but it was delicious.<br><br>We arrived about 30 minutes after opening and were able to be seated right away but when we left there was a line out the door. Be prepared to wait if you aren't there first thing.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LRUvp2nFUdTMssS6Lii19A/348s.jpg", "caption": "Cut open"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ggoeVIJzopTlHzPalireqQ/168s.jpg", "caption": "A single burger with bacon and egg"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/yUBifRUYcOnaHacbEjjq_w/168s.jpg", "caption": "View from our booth."}]}}, {"review": {"des": "A few weeks before my trip to Chicago, I saw a show on the Food Network awarding Au Cheval with having the best burger in the country. We arrived right before noon on a Friday and our wait for a table was over an hour. A text was sent when our table was ready. Since the burger is the star here, that's what we all had. Even though a couple of us wanted to try the fried bologna sandwich. We had a side of the fried bologna topped with cheese so we could try it. It was okay and a little on the salty side. I had the single cheeseburger and added the thick cut peppered bacon and fried egg. We shared orders of hash browns and French fries. The dipping sauce that is served with the fries! Gimme more!  Anyway, this wasn't the best burger I've ever had. Can't even say that it ranks near the top. It was an average tasting burger to me. Glad I had the experience and checked Au Cheval off my list though.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vjkmjpkHBn8lmszTS81Wgg/348s.jpg", "caption": "Side of bologna"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_p417lOc0F3OuoC8jDgLPA/168s.jpg", "caption": "Pink vodka lemonade"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XSZrDkAwSnxPFPVQdbtPYQ/168s.jpg", "caption": "Single cheeseburger"}]}}, {"review": {"des": "BEST BURGER OF MY LIFE. THE HYPE IS REAL.<br><br>I don't know what more I can say that other people haven't but the burger really was perfection. I was one of the luckier ones and only waited about 40 minutes for a table on a Sunday (opens at 9am and I got there around 10:30am). They do have a very convenient texting system so you can put your name down and walk around nearby while you wait (plenty of other bars/coffee shops). The place is SMALL. I could tell why the wait is so ridiculous.<br><br>Now, if the wait was not 40 minutes would I have waited 2-3+ hours like some people have? Hell to the no. Yes, this burger was amazing but there is no way I am waiting that long to eat anywhere (but that's just me). So I can see why some people are disappointed with their meal after waiting for sooooo long. If you wait for that long this is probably not as good as it could be because you're just over it by then.<br><br>I will say that the fries were standard (have had much better fries elsewhere). I didn't love them compared to my burger, and among 3 people we barely finished half of the fries because we were too busy eating our burger/the fries got pretty soggy after awhile because of the fried egg they put on top. I would order another appetizer to share off of the menu and not get the fries.", "pics": null}}, {"review": {"des": "Finally made it out here, and I've got to say... it wasn't worth all the effort. The burger here is solid - good quality meat, good ratios of fillings to bread, etc. It just wasn't worth $15 for a burger + $7 for fries + tip and tax. My dinner of a burger, fries, and beer came out to $40, which thankfully I split since I came with a friend. For $40, I would expect this to be the best burger. It was not. However, it was still tasty, and I think it deserves 4 out of 5 stars. <br><br>A couple tips for eating here: come EARLY and put your name on the list. Try to come with one other person, and try to snag one of the for bar seats.", "pics": null}}, {"review": {"des": "I was very skeptical about Au Cheval when I heard that it has amazing burgers. How amazing can burgers really be to justify the average one hour wait? Given that there are so many amazing restaurants in Chicago, I was extremely close to skipping Au Cheval. However, I happened to have some free time with a friend so I decided to stop by. We came around 1:30PM, so no wait. We ordered the 15 dollar cheeseburger to split. <br><br>The burgers are not bad, but they are not \"wait one hour for them\" good. <br><br>If you are like me and had a short amount of time in Chicago but want to maximize on visiting amazing restaurants, I would recommend slotting Au Cheval as optional, backup, or split with a friend as an appetizer to something else (ex Green Street Smoked Meats, lunch at Blackbird, About Last Knife, etc).<br><br>Again, its a good burger, I'd rank it as a more gourmet version of In and Out, but I don't think it is a must visit nor a revisit.", "pics": null}}, {"review": {"des": "We knew going in about the wait and planned ahead to go to a bar across the street for drinks. After about an hour we were seated in a cozy table.<br><br>Ordered, waiter was nice. Great service from him, nothing I can complain about.<br><br>They ran out of drink ware so our drinks came out after our meals, but they were apologetic and I know it happens, they made it right, which is all one can do and we had a lovely time.<br><br>Food as you can tell from the reviews was great. Was not a fan of the bacon though, it was too sweet so I ended up eating it separate from the burger.", "pics": null}}, {"review": {"des": "Is this the best place for burgers? Au Cheval has a strong case for that... if you are willing to wait over an hour for a seat. I am a sucker for amazing food so I waited several times and drank myself sober at the bar across the street. This place is very dark and has a diner feel but you'll have moments of bright flashes coming from random areas of the restaurant.<br><br>Yes, this place is delicious! But I think what makes this place great is their think cut bacon/pork belly. A typical burger comes with patties, bacon, eggs, and some special sauce. I always get my burgers dry and this place is worth a try. It is certainly on the pricier side but you pay that premium for the location and consistency in quality.", "pics": null}}, {"review": {"des": "Looks like a normal place, looks like a normal burger, but dear God it's not. I had an out-of-body experience after my first bite. I dont know what it is about the burger- I couldn't figure it out- but something about it is just amazing. I got the single patty with egg and bacon (I was starving and the single patty order was more than enough). I also got a side of fries with garlic aioli. Both orders were to die for. The side of fries was just shy of $7 which was pricy, but I'm so glad I ordered them. All in all, I've never had anything like this meal. <br><br>My friend recommended this place to me and I was like \"eh, good burgers, maybe I'll stop by...\" and I'm so glad I listened to him. It's so much more than a good burger. Do yourself a favor and try this place.", "pics": null}}, {"review": {"des": "Overpriced burgers that are done better somewhere else...like at home..<br><br>I don't think we'll go back due to so many other options but convenient location off the 606 makes it attractive but we never go back.<br><br>I think we might probably go back..it's just not appetizing enough to justify the price. It makes me wish for an In N Out.", "pics": null}}, {"review": {"des": "I did not start yelping until I left Chicago and whenever we come back for the holidays, our routine is to go to Au Cheval. I thought i would contribute to its 5000+ reviews of how great this place is.  It's both my and hubby's favorite cheeseburger... ever. There's always a line... even when u walk in a little after it opens at 10 am, the place is full and there's an hour wait. This time around we sat at the bar and ordered our usual cheeseburgers. I get the single which consist of double patties, cheese, some white sauce and pickles on fluffy brioche buns(I personally ask for less salt or no salt because I find the regular version a little salty, my hubby likes it as is. In hindsight, I think less salt better than no salt). We usually get the thin fries that comes with garlic aioli but this time we got the what's cAlled the crispy fries(thicker cut, with Sunny side up eggs, garlic aioli and mornay sauce). I liked the side of fries better... from what I remember, they were the thin version(I may be wrong or they may have changed the cut now). Anyway, Brendan Sodikoff who owns au cheval and a bunch of other restaurants (Bavette's, Gilt Bar, green street smokedmeats etc) really knows his food. We love all his restaurants !!", "pics": null}}, {"review": {"des": "Waited 45 minutes on a Monday evening... BUT IT WAS TOTALLY WORTH IT.<br><br>Au Cheval served me one of the best burgers I've had in my lifetime. Ppl think it is hyped or w/e, but I guess you'll have to try it for yourself! The patty is perfectly cooked medium, which is a little pink inside. I noticed that each bite was so juicy. It wasn't soggy, it was perfectly juicy and not one bit dry. I did taste the salt but didn't think it was too salty.<br><br>I ordered the single cheeseburger (comes with two patties!!!) with egg and it comes with a slice of pickle. Bf ordered a double and it came with three patties! It was a difficult bite for him because the burger was huge lol. We also ordered a green salad as a starter and we loved the sour dressing. Additionally ordered a side of fries which had an addicting aioli sauce. Worth trying in my opinion. <br><br>Service is amazing too. Their staff is constantly on the move, checking in on how things are. They're super friendly and attentive. I loved sitting at the bar which was a direct view to the open kitchen..6 staff working in that kitchen but each person was such a key piece to their puzzle! Au Cheval is a great burger place and I would come here again when I visit the Windy City for sure.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sx6iP9f9Y3s5gCe75Z4qSQ/348s.jpg", "caption": "Double cheeseburger"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xjoeXlGtvK_W2hlu2E8IhA/168s.jpg", "caption": "Single cheeseburger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jBB2NOkJknb5dyzncqT4uw/168s.jpg", "caption": "Fries"}]}}, {"review": {"des": "This is such a tourist trap but I think it's worth going just to say that you did it.  <br><br>No where close to the best burger in Chicago but they are pretty good.  If you're gonna go to Austin Cheval on a weekend night, you gotta do it right:<br><br>-put your name in around 5pm (it's going to be a 4hr wait at least)<br><br>-while youre waiting, bar hop up and down Randolph.  There are many amazing bars in West Loop and Randolph is the perfect street<br><br>-end your night at Au Cheval", "pics": null}}, {"review": {"des": "Came to Au Cheval on Tuesday afternoon around 3 pm for a late lunch/early dinner. We were seated immediately with a party of two! <br>We got the single cheeseburger with bacon and egg, the duck gravy potato hash and the fried chicken. <br>The cheeseburger was definitely the star of the meal! I can say confidently this is the best burger I've ever had. There are actually TWO juicy patties in the single and thick delicious slabs of bacon. Everything is perfectly seasoned and just the right combination of deliciousness. It's very filling as well! <br>The duck gravy potato hash was also delicious. The potatoes were unbelievably crispy and the gravy was very rich. All topped off with a fried egg. I think it would have been difficult to finish alone bc of how rich and heavy the dish is.<br>The fried chicken was tangy with a slight kick. The portion was very generous: two wings, two drumsticks and two thighs! We were unable to finish the whole meal and had to pack up most of the chicken to go. <br>This place is definitely a Chicago staple and a must visit for anyone looking for the most amazing burger!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nRNkaWL2nknTXudoZJ8ZhA/348s.jpg", "caption": "Fried chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z3aWu6aWFdO7as4XZnJsVA/168s.jpg", "caption": "Single cheeseburger with bacon and egg"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Qfa6zElAf_fJh3_X1E1GGA/168s.jpg", "caption": "Potato hash with duck gravy"}]}}, {"review": {"des": "What else can be said about the Au Cheval burger<br><br>I've had many burger across Chicago and this continues to be #1<br><br>I will add that I keep hearing how Small Cheval in Bucktown is the same burger without the line and I couldn't disagree more.  The burger at Small is awesome, but it's not in the same league as the Au.  Small Cheval is maybe the Scottie Pippen to Au Cheval's Jordan.", "pics": null}}, {"review": {"des": "This place doesn't need another fantastic review but imma do it anyway. We came here at 9:30 on a Sunday morning. After failing to heed the warnings that we should've been there half an hour prior to restaurant opening to get a table immediately, we were afraid we were going to have to wait but we were seated immediately. It did appear that if your entire party wasn't there they would not seat you. The place did fill up relatively quickly within the next hour however. <br><br>I love the decor, so on point. Black industrial ceilings with warm leather and wood, so classy. <br><br>My husband had the chèvre omelette, a pillow of buttery eggs and soft smooth goat cheese and I had the traditional English breakfast, which had some sort of magically delicious bacon on it. The selection wasn't huge for breakfast, but the food was superb and cooked perfectly. We weren't there to drink but the cocktail selection looked amazing as well. <br><br>Thanks Au Cheval! I hope we can visit again soon!", "pics": null}}, {"review": {"des": "This is probably one of the best burgers I've ever had in my life. Now i see what the hype is about! Even though there is a wait, i like their texting system where you can check your place in line at anytime and also, when the table is ready and if you've chosen to go somewhere else, you may kindly decline through text as well. The restaurant is on a street w a bunch of restaurants/bars so we decided to wait. We were told an hour and a half but got seated in 45 mins in one of the booths. <br><br>It is pretty dark in there but it definitely sets the mood. We ordered drinks while waiting. The pink vodka lemonade was actually really good while being kind of strong at the same time. Any drink that's strong AND delicious is a plus in my book!<br><br>We ordered single cheeseburgers but got served double cheeseburgers. With the bacon was a bit much for my mouth to fit to i had to take one of the patties out lol but IT WAS SO FREAKIN' GOOD. I literally savored every single bite! The bacon is more like pork belly since it's so thick but it's flavored well. The fries were a bit salty but egg compliments it w the sauces.<br><br>Nice/clean bathroom is a plus as well.<br>DEFINITELY RECOMMEND EVERYONE TO COME HERE! It was one of my best meals our trip!", "pics": null}}, {"review": {"des": "Really good burger but I don't know if I'd be willing to wait hours for it. Come during a weekday at like 10 or 11 am, or another off time if you can.<br><br>As others have mentioned, a \"single\" is actually two patties. I got a single with added egg and bacon, both of which were excellent. The bacon is so thick that it's almost like adding another patty -- I would say this was my favorite part of the burger. The actual beef was a tad salty at first but somehow mellowed out as I kept eating. It's a huge burger for a decent price, considering Au Cheval's prestige. I also tried a root beer float, which was really good. <br><br>Overall I would definitely come back, but only at an off time again.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/toFBvuC3OskJENPRbsyf_g/348s.jpg", "caption": "Single burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qKOEr2mN8_78Dt0slhrvAA/168s.jpg", "caption": "Root beer float"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qFxXUhRKosUVNfBMIuqRCg/168s.jpg", "caption": "Single burger with egg and bacon"}]}}, {"review": {"des": "Lived up to the hype. Best burger I've ever had and well worth the $17.50 (single (which is two 4oz patties and two slices of cheese ) + egg + bacon). There's some crazy deep flavors going on. I think from the bacon. The servers and cooks are super nice. I went there (party of one) at 3pm on a Friday and waited maybe 2 min for a spot at the bar, which I recommend, because it's cool seeing how a very famous burger is made. <br><br>I can finally check this off my list!", "pics": null}}, {"review": {"des": "Food is excellent here and in a neat part of Chicago.  Meant to review this month's ago but I still remember how great the hamburgers were here even if it was a while back.  Great location and really cool vibes and ambiance on the inside and I suppose the only real problem here is not enough seating due to its pretty small size.  Would love to come back but doubt I'll be in Chicago again soon.  Service was also excellent and prompt.  Definitely going to have a wait here so don't be surprised about this.", "pics": null}}, {"review": {"des": "Why 5 stars? Because I don't know if it was the best burger I've ever had, but it was definitely 5-stars.<br><br>   ---   ---   ---<br><br>The thing is, when something is hyped up to possibly be the best burger in the country, it makes it really tough to live up to that. Would it make my personal Mount Rushmore of burgers that I've had in my life? I don't think so. But was it a no-doubt-about-it 5-star burger? Absolutely.<br><br>First off, I think the photos of this thing alone make it tough to get it anything other than 5-stars. That bacon is the thickest I've ever seen in my life and the egg makes it even more photogenic. <br><br>I was nervous that there would be a ridiculous wait, so I called ahead. Unfortunately, they don't answer their phone. I'm not sure they even have an actual phone. But luckily, we were visiting at an off-peak time in the middle of a weekday afternoon, so we snagged two seats at the bar as soon as we walked in. Not only that, but the host even asked us if we would prefer a table! So for all the horror stories I read about with wait times, definitely plan your trip to Au Cheval on a Wednesday afternoon!<br><br>In addition to the zero wait time, our burgers came out incredibly quick. The first couple of bites were everything I'd hoped and dreamed of, but have to admit that the more I ate it, the more my opinion kind of normalized from an all-time burger to just a really good one.<br><br>The fries were fine, but definitely not worth the $6.25 price tag. I know it's against most people's religion to not order fries with their burger, but I'd recommend opting for something else.<br><br>I'm glad I got to try such a famous spot while in Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MjR68uOpagy9XQMps2xi1Q/348s.jpg", "caption": "Cheeseburger A Cheval with Thick - Cut Peppered Bacon"}]}}, {"review": {"des": "Excellent burger and service. <br>Definitely worthy as the best burger in Chicago. <br>Pricey. But you probably shouldn't be come here on a daily basis anyways. Unless you can afford it of course. <br>Would recommend anyone to try it at least.", "pics": null}}, {"review": {"des": "Ambiance<br>Au Cheval is a place that one needs to be ready to wait!  We came on a rainy weekend and still had to wait 1.5 hours.  The kitchen closes from 3pm-5pm.  The good thing is there is a waiting queue that I can see on my phone so I know how far I am from getting in.  The bad is there is not a lot to do around there.  This is a very small restaurant that has some bar seating.  This has an old school industrial look and feel.<br><br>Food<br>Be ready to eat some good food.  Overall, I thought the food is good.  I did not have an extreme wow factor.  Price is very reasonable.     <br>1. Foie gras, scrambled eggs with toast - best dish in my opinion.  Toast is crispy and buttery.<br>2. Cheeseburger with bacon and eggs on top - some great extra on top of the burger to make a good burger. <br>3. Fries - the sauce that came with it is pretty good. <br><br>Service<br>The service is fine once we get into the restaurant.  The food came out pretty quickly.", "pics": null}}, {"review": {"des": "Not sure what all the rage is about.  I have attempted to go here a couple of times and the wait for a table has deterred me.<br><br>I met a friend for lunch.  I had to wait to be seated until he arrived which was okay and understandable. This place does fill up quickly during designated meal times.<br><br>Service was good.  Food was nothing really to write home about.  I ordered the single cheesburger with bacon which is really a double.  Pickles accompany the burger.  The burger was decent.  <br><br>Depending on where are you are seated, it may be a little cramped or high traffic.  That just goes with the territory.<br><br>Can't say I am dying to return.<br><br>Bike parking on street.", "pics": null}}, {"review": {"des": "This is the best burger in Chicago hands down.  There is something special about the bacon and the burger and the egg.  It just all coalesces into something magical.  The wait to get a table can be pretty long because people appreciate this.  I would suggest putting your name down and getting a drink elsewhere like soho house or Lena brava.", "pics": null}}, {"review": {"des": "The best burger I've ever eaten. It was certainly worth the long wait, as the flavors were to die for. The patty was perfectly cooked and the egg enhanced the flavor. The ingredients were fresh and with every bite there was a flavor explosion in my mouth. I ordered the fries as well, and they were just okay, and honestly just ordering the burger would be enough unless you're extremely hungry.<br><br>I'd highly recommend the Au Cheval burger with the fried egg and I am looking forward to my next visit!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZiF6HuWVuytfb86Rnc_AZg/348s.jpg", "caption": "Burger with Fried Egg, and Fries with Fried Egg"}]}}]}