{"name": "bavettes-bar-and-boeuf-chicago", "reviews": [{"review": {"des": "Here's what you need to know: this is my favorite restaurant in all of Chicago. Incredible steaks and service, along with the beat BYOB policy ever - share a glass of your wine with a stranger in the restaurant and you don't pay corkage. Order the mixed green and apple salad along with the crab cake and burger with bacon for apps (yes especially the burger since it's the Au cheval burger with pork belly). Order the bone in filet (they have limited quantities and they can run out at the end of a busy night) with a side of mushrooms for dinner and the chocolate cream pie for dessert. Note: Very hard to get reservations on weekends or even regular dinner hours on weekdays. Pro tip, if you're really looking for amazing service, ask to be seated in John's section. He makes your experience better :)<br><br>Every menu item is some of the best I've ever tasted in that category, and the prices are very reasonable for the quality and ambiance. The bone if filet is an absolute triumph. They even have a great bar with remarkable wine and whiskey selections. Although it claims to be French in its style, it's really an unpretentious American steakhouse :)<br><br>I've tried every single item on their menu, and with the exception of the bone marrow (overhyped) and the baked potato (good, not great) absolutely nothing has disappointed me. Even their crab cake (at a non seafood focused steakhouse) is extraordinary. The aged ribeye is their second best steak offering (behind the bone in filet), and either of those could go up against any steak out there (including A5 Wagyu) and give it a run for its money. They offer the authentic Au Cheval burger (rated #1 in the US by critics and diners alike) on their menu with their famous bacon (really, pork belly). The mushrooms are the best side I've ever eaten. The truffle Mac n cheese is super rich but outstanding on its own since the truffle is not overbearing.<br><br>My standard order is the crab cake and apple salad, followed by the bone in filet (even though I'm an aged ribeye guy typically), a side of mushrooms, and end with the chocolate pie. And of course, MOST IMPORTANTLY, bring indulgently extravagant great wine - we always do :)<br><br>Average ticket is just shy of $100/person with liberal ordering and can be a lot less if you share entrees.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dE4bpHoeh-OW8m9DQ-Tusw/348s.jpg", "caption": "Prime Bone In Filet"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/a2HvoqIiatk1myGMOBcMCA/168s.jpg", "caption": "Green beans"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XmKBC86znnOj9QLMRSKLBw/168s.jpg", "caption": "Griddled Burger"}]}}, {"review": {"des": "My boyfriend and I came here with no reservations but they were kind enough to let us show some tables at the back. I didn't mind because I'm so hungry.  <br><br>We came here around 6-7pm and the place was so busy. The ambiance was okay. A little too dark for my taste. The music was okay too. The place downstairs was a bit louder than the ones upstairs so if you want to hear the conversations around your group, better if you reserve seats at the 1st level but their downstairs looks cozy enough. <br><br>Now the food part. The complimentary sourdough bread was warm and huge. I didn't finish the slice I got because it was too heavy for me. We ordered the 22oz Dry Aged bone in Ribeye (medium rare) which comes with bearnaise and steak salt and loaded baked potato as our side. <br><br>The steak was excellent but not the best. STILL, I RECOMMEND TRYING IT. Flavorful, cooked right and tender. I like it more with a touch of their steak salt. The loaded baked potato was indeed LOADED and it was so good. Super soft on the inside and not to filling. <br><br>Over all, I enjoyed eating here. Probably next time I would reserve for a private booth to be more intimate", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4TpOpvOxXvgOi5UmQxbYbw/168s.jpg", "caption": "220z Dry Aged Bone in Ribeye"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KgsSOA3dDzwdoLZhEEayJg/168s.jpg", "caption": "Loaded Baked Potato"}]}}, {"review": {"des": "One of the most intimate restaurants in Chicago. You can't beat the romance that is the atmosphere of this place. <br>I went here with my fiancé for a special occasion and upon making a reservation I requested a secluded booth or table, if available. When we arrived we were lead downstairs and seated in a totally private booth in the corner. It was so dark on the lower level but I absolutely loved that about Bavette's. It was only illuminated by subtle lights and candles.<br>We were immediately given a complimentary glass of champagne to celebrate our date. That was greatly appreciated and a very considerate gesture. <br><br>I know this may sound silly, but... The bread and butter they bring to each table to start your meal was some of the best bread I've ever had. I had to stop myself from getting full on just that. Ugh. SO good.<br>I ordered a special they were having which was a chicken pot pie that rested on top of fluffy mashed potatoes with savory sauce. I grew up eating chicken pot pies and this one exceeded my expectations. If this is available, order it!! The only complaint I have is that it desperately needed salt. My fiancé ordered a steak which he really enjoyed. But I ended up having to use the herbed salt they provided for him on his plate for my pot pie.<br><br>I had my heart set on the chocolate cream pie for months but we were so full after our meal that we couldn't eat anymore. So we ordered it to go and ate it later. It was a-m-a-z-i-n-g. That's a must if you go here. So chocolatey and rich. <br><br>Our service was great and our waiter checked on us regularly. Our food came out pretty quickly as well. I'll definitely be recommending Bavette's to people in the future!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KpWVqaX5FKHSYa2SlhQ1wA/168s.jpg", "caption": "On special chicken pot pie"}]}}, {"review": {"des": "As a vegetarian, this is always my go-to special occasion restaurant to bring meat-eating friends. The steaks (and bacon) are apparently delicious for them and there's an entire vegetarian menu that I can order from. I also love their Champagne Smash even though they always over-ice it. Speaking of drinks, there's a well-known secret that Bavette's waves the corkage fee on your bottle of wine if you share a glass with another table. We were gifted a glass on our most recent visit. They don't do free birthday desserts or anything like that, but will stick a sparkler in whichever item you order. Kind of a cheap move for a classy place (especially when the average bill is over $200), but to each their own!", "pics": null}}, {"review": {"des": "It took me a while to work my way around to Bavette's, but I knew I had to. <br><br>They start with fat slices of sourdough. I liked this. <br><br>I normally don't get salads but the Lyonnaise was great. Pork belly should be a part of every salad. The salad itself is actually very well dressed and is really good (even without pork belly).<br><br>I had the Chicago cut, medium rare of course because I respect the meat. It was juicy and flavorful and good fat distribution. Was already so rich that I didn't need to use any of the bearnaise sauce. <br><br>We had the mushrooms and sweet potatoes as sides. The mushrooms made me feel like I needed to drink a gallon of water since it was pretty salty. The potatoes were great. Thick cut, for the butt.<br><br>Lastly got a slice of lemon meringue to finish the meal. This thing was 2/3 meringue and that was entirely ok with me. It was really light actually and easy to eat which is good because I was full of high quality beouf.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PQvTJXCUAhohDIDhiU9RLw/348s.jpg", "caption": "Chicago cut"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/e7h6uacwPEANekE_bU0yTg/168s.jpg", "caption": "Mushrooms"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KUae1MCIP0fYaiXlgEzdKw/168s.jpg", "caption": "Caesar salad"}]}}, {"review": {"des": "I wish I came here twice, because the steak was THAT good!!!<br><br>This place can be overbooked (for good reason), and be posh - but there is first come first served seating areas that are worth a shot if you can't get a reservation.", "pics": null}}, {"review": {"des": "After many celebrations of special occasions here our last visit will be our last visit. Seems Bavettes is now officially resting on their laurels.<br><br>Evening started out poorly as we were seated 30 minutes after our reservation and shoved downstairs, despite the reservation made 3 months in advance and the special occasions noted on the reserve. We were made to stand cramped at the packed bar and not offered a complimentary drink for our trouble or anything for that matter. This also brings to light that they have no area in which to sit and wait. If you're going to make people wait 30 minutes without taking care of them, don't take reservations. <br><br>Ribeyes were nothing special. Barely an outer crust. And for some reason when we asked for steak sauce, (which every steakhouse in the city has) we were told they didn't have any--like none in the restaurant!  Mashed potatoes were excessively salty. <br><br>Cocktails were crafted well. Bartenders are very professional in terms of crafting. However, if you're going to recommend a particular spirit that will make the drink a $22 cocktail you may want to mention that beforehand as a courtesy so the patron can choose.<br><br>This place used to ooze style and class and this last time waiters and staff looked like they worked at Bennigan's. What happened to the sharp dressed professional waiters in the vests and snazzy ties?  The entire vibe has changed and the service has fallen.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/DbYLtLJsupQ5J4tUfkhlDg/348s.jpg", "caption": "Basement table. Felt like a bar."}]}}, {"review": {"des": "After seeing the reviews and hearing so many good things about Bavette's, I was very excited to finally come here and check it out! My boyfriend and I went for the first time Sunday at 6:30PM for our anniversary.<br><br>The atmosphere is very cute, cozy, and intimate; there's low lighting and music, but the music is quiet enough that you can still converse easily. What a great date spot! <br><br>The staff wished us a happy anniversary and showed us to our table. They offered to take our coats, but I have a tendency to get cold so I kept mine. <br><br>I believe our server's name was Ben? He was great! He gave us a rundown of the menu and we ended up getting the crab cake, the fillet mignon, and the dry aged bone in ribeye. He would float behind us and ask if we needed anything without being overbearing. Loved the service!<br><br>Let me start by saying this is the best crab cake and fillet mignon I've ever had. The crab cake was seared on the outside, and creamy inside. The flavors were rich and just a little tartar sauce topped the whole thing off. A must order! I loved the bread and butter served with the meal as well; the bread had a hard crust and was warm and soft in the middle. <br><br>My fillet also had great flavor and I got it with the roasted garlic - AMAZING! The knife cut it like butter and having it cooked medium rare was perfect for me. The dry age steak had a great flavor as well and was fatty and delicious. Bavette's has pretty generous portions in general so we had a hard time finishing our food. <br><br>Another thing I appreciate is they brought us new plates between dishes and wiped the table of crumbs. I love when restaurants really care about the dining experience of the customer!<br><br>Overall I was very impressed with my experience here. I will definitely be back! :)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_QYfjpo6Ubsbkdm5N1OnWg/348s.jpg", "caption": "The Crab Cake ($21) - the best one I've had!"}]}}, {"review": {"des": "Been wanting to come and try this place out, even on a Tuesday night it was pretty busy and had to wait about twenty minutes but that gave me a chance to check the place out.<br><br>The host was great and very friendly and got us to the waiting area. The place has a very nice vibe to it. I like the exposed brick, hardwood floors, old school leather couches and the traditional steakhouse feel but with a twist, they even played upbeat urban music.<br><br>We had the duck and goat cheese with some delicious jelly like spread for an appetizer. <br><br>We both ordered the 24 oz dry aged bone in rib eye steak which was good, had some kind of glazing on it with a little sweetness to it. <br><br>For sides we tried the buttery mashed potatoes, charred broccoli and the elote corn de creme. <br><br>The waiter did a great job and was attentive to our needs.<br><br>Its downtown so parking is tough but they do have valet parking.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S6LOm8VMEzPwhO56d6KjPg/348s.jpg", "caption": "Bosses day dinner!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZgLFpBwyvDiYWAYYbPdAXg/168s.jpg", "caption": "Butter mashed potatoes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/IIwxL452DljdNA3HGykx9g/168s.jpg", "caption": "Bone in dry aged rib eye steak"}]}}, {"review": {"des": "An amazing steakhouse in the river north area. The food is great, the atmosphere is even better. The service is where we're losing the star. It wasn't the worst service but I set my expectations pretty high when we're spending $600 on a table of four. Our steaks came out before our salad course and we had to send them back, our drinks were empty for over 15 minutes and we struggled to flag anyone down for more. I will have to say the server seemed overwhelmed with his tables. He was going back and forth between the pos and his tables instead of checking on all his tables at once. I think if he were to do that everyone would be getting better service and he could handle the rush better. He was very nice, knowledgeable, and made great recommendations on the plus side. <br><br>As far as the food goes everything was amazing there was nothing I didn't like. Some of the highlights for me were the bone in filet mignon, east coast oysters, Mac and cheese, and to my surprise the mashed potatoes. I really dislike mashed potato's but someone at the table ordered them and they were magical. Oh and don't forget dessert, carrot cake was out of this world.<br><br>The atmosphere is the coolest of any of the steak restaurants in Chicago. It has a speakeasy vibe with dim lighting. We sat in the basement level which I loved! I felt as if I teleported to Paris for dinner. Amazing job with the interior I could sit down there for days. <br><br>I can't wait to come back and eat here again. I'm already booking my next reservation. Hopefully they can work on making the service top notch and this will be a 10 star restaurant in my book!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bVHHN-D4EtxiqAmS_hssYQ/168s.jpg", "caption": "Carrot cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7isLxdUtp3s4QO2Ll9EVtg/168s.jpg", "caption": "Pomme Frites"}]}}, {"review": {"des": "Commence food coma. After arriving in Chicago to spend a weekend with a friend, I was treated to a meal at Bavette's. The meal was remarkably good. Upon entering Bavette's you'll see that the restaurant feels exactly like what it claims to be, an upscale steakhouse. It's dark and warm, and the lower level (where we dined), was even cozier. The drink prices were on par for upscale Chicago, and it would be easy to rack up a large tab if your crew is drinking with dinner. <br><br>We started off with the baked goat cheese. Goat cheese is my favorite of the cheeses and this was nothing short of incredible. Red sauce is poured over the goat cheese and garlic toast is provided to spread it on. I would have preferred a different type of bread to spread the cheese over, but the appetizer was still remarkable.<br><br>For dinner, I had the crab cake and dabbled in the truffle macaroni and cheese as well as the mashed potatoes. The mashed potatoes were delightful with lots of garlic flavor (but not too much!). The macaroni and cheese was not my favorite, but still strong fare. The crab cake... yeah, I devoured that thing. The remoulade served with the cake seems hardly necessary as the crab cake alone is filled with so much flavor. I had to take a few bites without it just to appreciate the crab and really take in all the flavor.<br><br>Lastly, we didn't leave without having a slice of the chocolate cream pie. I was stuffed, so I only took a couple bites, but the flavors were very rich and it was the perfect cap to a delicious meal. I would definitely recommend splitting dessert if you're as full as I was after the entrees. Bavette's is delicious and I have no doubt that their steaks are top notch. I would highly recommend this place for a great upscale experience.", "pics": null}}, {"review": {"des": "Bavette's, what can I say! You are a delight every time I come! Gain 5lbs and don't get any richer but leave happy!<br><br>We had their steak frites ($39), chicago cut ribeye ($59), crab cakes ($21) and truffle mac and cheese ($14). <br><br>The steaks were super tender and very moist. Flavor was incredible. Their fries on the side... gotta tell you. Never knew that such cheap food could be made so well! Crab cakes are so moist, tender, and with generous amount of crab. The truffle mac was so cheesy and delicious.<br><br>We had carrot cake ($14) to end the meal. Lord. I was soooooo full but I had to taste it. I regretted my life for stuffing myself before it. So moist, decadent. Omg.", "pics": null}}, {"review": {"des": "I don't know how this experience could've been any better! My uncle recommended this place, and I came with two friends on a Tuesday night. There was a short wait, but we were able to hangout at the bar and grab a couple cocktails. <br><br>We ordered enough food to put all three of us in a food coma. I had the Classic Chicago Cut Rib Eye. It was perfectly cooked to medium rare and it just melted in my mouth. For sides, we had Truffle Mac and Cheese, Elote Style Corn, Charred Broccoli, Thick Cut Bacon, anddddd a dozen oysters. <br><br>I'd recommend the Bacon and Truffle Mac, but only if you're ready and willing to gain a couple pounds and clog up a couple arteries. <br><br>The service was also amazing. Got everything we needed, and our waiter even helped me make a fantasy football draft pick while we were going to chow town. <br><br>Food was amazing, drinks were on point, and the service was awesome. It's definitely not cheap, but sometimes you gotta shell it out for the best.", "pics": null}}, {"review": {"des": "Make reservations in advance....like at least a few weeks, okay? If you're having a celebration, let them know so your table can receive a pretty sparkler dessert; very photo worthy!<br><br>I came here with my family and boyfriend while my parents were in town. It's great for that since it's an iconic steakhouse. If you don't already know where it is, you might pass it! It's between Kinzie Chophouse and Gilt Bar.<br><br>Service is fantastic. Menu is pretty diverse, even if you don't like steak. Hot chicken, anyone? Each couple split their popular 42 day aged ribeye which was delicious. I say that it's flaky, but I mean that in the very best way. It was so tender and tasty. Appetizer: goat cheese with marinara and some Parmesan maybe? Served with Texas toast. Really enjoyed that. Sides: creamed spinach (not my pick but it was good), candied sweet potatoes (yum), and TRUFFLE MAC AND CHEESE. I'd go back and just eat a bowl of this. Holy cannoli, so so good. Sides are easily shared between 2 people. The sourdough bread is something like mom would make in a bread maker at home. It came out so warm and fluffy. Salted butter melted right over it. <br><br>Don't be like me and say you're too full for chocolate cream pie. Be like my dad that ordered it and shared. It was incredible. Such a great dinner experience! <br><br>Notes: they allow you to BYOB as long as you share a glass with another table! No corking fee past that. Also, boyfriend ordered the bone marrow and loved it!", "pics": null}}, {"review": {"des": "My daughter took me here for my 75th birthday celebration. I had their signature  22oz  41 day dry aged prime ribeye steak. Joking with the waitress, I asked only for a butter knife to cut it. If you had dry aged steak you'll know  what I mean. <br>Needless to say a good portion came home with me.", "pics": null}}, {"review": {"des": "Not sure if I've ever given a 5 star rating before but this place is definitely worthy!  I made reservations way in advance of an upcoming business trip and after bar & restaurant hopping my way around Chicago this is hands down the best.  I love the dark, laid-back speak easy feel (we walked right past it expecting some huge well lit sign).  Service was impeccable, cocktails are on point and I probably could have left happy just eating the warm bread that they serve.  I had a half wedge salad and the GF had the half Lyonnaise.  I had instant envy of the bacon on hers, even though mine came with a half slice.  We both ordered ribeyes (classic for her, dry-aged for me) and the ridiculously good buttery, garlicky mashed potatoes.  To go with dinner we both ordered old fashioneds and this was probably the first time a great cocktail went ignored (if only for a little bit) in favor of the food.  If I could<br>I would take back every big name steakhouse meal (looking at you Morton's) and go here instead.  I'd come back to Chicago just to eat here again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Zj_bddgb5iL3RxGTVQ1agA/348s.jpg", "caption": "1/2 order Lyonnaise salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PuSjIlUxfQLW9dpqSWDN5w/168s.jpg", "caption": "Buttery Mashed"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zAAJ0BiuXM7WJUfyD9FjFw/168s.jpg", "caption": "1/2 order Wedge"}]}}, {"review": {"des": "Consistently good.<br>Not good.<br>Really GOOD!<br>Way to go guys.<br>Good quality food. Great service. Lovely ambiance.<br>Last night I invited 6 out of town guests. Delicious food. EVERYTHING! Great services by Julio. Our food collector champ, Carlos was fabulous.<br><br>Thanks y'all....", "pics": null}}, {"review": {"des": "Yessss! One of my favorite steak and seafood restaurants in the city!! I always come here for a special occasion and when out of towners are in. My favorites are the ribeye and bone marrow! And the chocolate cream pie is a must!! I'm actually not a big fan of chocolate desserts but it's not too sweet and has just the right amount of chocolate. Ugh, I would go back just for the dessert.", "pics": null}}, {"review": {"des": "Experiencing this restaurant was a 5-star treat! The ambiance is smooth and seductive! This review has to have a part 2. I need to experience a basement reservation and a petite filet mignon! They also have off the menu options. <br><br>The servers are well informed from offering drink recommendations to their opinion about what will satisfy for pallet. We enjoyed the salmon and fried chicken! Not the best I've ever had, yet I enjoyed every tender bite! The melas were cooked to perfection. I can't wait to go back!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/e9QFuwTSyD2vF_bPTIkP1w/168s.jpg", "caption": "Pineapple rum martini"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/P7-GyadypBPBOd13-UjM8Q/168s.jpg", "caption": "Salmon and fried chicken"}]}}, {"review": {"des": "This a perfect place for a date night or an intimate dinner with friends. The ambience is hipster cool with a little bit of old school classic steakhouse. The portions are extremely generous so keep that in mind when ordering. The truffle mac and cheese was awesome. We both had a tender well cooked filet mignon and ended dinner with an epic slice of lemon meringue. The meringue was mile high and the lemon portion had the texture of a key lime custard base. My advice is to wear stretchy pants when you go.", "pics": null}}, {"review": {"des": "Awesome restaurant. Cool decor and really good service. We didn't make reservations but the restaurant was more than accommodating. Told us a wait time, but fulfilled it in under the time given.<br><br>Mixed Greens & Apple Salad - very light but pretty flavorful. It was a nice mixture of salty, sweet, and sour. Loved the explosion of flavors in my mouth. The apples are sliced extremely thin so it blended right in and made the salad a lot easier to eat (instead of biting huge chunks of apples). <br><br>Baked crab cake - very little filler. The sauce that came with it was really good.<br><br>Shortrib stragonoff - This was a tad on the miss side for me. I felt it was a tad too sweet. The meat was tender though, but hard to eat because of the overpowering sauce.<br><br>Bone in filet with an add on bone marrow - steak was PERFECT! Cooked just right and so tender. The steak was seasoned perfectly and did not need any additional sauces. The bone marrow was also pretty good and I'm not the type to eat this. My wife killed it and only gave me a small bite.<br><br>Elote style corn - it was good at first but I felt it got too heavy after having more than about 2 bites.<br><br>Overall: If you're in the city, definitely give this place a go.", "pics": null}}, {"review": {"des": "Celebrating something? This is where you want to be! It is a classic (dark + romantic) french style restaurant.  Steaks were cooked perfectly and the fries made an amazing side option, but GET THE BRUSSEL SPROUTS too! So good! Finish your evening with a sparkly celebratory dessert. Thank you Bavette's for making our anniversary trip so special!", "pics": null}}, {"review": {"des": "Our meal at Bavette's Bar & Boeuf was pretty much perfect in every aspect. <br><br>The ambiance is cozy and clubby--a romantic and contemporary take on a dark bistro with smoky mirrors and leather booths. The jazz soundtrack was loud enough to hear but not so loud as to interfere with conversation, and the music selection was a perfect complement to the environment and decor. The place welcomed patrons spanning many decades from 20s to 70s. The attire is comfortable and stylish on the dressy side. <br><br>Service was terrific. Julio was attentive, helpful and didn't miss a beat.<br><br>Drinks were terrific. The Old Overholt Old Fashioned was delicious, and the dirty martini was tasty with fresh blue-cheese-stuffed olives. <br><br>The salads are enormous--more than enough to share. Both the wedge and mixed green & apple salads were easily enough for two or three guests. <br><br>The food was well timed.  The wait for dinner following the salads was not too brief nor too long. <br><br>Everyone was very happy or ecstatic with their meals. The two people who ordered filet raved--terrific cuts, brilliantly prepared. With the maître d' butter, it was sinfully rich and tasty.  My wife was very happy with the salmon, although the preparation was a little sweet for her taste. The buttery mashed potatoes were a delight, made with chicken jus and garlic.<br><br>For dessert, we split a carrot cake, which was very tasty, but the highlight of dessert was the Zarlengo's salted caramel ice cream, which exploded with taste in our mouths. <br><br>From beginning to end, the experience was just about flawless. Bavette's Bar & Boeuf is worth the price, which didn't seem outlandish for the quality of food and service. We escaped for under $100 per person (including tip) with one drink apiece, salads, entrees, and a side and two desserts split between three people. <br><br>This restaurant rocketed to the top of my list in Chicago, and apparently, others agree--on a Wednesday night the place was packed from 6 until 8:30 pm when we left.", "pics": null}}, {"review": {"des": "Visited on Sunday, Nov. 25.<br>To celebrate my birthday and girlfriends.<br>The Filet Mignon was the most delicious thing I have ever eaten. Every bite I took was heaven. I highly recommend it.<br>The food was great, the service was great, and the ambiance was romantic. Well worth the price.", "pics": null}}, {"review": {"des": "This is the type of establishment where you wish you had a secondary stomach. The bread was so dang good. You know it's going to be a good dinner when the bread is good. The sourdough bread was perfectly crusty on the outside and fluffy on the inside. <br><br>We started with the roasted bone marrow and OMG, freakin' good! Especially when you pair the bone marrow with the bread and caramelized red onion jam. I am still thinking about how delicious it was.<br><br>We also ordered the truffle Mac and cheese and shortrib stroganoff (the boyfriend insists you have to order the shortrib stroganoff). Both dishes were perfectly cooked with the right amount of flavor. I want more. I wish they delivered. <br><br>My boyfriend and I shared the 42 day dry aged bone in ribeye (22 oz) and lemme tell ya. I'm not a big steak person, but this was amazing! It was perfectly cooked medium rare and it tasted sooooo good. <br><br>It is highly recommended to make reservations in advance. If you can't make it online then call the restaurant. However, we got lucky and kept checking the online reservation site \"reserve\" and was able to get a 7:30pm slot two days prior.", "pics": null}}, {"review": {"des": "Abstract: Mediocre food, no real hip spin on the steak or sides, and not worth the price. You'd be better off going to an actual Americana steakhouse (words I thought I'd never say). Interior looks like a bachelor set, it's dimly lit, loud and honestly quite dingy. The service is actually garbage. <br><br>Extended version: I took my dad here since he is in town and wanted steak. Our waiter was rude and condescending as well as touchy feely (an oddly bizarre combination). The food was honestly just traditional American that was trying to masquerade as a \"modern\" or perhaps slightly hipster spun but failed on all counts. I found it uninspiring and mediocre. We ordered the weird pizza dip (called baked chèvre or some variety or herbal goat cheese on the menu), the (42 day?) aged ribeye, oysters, crab cakes, mushrooms, baked potato, and drinks. Totaled 250 and I would say totally forgettable. I'm not a steakhouse person but I'm pretty sure I would have a less mediocre time at Outback than this place.", "pics": null}}, {"review": {"des": "Definitely a favorite steakhouse in Chicago, with the rich traditional feel and decadent steaks.  This place has been on my must-try list for over a year, but the long waitlist for tables and an unpredictable work schedule have made it nearly impossible.  My husband and I wondered in early on a weekday evening and snagged a spot at the bar which has full menu service.  It was fantastic!  Service was 5-star and steak quality was exceptional.", "pics": null}}, {"review": {"des": "One of the best steakhouses in Chicago..great ambience and a variety of cocktails to chose from. They a great wine list too. Recommended to have a reservation.", "pics": null}}, {"review": {"des": "Excellent food and service. They handle food allergies well and were very knowledgeable about the menu. Only complaint is that it's a little too dark but otherwise a fantastic place!", "pics": null}}, {"review": {"des": "We had a very nice birthday dinner here - seating in the lower level is more intimate and the plush booths are nice. BYOB and share a glass with another table was a cool touch as the table we shared with was celebrating a birthday as well. <br><br>Dry aged ribeye was excellent as expected. Cooked perfect medium rare. Tenderloin steak tartare was great, but would have preferred pairing with chips than bread (our waitress told us that was an option after we finished the meal). Loved the Baked Crab Cake, crispy outside, juicy inside. Could have done without the short rib stroganoff (a little too salty and oily) and oysters. Peach sorbet was a refreshing finisher and a sparkler is always fun.<br><br>Would recommend for any special occasion! Check reservations well in advance to pick your time, but also check day of a couple times for any cancellations. I was able to snag a 5:30PM on day of!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PNL1c518u53bH4nDv_OJCg/348s.jpg", "caption": "Peach sorbet with birthday sparkler!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/rbbB1SvwF2bs0vjvEP9AYA/168s.jpg", "caption": "Oysters half east/ half west coast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xzlAMmpC9UtOC5l5rv2n9g/168s.jpg", "caption": "Tenderloin Steak Tartare"}]}}, {"review": {"des": "I loved this place. I came after I was told the wait for Au Cheval was 1.5 hours for a person dining alone.<br><br>Ended up at the bar at Bavette's with no wait. Ordered the garlic shrimp, roasted bone marrow, tokyo old fashioned, and a red wine recommended by the bartender.<br><br>Loved everything. I got the garlic shrimp first and I think it came with a lot of bread so I got full pretty quickly. Was a bit too full starting the bone marrow, which also came with more bread. The tokyo old fashioned was recommended to me by a friend so I tried it; I thought it was pretty great considering I don't like old fashioned's. Since I'm really a wine or vodka drinker, I got a great red wine recommendation by the bartender.", "pics": null}}, {"review": {"des": "We had a simply wonderful dining experience at Bavette's! We were a group of seven from Brooklyn, DC, and MA, in Chicago to celebrate a 60th birthday. Meredith was our server and she couldn't have been more perfect, completely professional and fun at the same time!<br>We started with cocktails (delicious) and a seafood tower that was superb!!!! Oysters, King Crab, shrimp, lobster.... I'm craving it again!<br>Meredith was very helpful with our entree order- we decided on sharing three steaks and an assortment of sides. They were all perfectly cooked and absolutely delicious.<br>It was just the right amount of food too, leaving us with just enough room for a few desserts and after-dinner drinks. Because Meredith didn't know enough about the scotches to be able to help us, she sent someone who could. <br>Overall, an A+ dining experience!!", "pics": null}}, {"review": {"des": "Oh hello chocolate cream pie...where have you been my whole life?!?! And I don't even love chocolate! <br><br>This place is so great. No wonder reservations are so tough to get...<br><br>The good: <br>-not too loud<br>-THE BREAD AND BUTTER. Best sourdough bread I've ever had<br>-shrimp dejongue (sp?) appetizer (tip: skip the texas toast and dip the sourdough bread in the sauce instead)<br>-dry aged ribeye - so much flavor with every bite<br>-truffle mac and cheese<br>-brussel sprouts<br>-mashed potatoes (the best I've ever had - and are even tastier as leftovers)<br>-chocolate cream pie<br><br>The not as good:<br>-i didn't like the fried chicken at all. Found it to be bland. And it wasn't chicken breast, which I particularly like. People on here have said they really liked it, but I don't get the appeal. Now the mashed potatoes that come with it are AMAZING. <br>-dark - what is it with all these Chicago places being so dark?!?<br>-service wasn't very good towards the end of the meal", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sYTWsHfilnFTMjxyf0Q0aQ/348s.jpg", "caption": "Truffle Mac and cheese and Brussels sprouts"}]}}, {"review": {"des": "Finally came to Bavette's for our annual try a new steakhouse tradition and remembering to make reservations asap. It was around 8pm Friday and we were seated in 5-10 minutes. In that time, we waited by the packed bar. There was a layer of people in front of us, but the bartender was good and spotted us right away asking if we wanted menus. Boo got the cognac old fashioned and it was fantastic. Shortly after getting the drink and paying, we were seated at a nice booth in the front.<br><br>I got the petit filet, he got the traditional filet and we shared the truffle mac and the broccoli. Our server was good at explaining the menu as it was our first time here and she regularly stopped by. However, when my boo ordered a beer to have it come out with the steaks, she brought it out about 15-20 minutes earlier. Granted she did not anticipate the food taking longer than expected and apologized, but she could have definitely checked with the kitchen and figured that out better? For this type of lauded establishment, I will nitpick, so my only other gripe is with the broccoli. While perfectly cooked as it was tender but not so much so, a part of the stem was not trimmed properly, so there was that 'strawy-ness.'<br><br>To the really good stuff - yes that massive sourdough bread and the fresh butter. Steaks were cooked perfectly and well seasoned - the extra salt is not needed. That truffle mac is also perfection, along with the chocolate cream pie. <br><br>I also do very much like the vibe - obviously it is a nice place, but it's got that warm casual feel to it.<br><br>Overall, I will gladly come back as the food speaks for itself, despite some minor issues.", "pics": null}}, {"review": {"des": "All the hype about this place is true. The best restaurant in Chicago hands down. It is more on the expensive side, but well worth it for celebrating special occasions. It is super difficult to make reservations so definitely make them months in advance for a decent time. You'll probably still get a late night reservation around 8PM even if you try to reserve in advance. <br><br>I've had the spiced fried chicken, dry aged ribeye, lamb chops, garlic shrimp de jonghe, Brussels sprouts, truffle mac and cheese, and the wild mushrooms. All of them were delicious and I'd order them over and over again. You can't really go wrong with anything here but the best item on the menu is the dry aged ribeye cooked medium rare. <br><br>The service is the best. Servers come by often but not too often that it's annoying. I feel like I'm taken on a time machine to the 20s when I visit because of all the servers dressed in flapper attire and the dim lights.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ffYO0dh7sR_04l_aFbgUEw/348s.jpg", "caption": "All things great in life"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2GwjfECApe6Ij0V_3tsNmQ/168s.jpg", "caption": "Spicy Buttermilk Fried Chicken"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mbkPo_EQGO6cUXIaMzClVA/168s.jpg", "caption": "Prime Bone In Dry Aged Ribeye"}]}}, {"review": {"des": "One meal here and it instantly earns a spot in the ranks for my favorite Chicago steakhouse! And based on how far in advance, I made my dinner reservations, it would appear to be on several other people's radars, as well!<br><br>My husband started off with the Tokyo® Old Fashioned, which is actually trade-marked! He raved on and on about how it was his favorite cocktail he's ever had in his entire life and how life-changing this cocktail was... seriously, it was a little much, but he loved it!<br><br>For appetizers, we started off with the Peppered Duck & Goat Cheese Terrine, which I thought was life-changing. A year or two ago, I would have never ordered anything remotely close to this, but I put my trust in our server, Erik, and couldn't be more glad I did! It was creamy, rich, cheese-y and altogether freaking marvelous! <br><br>We also started off with the Thick-Cut Bacon, which you can't go wrong with. Bacon with Maple Glaze is like brunch for dinner and I LOVE BRUNCH. <br><br>For a main-course, I ordered the Traditional Filet Mignon (med-rare, duh) with Wild Mushroom enhancements. Steak was perfectly cooked, tender, juicy & amazing by itself, but then add in a few bites with Bernaise sauce & the earthy mushrooms and you have yourself something to write home about!<br><br>Hint:  ANYTIME you see TRUFFLE MAC & CHEESE on a menu, YOU ORDER IT, because it's Mac & Cheese, but with TRUFFLE! Got it? <br><br>Our night was made extra special because our service was stellar, thanks to Erik and Juan!<br><br>I'll be back for that Tokyo, Terrine, Steak, Mac & Cheese.... ok everything!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9dhp6saeoJ-bLgtKuCQ8Zg/348s.jpg", "caption": "Chocolate Cream Pie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NPbyUL74o2U-ol5IjHV7Aw/168s.jpg", "caption": "Truffle Mac & Cheese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nqjr3_VvhTuK82Bw3tM48Q/168s.jpg", "caption": "Traditional Filet Mignon with Wild Mushroom enhancements"}]}}, {"review": {"des": "Really liked the atmosphere of this place. Felt I mov e back in time to the 50s or 60s. The food was really good as well!<br><br>I would highly recommend the baked crab cake and the New York strip steak. Both were delicious. We also ordered the fried chicken which was good but nothing special. Finally went for the chocolate cream pie. Again good but nothing special, maybe the royal sundae would have been a better choice.<br><br>Overall great place for an intimate occasion.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1juBDu9ya_w2XuR4UI7VTg/348s.jpg", "caption": "Fried chicken"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-m65l0RMor-qL27A1bP7pg/168s.jpg", "caption": "Dry aged New York strip"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3k4r7Nt15oZ6wyan3dYCIQ/168s.jpg", "caption": "Chocolate pie"}]}}, {"review": {"des": "What a fine restaurant! The wedge salad is the best I have ever had! The bacon on it is out of this world! Then the filet mignon and mac and cheese were top notch! Their old fashioned is also very good and they can make it with any kind of whiskey you'd like. I will be coming back when in Chicago!", "pics": null}}, {"review": {"des": "Very interesting interior design/style. It reminded me of retro prohibition. Be prepared once you walk in. The place is dark! It'll take your eyes a bit to adjust. <br><br>On this food journey...<br><br>Seafood tower = amazing<br>Bone marrow appetizer = amazing animal butter<br>Bacon appetizer = a little amazing <br>Bone in ribeye = a little amazing. A bit under seasoned but well cooked. <br><br>Sides <br>Fries = meh<br>Brussel sprouts = good<br>Elote style corn = excellent<br>Truffle Mac and cheese = slap ya momma good. Crazy good. <br><br>Desserts <br>Carrot cake = deelish<br>Lemon meringue = deelish<br>Chocolate mouse pie = slap momma again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ts1PX-xsuTmzfkB_dGN0Ug/348s.jpg", "caption": "Seafood tower cue in the heavenly aaaaaaaaah!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FAW7cqSM4mqNOFPCjomPVA/168s.jpg", "caption": "The chill bar where the seafood towers are prepared."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Dkg4cLA0mZx3jKHGlVJ4Sg/168s.jpg", "caption": "Desserts! Go shawty it's ya Birfday!"}]}}, {"review": {"des": "If there's an award for Chicago's sexiest steakhouse, Bavette's would be the hands-down winner.  This place is dark, almost clandestine, and oozes old Paris, with shadows, bricks, beams, leather and smoky mirrors, moody gaslight lamps, and vintage French jazz music in the background, like Edith Piaf is going to make an appearance at any time.  People speak in hushed tones and avoid eye contact.  This is the place to bring your lover, or as it was on this night, my wife and son!<br><br>This is also the place to get a classic cocktail, some nice wine, perhaps some fresh shellfish, and a great steak.  And that's just what we did.", "pics": null}}, {"review": {"des": "Bavettes is excellent!<br>Garlic Shrimp Appetizer- it's a must order<br>Crabcake - very good<br>Filet - perfectly cooked <br>Aged Ribeye - amazing<br>Baked potato w/bacon - amazing<br>Mac n  cheese - pretty good<br>Chocolate Creme Pie - speechless<br><br>Above the food, the service from start to finish is remarkable. So much so, I asked for the manager to recognize the great service. Julio is exceptional at his job!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vSkIb4DQYasOK84rX1UCRA/348s.jpg", "caption": "Crab Cake"}]}}, {"review": {"des": "I chose Bavette's for my birthday dinner and I was so glad I did. Everything was perfect. The atmosphere, the service, and of course the food! <br><br>We shared the wedge salad which is seriously enough for 2 people, and it was the best wedge salad I have ever tasted! It was just the right amount of cheese and dressing. Our steaks were cooked to perfection. They were well seasoned and since I order my steaks medium/rare, they are still often overcooked, but that wasn't the case for this steak. <br><br>Our meal ended with the chocolate dessert which was phenomenal. <br><br>The ambiance of the restaurant was an old Gatsby feel. The service was top notch and our server was very attentive and friendly.", "pics": null}}, {"review": {"des": "Came here for an anniversary dinner and the service and food was basically as good as it gets. The location is relatively close to one of the metro stops (in case you are using a metro pass) but the restaurant is very dark in the front and you could easily pass by it.<br><br>The host was extremely friendly and seated us almost immediately for our reservation. The location was packed for a Friday night and SUPER dim. I questioned how one could even see the food in such an environment, but it looked like everyone was really enjoying themselves.<br><br>For appetizer, we ordered the roasted bone marrow which included 5 bones for ~$19. The bone marrows were delicious and came with several slices of bread to pair with the delicious beef butter. For the entree, we decided to split a dry aged rib eye cooked to a medium rare for $70. It was my first time trying a dry aged steak and I was definitely not disappointed! The dry aged-ness of the steak makes it taste kind of funky yet the steak has a great amount of flavor in each bite. Overall, really impressed by the taste, and also decided to add some roasted garlic (+$4) to add some more flavor. I wouldn't recommend getting an additional marrow for the steak ($8) because it is only one bone, it's better to just go for the actual marrow platter itself to get more bang for your buck.<br><br>Overall, the service was attentive, the ambiance is loud yet it allows you to keep to your own table, and the presentation and food quality makes this a true fine dining establishment. Would definitely come back again whenever I get the chance!", "pics": null}}, {"review": {"des": "My mom and I stopped in her to celebrate my graduation and we booked our reservation about 3 months in advance! I was very excited to try this place out based on all of the articles and yelp reviews that were left here. I was NOT disappointed!<br><br>The atmosphere is a throwback to a poorly lit 30's-40's style bar and high scale restaurant with large plush booths, overstocked bar, solid wood bar too, and couches in the waiting area. After a small wait, we were escorted to our table downstairs and were given some time to check out the menu. Our waiter was very attentive and provided us with answers to any and all questions we had. I'm a big bourbon guy so the Old Fashion is what I ordered to start off, it was fantastic and definitely on par with some of the best in the city. <br><br>Our appetizer was a shrimp and bread dish (I'm blanking on the name) that was very flavorful and was an excellent starter to a much larger meal. I ordered the dry-age NY Strip cooked Medium-rare and it came out perfectly cooked with our accompanying sides of fries and Mac and cheese.<br><br>Multiple rounds of drinks later we ended with a dessert on the house for the special occasion we were celebrating. By far one of the best dining experiences I've had in Chicago and I've already booked another reservation for when I'm back in town again.", "pics": null}}, {"review": {"des": "We loved, loved this steak place.  <br><br>Seating was upstairs and downstairs which where we wanted to sit.  Although we made reservations we still waited which was not a problem as we were told, it is not easy to get into this place.  And we saw why.<br><br>The food and the service were just first class. You will enjoy this place.<br><br>Let's start with the beef,  we ordered the bone n ribeye, OMG it melts in your mouth.  Most delicious and tasty steaks in comparison to other spots we visited around the country.<br><br>For appetizers, we had the baked goat cheese, so so good.<br><br>wine and cocktails were amazing.<br><br>5 stars all the way!", "pics": null}}, {"review": {"des": "Not your classic steakhouse but a really unique experience. Gets crowded but bar seating is first come. <br><br>In terms of the food the must try is the shrimp de jonge. Just get it and you won't be disappointed.", "pics": null}}, {"review": {"des": "Hands down... Bavette's is one of THE BEST restaurant for date night. The lighting is just enough -- not so dark that you couldn't see anything at all, and it's dim enough that you can feel the romantic atmosphere everywhere. Plus the background music choice is amazing. The jazz music gives just  the right vibe. You can choose this for your special celebration as well. I think the table next to us is celebrating birthday. And the waiter presents them with an ice cream with a firecracker on top. You can clearly see the smile on their face. <br><br>Now back to the food...<br><br>The bread is amazing!!! It's actually the best sourdough I've ever found in Chicago. The crust is crispy but not hard. And the bread itself is a perfect balance between chewy and moist. I even ask our waiter tonight to help me pack some bread home. Our waiter is just so nice hahahah. <br><br>We start our night by sharing the crab cake. It's easily my favorite dish tonight. You can seriously taste the REAL crab meat in it. And the sauce pairs perfectly with the crab cake. Too bad there's only one piece lol. <br><br>Moving on to the entree, supposedly the highlight of the night, but my most disappointed part as well. I order petite fillet mignon, cooked to be medium rare. And my boyfriend asks for ribeye cooked to be medium well. The first thing I notice is that the plate is NOT HOT... at most Luke-warm, which is defiant something I expect to see at a restaurant of this price range. And then the steak... I don't even know where to begin. Even under the dim light, I can tell that my steak is over-cooked, resulting in a nearly rubbery taste. And the steak is really blaaaaaaaaaaand. Yes, they do offer steak seasoning, but I thought they would add salt when cooking the steak.<br><br>Putting the steak aside, the peach sorbet is a great finish for the night. It's so perfectly smooth that I couldn't even believe it's not ice cream. And it's not overly sweet, I can really taste the peach flavor, which is a huge plus for the dessert!<br><br>Oh and don't forget the drink menu. I try the Pago Pago, which has rum as base, and mixes with pineapple and green chartreuse. It's the first time I've ever tried this. And I'll definitely order this every time I see it on the menu from now on. <br><br>In one word, if not for the steak, I'll give the restaurant 7 stars for its atmosphere, the bread, the appetizer, and the dessert. BHT (-2) stars for the steak. As a steakhouse, I wish they could at least do the steak a justice.", "pics": null}}, {"review": {"des": "I confess, I have a secret love affair with this beautiful restaurant! Its been 4-years & still going strong! Shhhh... It's cozy, it's swanky, it's loaded with the kind of energy that lures you in and begs you to stay! A true must-go experience.<br><br>Upon entry, you will be promptly greeted by the host and invited to check in your coats. As you step into the foyer there's a vintage red velvet couch, dimly lit ambiance, exposed brick walls, and an elaborately decorated extensive bar with some of the most personable and professional bartenders I've met in all of River North! I'd highly recommend trying a signature pickle-back (I know it sounds odd  but if you like pickles, this is quite a zing!).<br><br>For my fellow foodie friends, yes even though the steaks are unbelievably mouthwatering good, I do encourage you to look past the obvious drooling options on the menu and try the beef stroganoff (I literally crave this dish & it never fails to satisfy) paired with a full bodied red and order generously on the side dishes (most meals come a la carte). <br><br>Expect your water & wine glasses will never see empty, your linen napkins will be replaced should you get up from the table, and crumbs swept away between servings. It's this level of attentiveness that makes you feel like a pampered patron & who doesn't want that right?<br><br>I will say, reservations are highly recommended and almost necessary because it's always busy (I use OpenTable) and justifiably so! Most guests dress up a notch or are coming directly from work and tend to be a more established professional crowd. Pricing is on par with all other steakhouses in the city but IMO offers one of the highest quality dining experiences without the pretense or snobbery. <br><br>Pictures in this case will lure you here but they cannot replace the in person experience! Just go, you won't regret one bite of all the goodness! Bavette's may just become your obsession too:)<br><br>One other point worth mention: After dinner, go downstairs - it's a speakeasy with all the sultry Vibes! Perfect for a sinful dessert or nightcap.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nJhExGx8de2HZAB8r0rUgw/348s.jpg", "caption": "Beef Tartare the way it was always meant to be paired... with egg yolk and aioli sauce! Yes this is real life:))"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/a55QTYiy6l6BlvBSr746-A/168s.jpg", "caption": "Twice baked sweet potato side dish $12 but oh my goodness it's worth it!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/X1DBPn0eESyOIvF50_d0eQ/168s.jpg", "caption": "Honey glazed Salmon"}]}}, {"review": {"des": "Amazing experience! I was visiting Chicago for a weekend and decided to make a reservation here even though a location just opened up in my hometown of Las Vegas. We started out by waiting at the bar for a martini which was made perfectly!! As we were having a drink the hostess came and found us to seat us to our table. Our waitress was extremely friendly and very helpful in making our perfect menu choices. <br>My husband and I started with the fantastic seafood tower for $125 which could have been good for an entire meal or a great appetizer for 4-5 people. We then had the thick cut bacon and tomato salad which was so tasty along with the bone in rib eye steak. Everything was superb and the service made it an even better experience. The thick sliced bread was also delicious. I hope the one in Vegas has this type of service along with the delicious food. I highly recommend Bavette's.", "pics": null}}, {"review": {"des": "Speakeasy meets steakhouse at Bavette's -- the kind of place where I'd love to become a regular. Cozy and dim lit but with elegant decor.<br><br>Walked in at 7pm on a Friday and lucked out snagging a table at the bar. (Although I wouldn't count on this, as the bar became very busy a few minutes after we sat). <br><br>Service was outstanding. Enjoyed a classic old fashioned and took advantage of their generous BYO policy.<br><br>Food -- steak frites are a steal for less than $40 for 10oz of ribeye and a huge cone of fries. The duck and goat cheese terrine and smoked salmon Caesar salad were also standouts.", "pics": null}}, {"review": {"des": "This restaurant had a really great atmosphere and incredibly friendly staff. The cocktails were tasty, I had the lillet rose martini. I truly recommend that you try it if you dine here.<br><br>My boyfriend chose the typical steak, but I personally wasn't in a red meat mood. I've become somewhat of a fried chicken connoisseur, and I this was some of the best I've had in awhile. Not to mention the mashed potatoes were perfectly fluffy.", "pics": null}}, {"review": {"des": "My siblings and I went for dinner after my sister strongly recommended it as one of her favorite steak houses. As soon as you walk in, you're surrounded with dark wooden walls, chandeliers and big leather chairs. We had reservations for 830 pm but we got there at 730 pm thinking we'd wait but we were seated immediately. Staff was nice, attentive to us and to the tiny details of our needs and they made excellent recommendations. <br><br>We started with the Roasted Bone Marrow to share and I've never had bone Marrow like that before. We spread it on the bread like butter and topped with the caramelized onions and parsley leaves. The combination just felt like pure decadence! You taste the creaminess of the bone marrow absorbing onto the bread and the onions add a hint of sweetness that just made the combination work. I wasn't sure if the parsley was just there for garnish but that helped balance the richness of the bone marrow. <br><br>We all ended up getting the dry-aged ribeye cooked at varying degrees. I ended up getting mine medium well. The steak was cooked to perfection. It was tender and flavorful. I added the seasoned salt on top and it pulled additional flavors from the steak as well. For sides we had the fries with garlic aoli (so addicting), the Brussels sprouts, creamed spinach and the truffle Mac and cheese topped with bacon. The truffle Mac was by far the best Mac N Cheese I've ever had and it was the highlight of my meal there. Definitely recommend it; you will not be disappointed!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/bMQzDc5EpmO1vDMww2_zmw/168s.jpg", "caption": "Truffle Mac N Cheese was my favorite side dish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PZqMLn3rJA0Nc488oh8ipA/168s.jpg", "caption": "To enjoy: Scoop the Roasted Bone Marrow, spread all over the bread and topped with the carmelized onions"}]}}, {"review": {"des": "BEST steakhouse in the city! Sexy Parisian decor and exceptional steaks and drinks. Must tries include old fashioned cocktails and violet smashes. In terms of food, the steak tartare, wedge salad and bone marrow are decadent. No matter what the cut, the steaks are cooked to perfection. I enjoy mine medium rare and Bavette's has always delivered. Sides ranging from Brussel sprouts, fries, elotes style corn, and truffle Mac n cheese are fantastic. Be sure to leave room for dessert!!<br>Perfect spot for date night or special occasions!", "pics": null}}, {"review": {"des": "In my opinion this is the best steak in Chicago without comparison. The restaurant is small but comfortable with a French flare to the styling. The food is over the top and decadent in all ways. I have yet to find something on their menu I wasn't impressed with. Their bar selections are top notch as well. <br><br>I was particularly impressed on our last visit when we went to celebrate an anniversary. The bar staff comped our first round and when we were seated we were met with complimentary champagne. It put the final touch on an already perfect night and meal. <br><br>My only even minor criticism is that it's utterly impossible at times to get a reservation and they may benefit from an online service.", "pics": null}}, {"review": {"des": "It's always a good time here!  Food is always on point. Love love love dining downstairs. Cozy and intimate. Went with two other guys but that didn't stop us from enjoying the ambiance. Only problem was that I felt like the bartender upstairs under-poured my Anejo tequila. I always order rocks, and that was by far the least amount I've gotten from a place like this. Especially when we're paying $18 a pop. I wish I had a picture. Next time I'll just order my old fashioned. They have yet to butcher that drink there. But I do have a picture of my wonderful steak!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fKbXb6OZ1JqbhIGmWL8XIA/168s.jpg", "caption": "9 oysters for $31. They were on the small side."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/EOIwdbmUaEhBK6p9uzXy5g/168s.jpg", "caption": "Dry aged bone in rib eye."}]}}, {"review": {"des": "This place was awesome, period. One of the best steaks I've ever had (42 day dry aged bone in ribeye). Bone marrow for a starter was delicious. Mac and cheese with bacon was great. Mash potatoes and corn sides were also awesome. Basel cab was a nice compliment to the steak. Chocolate dessert hit the spot to top off the evening. Do yourself a favor and go!", "pics": null}}, {"review": {"des": "If you're going to eat here, do yourself a favor and take in the entire experience and savor every bit of it. Don't just order a steak and leave. Pick several items on the menu, enjoy their vast drink menu and order dessert. Just know ahead of time that it won't be cheap. But wow, it's worth it.", "pics": null}}, {"review": {"des": "Another stop on the Hogsalt super highway! Man this place is good! Was recommended this place by a foodie coworker and said we couldn't go wrong for a romantic dinner here. Bavette's did not disappoint. We ordered a nice merlot and enjoyed the atmosphere before putting in our order. It was busy-which is to be expected but the lighting a decor make it feel cozy and intimate. We ordered the crab cake to start and loved it. Had to flip a coin to decide between short rib stroganoff or a filet. I had reservations about ordering stroganoff despite the things I heard of this dish. I ended up ordering it and I am so glad I did. Best dish I've had in a while! The noodles were cooked perfect, the creamy sauce and tender beef short ribs. Out of this world good! My husband ordered the petite filet and it was cooked to perfection! I'd eat at Bavette's once a week if I could get in!", "pics": null}}, {"review": {"des": "I really can't think of anything missing from my experience at Bavette's. Steak was perfectly cooked to the requested medium rare, ambiance was on point (enough lighting to see my food and enough darkness to really create a mood), service was comfortable & friendly, and it felt like we got good value for our money.<br><br>I came here with my boyfriend for my birthday at our reserved 5:45pm. He ordered the chicken pot pie and I got the petite 6oz filet mignon. At $18 the chicken pot pie was really worth--it was generously portioned, rested on a ring of buttery, delicious mashed potatoes and was jam packed with filling. Though Bavette's is known for their steaks, I wouldn't mind coming back for any of their other special entrees. We also ordered 2 sides--the truffle mac and cheese and elote corn. Ugh, both of them so delicious.<br><br>Side note, very much appreciated how Bavette's added a tomato and some arugula with my 6oz steak as dressing to the plate. I was a little anxious about how my small steak would be presented and it was really refreshing to see some different colors on my steak presentation. I can't count how many times I've gotten tiny steaks on gigantic empty plates!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/TirC9zOWI3tQDuUm06bfJw/348s.jpg", "caption": "6oz Prime Filet Mignon - Petite Duchess Cut"}]}}, {"review": {"des": "Amazing food and excellent service!  We had some great food, I would recommend all but if I had to rank:<br><br>Bone in filet with garlic and wild mushrooms <br>Elote corn<br>Truffle Mac <br>Garlic shrimp<br>Bacon<br>Brussels sprouts <br>Carrot cake was  we were with people who aren't carrot cake fans and they said it was the best they've ever had<br><br>I like to share a glass of wine policy but some people don't appreciate being on the receiving end, which was weird", "pics": null}}, {"review": {"des": "I had been trying to get reservations here for months.  Reservations were made twice, months in advance, and both times i had to cancel.  My husband and I were then invited at the last minute to go with another couple and we jumped at the chance!  Reservations were for a Saturday night at 7pm and I was so excited. I had heard great things about this place. We arrived a little early for our reservation so went over to the bar to order a few drinks. The mixologist was great! She was very meticulous in making our drinks, asking about the size of the ice and taking special care with the lime rinds that go on the rim of the glass. The Kir Royale was fantastic! We ordered the seafood tower as an appetizer for the table, and the goat cheese. My entrée was the bone in ribeye and we got sides to share.  The elote , creamed spinach, and mashed potatoes were all very good. My steak was cooked to perfection just how I like it, medium rare. The only negative I have about this place, but it is not worth one less star, is the dim lighting downstairs. I asked for an extra candle to be placed on the table but they said they didn't have any. I would still come again. Can't wait.", "pics": null}}, {"review": {"des": "I'm not even sure where to start with this review since I'm still riding the high from the experience. We heard about Bavette's through other yelp related critiques an decided it would be a fine place to celebrate a special event. I had heard without a reservation it can sometimes be hard to get a table on the weekends. With that knowledge we decided early Sunday afternoon would be the best walk-in time. Correct with that assumption we were the first or second table to get seated. The interior is very dark yet calm. It sets the mood for relaxation and intimacy. One thing we found out before arriving was that you are allowed to bring your own bottle of wine. The only catch is that you have to give \"one\" glass to another table. This is hardly a setback though considering the price of drinks in the city. The service was strong right from the beginning. Our server was extremely kind and even gave us some tips on what Bavette's has to offer. To start things off we were brought two glasses of complimentary champagne due to mentioning the special occasion. I love when this happens. It adds that little charm to an already special evening. For the app we dove straight into the garlic shrimp de jonghe. The shrimp themselves were cooked perfectly and tasted delicious with herb/sherry sauce. We also tried one of the mint juleps which was well balanced. Being a steak connoisseur I knew Bavette's had a reputation for a darn good steak. We got the 22 oz dry aged bone in ribeye as well as the 16 oz bone in filet mignon. Both steaks were hands down utterly amazing !!!. The flavor, consistency, and temperature were all right there. They include a side of bearnaise sauce with all of the steak selections. I was so impressed with my ribeye by itself that I barely used it. We opted to get two additional sides which included the elote style corn and the truffle mac & cheese. The truffle mac won my vote but the corn was still pleasantly satisfying to say the least. To finish things off we splurged for a couple of sambucas on the rocks right along side the famous chocolate cream pie. I'm already missing that chocolate cream pie. Whether it be a special occasion or a reason to eat one of the best steaks in Chicago Bavette's has you covered.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bqY_GO-mw-vvSQOaYb6Umw/348s.jpg", "caption": "22 oz dry aged bone in ribeye"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kx9bz2fU8ezSBtsdULwYWg/168s.jpg", "caption": "16 oz bone in filet mignon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/N_NKNPrU6E8XZBRlfqhmpg/168s.jpg", "caption": "chocolate cream pie"}]}}, {"review": {"des": "Always totally amazing and spectacular. You may not get a great table here but the food will not disappoint. Lean on your server for suggestions if you like and don't be afraid to ask for exactly what you want--you will likely be pleasantly surprised. <br><br>Crab avocado appetizer is one of the best in the universe!  Don't be put off by the large size. All steaks are incredible and the seafood is amazing quality and preparation as well. Sides are beyond delicious and you can taste all the yummy ingredients. You'll want to order at least two, you can always take take home leftovers. <br><br>Desserts are a must. If you're already stuffed don't overlook simple ice cream. The salted caramel ice cream (server recommendation) is another universal standout.", "pics": null}}, {"review": {"des": "I've been waiting to get the chance to go to Bavette's for quite a few years now. I made it a point to get a reservation for my birthday. I made the reservation a couple of months in advance, and I definitely specified that I wanted a table on the lower level. This was a good choice. <br><br>The lower level is definitely more quiet and intimate than the upper level. It feels like you are in a speakeasy, but the part where they hide all of the liquor. It is very dark downstairs, and everything is lit by candles. There's a mixture of couches and booths to sit at. There's a small bar, and the ambient soundtrack helps to set the mood. It is a pretty stark contrast from the upstairs, but the levels complement each other, nonetheless. <br><br>The service is insanely attentive. The drinks are absolutely delicious-definitely try something with whiskey. I also like their wine policy-if you go you'll see. It's a nice, friendly touch and makes you feel like you are eating dinner among friends. <br><br>The steak. If you come here and don't get steak, you're doing it wrong. The aged ribeye is definitely one of the best steaks I've ever had. It was cooked and seasoned perfectly. The sides are huge and definitely shareable too. The creamed spinach and mac & cheese went perfectly with the steak. We also received a complementary dessert with a sparkler on top. Extra tastiness. <br><br>Yes, the bill was a bit high, but I felt like it was completely worth it. I will definitely make it a point to come back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/P9vgiEsdiuJyzuHUaqJU2w/348s.jpg", "caption": "Complimentary birthday dessert"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6YIO_8oLFDlgjybZYF-XeQ/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QaBJPh3AoGOxx_mj3J30fw/168s.jpg", "caption": "Macaroni and Cheese with added bacon"}]}}, {"review": {"des": "Service - 5/5 amazing. I wish I caught our servers name because he was amazing. Also I requested a private booth because we were celebrating a birthday and we got just that. A nice corner table that was perfect for us. <br><br>Food - 5/5 I will be dreaming about this food for weeks to come. We started with the crab cake. I have never had a crab cake with so much crab in it. The flavours were divine it almost didn't need the sauce it came with but that was delicious also. We got the bone in filet mignon and truffle mac and cheese for our mains. My partner usually gets his steak medium well but had this filet medium rare as per my request and raved about how melt in your mouth it was. Cooked to perfection. The mac and cheese was good but not as outstanding as the other two dishes. We got the chocolate cream pie to finish. The vanilla bean whipped cream is divine and loved the crunchy crust of the pie. Would recommend.", "pics": null}}, {"review": {"des": "Bavette's is BYOB, but the uncorking fee is sharing a glass with a table of your choice. The pours are pretty hefty but still a fun process. The filet mignon and mashed potatoes are the best. You'll be full when you leave but take a chocolate cream pie to go and you won't regret it.", "pics": null}}, {"review": {"des": "Wow.  Best steakhouse dinner I have ever had and most expensive!  Mind you, I have been to plenty of NYC houses that weren't as pricey.  But nevermind that.  The meal.  Wow.  The steak was perfectly tender and full flavored.  The bread was delicious.  The Mac and cheese was amazing.  <br>Our server Hope was delightful, pleasant and attentive.  <br>I am not deducting a star for it, but definitely considered it:  the bar service before our meal was a 2 star due to the female bartender.  Mind you, the bar was half empty and we had told her we were having drinks before dinner.  Her rush to close out our check reminded me of the bars I went to in college that were selling $2 shots and were 10 people deep.  A tip to mgmt:  when you rush to close out a check with us, we won't continue to order drinks at your bar.  When we don't close out, we will order more drinks if the mood suits us.", "pics": null}}, {"review": {"des": "Hands down THE best steak I've ever had. I made a reservation months in advance and even then it was slim pickings. The ambiance is old school and DARK. Service was absolutely amazing and attentive. We were celebrating an anniversary and were given complimentary champagne to toast!<br>It is BYOB with no corkage fee so long as you send a glass to another table, which I thought was such a cute idea!<br><br>WHAT I TRIED:<br>42 day dry aged ribeye (w/ roasted garlic)<br>Truffle mac and cheese <br>Brussels sprouts<br>Thick cut bacon (as appetizer)<br><br>Holy moly the steak was so soft and flavorful! It took me by surprise my first bite. I never had a steak quite that soft before. The steak is pricey but you can definitely share it, which is what I did and it was well more than enough food especially with all the sides. I would probably recommend you getting 1 side as the serving size is pretty big. The 3 sides I got to try were decent.. I wish I tried the mashed potatoes or the corn. They looked delicious! The steak was definitely the shining star.<br><br>I am so glad a location just opened up in Vegas! I am headed there next month and will definitely be making a stop there.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oL9ri5WiiRgtMV-eMvKP2A/168s.jpg", "caption": "Yummmmm"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/StmI0idvh_0x9FwDG5Mgug/168s.jpg", "caption": "Ordered as appetizer"}]}}, {"review": {"des": "The only reason I'm giving it 4 stars instead of 5 is that it is difficult to get a reservation. Other than that, the food and cocktails are amazing! Seafood tower is one of my favorites in the city.", "pics": null}}, {"review": {"des": "Made reservations a few months ago. Came into to Chicago to celebrate my boyfriend's bday. Reservation was at 8:00 did not get seated until 40 minutes later, however we enjoyed ourselves at the bar and the food was totally worth the wait. <br>The service was awesome and our server Joel was exceptional. We had the cold lobster,dry aged ribeye bone in with a side of bone marrow, elote corn, mashed potatoes, very delicious truffle mac and cheese and the chocolate cream pie. We were not disappointed in any item we tasted even the sour dough bread with the salted butter yum!!!! I would definitely return the next time I visit Chicago.", "pics": null}}, {"review": {"des": "Best. Food. Ever.  The entire experience start to finish was flawless. <br><br>Crab cake was best we've ever had. Bone in ribeye Oscar style - oh lawd. Truffle Mac and cheese - mmm. Fried chicken with mashed potatoes - my fave part. <br><br>Our server Meredith was ahhhhmazing. <br><br>Will we back? F yeah we'll be back.", "pics": null}}, {"review": {"des": "We had tried to get a reservation at Bavette's for quite a while...finally landed an early table last night.  <br>In summation.<br>The food was OK - not great.<br>The service was OK - not great.<br>The atmosphere was OK - not great (who wants to pay those prices and sit in a basement?). <br>All in - we'll try it again, someday, putting much less energy into creating the opportunity to dine at Bavette's - when it happens, it happens - till then I'll keep going to Maple & Ash.<br>Peace,<br>Deacon Tom", "pics": null}}, {"review": {"des": "Believe everything you hear, because i didn't, and had to eat humble pie. Humble pie sucks. <br><br>Steak is everything to me. And I have travelled far and wide trying to find the one. The $270 Tomahawk Wagyu from RPM made a good claim, so did the Nusr-Et (saltbae) Steakhouse in Istanbul. Many have come and gone since then but my friends THE ONE resides in Bavette's. <br><br>The Bavette's Dry Aged Bone-In Rib-eye is THE best steak in Chicago, and probably anywhere else. Served the way steak should be, simple. Just some sea salt and some béarnaise on the side. Come here prepared because this could be one of the greatest things you will ever eat. <br><br>I must give a special shout-out to the Truffle Mac & Cheese, the Garlic Shrimp De Jonghe, the lamb chops and honey glazed salmon. But it's hard to look past the ribeye. <br><br>Amazing atmosphere, amazing service and mind-blowing food. You feel like you're at dim-lit ballroom party in the 20s.<br><br>PRO TIP 1: If you bring a bottle of wine and gift a glass to a random guest of guest of your choice, they will wave the corkage fee ($60). Very cute, you usually see free wine coming to random people.<br><br>PRO TIP 2: Reservations at normal dinner times are near impossible, but if you show up at 5pm you can usually be seated, and if you are okay with dining after 10:30pm, you will also be ok :)<br><br>Bavette's is as good as it gets. 5 big, fat (and juicy like the ribeye) and well deserved stars.<br><br>PS: I once came here at 11pm and loved it so much, I was back at 5pm the next day. The entire restaurant became aware of this and me and my friend were famous for an hour.", "pics": null}}, {"review": {"des": "First came here in early 2015, then again in late 2015. Haven't been back since but definitely wanted to write this review because I want to return soon! The decor is very vintage-y, and inside is dimly lit. Staff and waiters are all extremely kind and attentive, but not intrusive.<br><br>First time I ordered the Lamb Chops. They were AMAZING. They were seasoned just right and cooked perfectly so they were easy to chew. I also got to try some of my friend's Filet Mignon, which is what I ended up ordering the second time. Their medium rare is actually medium rare! The food is absolutely worth the price!<br><br>They have a downstairs, which I haven't been down to yet, but would love to try out next time. I've heard it's quieter and more intimate. You can make reservations through OpenTable, which will save you the wait! Also, know that the bar has full menu for food, just in case you don't want to wait for a table!", "pics": null}}, {"review": {"des": "Last night, the service we received from the female bartender in the basement of Bavette's (or lack thereof) was abhorrent. She was training another female or had a stage following her for the duration of our experience. I chose Bavette's because I wanted to have my husband feel wined and dined at a nice establishment after working a long week. This experience was anything but that and left a sour taste in my mouth. Never was there any offer of food or any attempt to sell us their product offerings - simply order taking.<br><br>We were left to stand at the bar for approximately 2 hours, each having 3 drinks. Our first round of cocktails were a Southside and a Vesper. It was delivered with, \"I'm sorry your cocktails are very labor intensive.\" I'm not quite sure why she felt the need to preface that, but alas I understand that and that's why we are here - to have high end cocktails created by hospitality professionals.<br><br>My husband stated to her that the Southside tasted like it was missing one of the key ingredients - mint. Although I cannot confirm or deny if it did or not, it honestly tasted like a Gin Gimlet with frothy egg white. This is a cocktail I drink frequently, especially at their sister restaurant next door - Gilt Bar (same recipe). Her response seemingly with attitude, \"Oh, I must certainly did!\" It was hard not to laugh at how rude she was. She then walks away, comes back with two mint leaves, smacks them loudly between her hands and places them on top of my drink. The female bartender then states, \"Hopefully, that will provide more herbaceousness for you.\" <br><br>At this point, we should have left. We stuck around to see if there was some sort of redemption with her, there wasn't. She continued to have unpleasant interactions with nearly everyone for the remainder of our visit. In the future, maybe she should offer to remake the cocktail for the guest.", "pics": null}}, {"review": {"des": "A truly special place! We had dinner here for the bf's birthday. I got us an 8 pm reservation nearly two months earlier. We showed up about ten minutes early and were able to grab a drink at the bar while we waited. The ambiance is really perfect- dark, swanky but not pretentious at all. The majority of the women were in sundresses and lots of men were wearing dark jeans. My French martini was perfect-- the sickeningly sweet raspberry liqueur you sometimes find in this drink was nowhere to be found. <br><br>Our server, Hope, was FABULOUS. Bavette's is lucky to have her. She made wonderful recommendations, always showed up at the right time to refill a glass or refold a napkin and most importantly she didn't throw a barrage of upsells at us. She told us she'd only worked there for a couple months but I'd never have known- she fits in perfectly with the whole experience.<br><br>As for the food- WOW. We routinely share when we eat so, as it was his birthday, I let the boy take the lead on the ordering. Not everything was what I would have ordered but I was still very impressed. The shrimp de jonghe is not to be missed. I was loving the bread and butter service but when that garlicky shrimp showed up, all bets were off. We also had the smoked salmon Caesar (fine but we agreed it was the weakest thing we ordered), pommes frites, roasted Brussels sprouts, elote corn and the 22 oz ribeye with bone marrow accompaniment. We made a dent in everything but left with a bag of leftovers including half a steak. The bernaise sauce and steak salt served alongside the ribeye really elevated it to the next level. <br><br>Earlier in the meal, the fabulous Hope stopped by while the bf was in the bathroom and asked us if were celebrating anything, so I mentioned his birthday. When we were done with dinner, she came and asked us if we were interested in dessert but the boy was too full to even contemplate it. She still surprised us with a dish of the most delicious salted caramel ice cream complete with a celebratory sparkler. She showed up as we were devouring it and said she 'had to do it! It's your birthday!' to him which was so sweet of her. I liked that she went a little on the lighter side and brought us regular ice cream (although it really was the most sinfully good ice cream I've had in a long time). <br><br>This is not a cheap meal but it is the perfect celebratory spot with impeccable service, generous portions and delicious food. It's easy to see why it's so popular and it certainly lived up to the hype.<br><br>Tip- Take advantage of their unique BYOB policy and bring a bottle of wine with you! You share a half glass with another table in lieu of a corkage fee. They brought us an ice bucket and everything for our champagne and it kept the bottom line a little lower!", "pics": null}}, {"review": {"des": "We made the reservation for 5pm on a Saturday and made it in as the door opened. When you set up your dinning reservation, they will text you to confirm few hours before so, make sure to be on the lookout for it. <br>Once inside, needed a second for my eyes to adjust to the dim light setting of this beautiful establishment. Definitely a speakeasy kind of vibe with lots of attention to detail from the serving staff. <br>I had narrowed my wine choices down to two types of cabs, then, I was able to taste before choosing which one to order. <br>Basket of freshly baked sour dough bread was served with butter and it was tasty.<br>We ordered petite filet mignon with peppercorn crust, prime rib, mashed potatoes with roasted garlic and charred broccolis. Temperature of the meat was perfect and meat was delightfully tender. Shirley temple, lemon pie and french pressed coffee was also a great touch for after meal! <br>Inner part of the bar/dinning area's ambiance was perfect for a date night or to enjoy a fun outing with some friends.<br>Can't wait to dine here again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/iBEZzUoY5lImV1jlLUX57A/348s.jpg", "caption": "French pressed coffee"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LQoDetcJvPby_eL9UWTiDA/168s.jpg", "caption": "Lemon pie"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dgmdT286-VEq8F7CqhKrhQ/168s.jpg", "caption": "Black cherry shirley temple"}]}}, {"review": {"des": "Bread and butter are to die for.. <br>Dry aged bone in ribeye is to die for..<br>Spinach and other sides are not to die for..<br>I wouldn't die for the filet minion but others would..<br>Chocolate pie dessert is to double die for, twice...<br><br>The sauce and parsley garnish don't belong on that ribeye.<br><br>Conclusion: one of the best carnivore-friendly dinners I've had in Chicago.", "pics": null}}, {"review": {"des": "If this pace isn't on your list of top steakhouses, you're missing out. It's a little tucked away as far as location goes, and certainly valet, it's very affordable as far as city parking goes. The whole experience from start to finish was fantastic. The waitstaff is what you would expect, impeccable, knowledgeable and suggests some different things. We changed it up and actually started with the thick cut bacon, which was salty, and a little sweet with a nice maple finish. The main course was a bone in filet for her and the 45 day dry aged bone in ribeye for me. I've never seen or heard of a bone in filet, but the added flavor was unrivaled from any other filet had. The bone in ribeye was melt in your mouth smooth, with excellent beefy flavor, a great char crust and fat melted throughout. The bone marrow side was an excellent accompaniment to the tremendous sourdough. The elote is a wonderful changeup from the typical steakhouse sides, with deep creamy flavor and a nice little kick of citrus. The truffle Mac and cheese was great as well. Not a single bad thing was had, and we look forward to coming back as soon as possible!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/X7u764dsmcwpcoUehaQgZQ/348s.jpg", "caption": "Look at that sourdough!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nXAH-Tbd1OE6_z5NKyhKZg/168s.jpg", "caption": "Prime Bone In Filet. Great flavor, and perfectly cooked"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sYrPbEmfFVdB3azm6ROOjQ/168s.jpg", "caption": "Thick Cut Bacon as an appetizer, just do it. You won't regret it"}]}}, {"review": {"des": "Bavette's is my favorite restaurant in Chicago! I've only lived in the city for a few years but consider myself someone that appreciates a good restaurant experience. <br><br>Everything about this place was awesome. <br><br>Atmosphere: dimly lit, old Chicago steakhouse vibe with some modern touches. <br><br>Service: super professional and knowledgeable without being stuffy<br><br>Food: the definite highlight. You go here knowing that you're going to splurge so why hold back? Order the grand seafood tower!!<br>The steaks are insane. The sides are delicious (creamed spinach, Brussels and truffle Mac were our favs). <br>If you're feeling really adventurous skip dessert and take a bone marrow - Jameson shot! Yes, I said that. <br><br>One of my top 10 dining experiences ever. Love this place!! Can't wait to go back for a special meal.", "pics": null}}]}