{"name": "cafe-ba-ba-reeba-chicago-3", "reviews": [{"review": {"des": "Omgosh...their potatoes and sauces...I still dream of them. If you come here, make sure you get their potato bravas. I judge places based on how well that is made - you'd be surprised at how many restaurants fail at it. <br><br>The garlic shrimp was a bit too salty, but they have great croquettes and jamon iberico! Great tapas places and amazing sangria - try the sparkling sangria if you're feeling adventurous!", "pics": null}}, {"review": {"des": "I can't get enough of Reeba. If I could, I would eat there every day of the week. This is a minute detail, but there bread is incredible. Combined with their olive oil, it could be a meal in itself. <br><br>The food comes out fast and fresh. I love the concept and pace of a tapas meal. On top of that, their sangria is the best I have had in the city. <br><br>If you can, sign up for their text deals that notifies once every two weeks.", "pics": null}}, {"review": {"des": "We arrived on a Friday evening right before a 1.5 hour waitlist started due to reservations (around 5:30). We were seated and the menu was explained to us by our server. Water and bread were brought to the table immediately - there was olive oil on the table with salt and pepper but no other spices or balsamic vinegar. Dipping bread in olive oil wasn't my jam so I left it to my partner. We ordered a pitcher of the black raspberry sangria and absolutely enjoyed it throughout our meal. <br><br>We ordered the Potato and Onion Omelette and the Goat Cheese Baked with Tomato Sauce. The omelette was served with what I believe was a garlic aioli, not bad overall but nothing to write home about. <br><br>The Goat Cheese Baked with Tomato Sauce was served with crispy, thinly-sliced garlic bread - I thoroughly enjoyed this dish and once I ran out of the garlic crisps, I used the bread table to finish the remainder of the dish. <br><br>We ordered the chicken paella - their paella is priced per serving with a minimum of two servings to order. Kind of a bummer if you are interested in a different type of paella than other people at your table. The paella itself was a little salty but good. <br><br>We were there for a date and the servers were a little too attentive for my taste. I felt like we were being checked in on every 5 minutes - just a bit much for me but that's a personal preference. <br><br>Overall, great atmosphere and good food. I would definitely return, probably not for the paella, but definitely for the tapas and sangria!", "pics": null}}, {"review": {"des": "After hearing about this place for such a long time and trying to come many times I FINALLY MADE IT. Stopped by the day after Thanksgiving to have lunch with my family. The four of us ordered squash soup ($5), brussel sprouts salad ($7), the cheese plate($10), garlic shrimp ($9.50), squid ($11), beef empanada (6.50), hanger steak ($13), lamb skewer ($9), and we two desserts - chocolate truffle and Spanish affogato. There's free dessert with your yelp check-in!<br><br>While all of the dishes we got were absolutely delicious, my three favorites were the garlic shrimp, squid, and the hanger steak. The shrimp was cooked to perfection and was a blast of flavor the moment you put it in your mouth, yet not overwhelming. I'm not the biggest fan of garlic, but the combination with lemon and the pepper flakes gave it the perfect kick of spice and tang. The same went with the squid, which was chewy and tender. While this seems simple, many places serve it way too chewy making it hard to tear apart and swallow. The hanger steak - nice and medium rare, tender, and full of flavor. <br><br>I loved that the portions were just right. We left feeling full but not bloated.  8 dishes, two desserts for the price wasn't bad at all! Without a doubt, I would return again and will definitely be recommending it to friends and visitors!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/d2RgGBmfzyl_7LcZFt25ow/348s.jpg", "caption": "Spanish Affogato"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/rUBKiBHvFjfZwwWhdW9rIQ/168s.jpg", "caption": "Grilled Hanger Steak with Roasted Mushrooms, Roasted Garlic & Pearl Onions"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UiQALTb20BI7WNhygA37ZA/168s.jpg", "caption": "Moroccan-Spiced Lamb Skewer with Cucumber-Yogurt Salad"}]}}, {"review": {"des": "Nice tapas place.<br><br>Fun atmosphere and setting.  We ate somewhere that felt like it had a retractable roof.  When we were seated I felt like I was sitting outside, so I glanced around and noticed the roof looked like it moved.<br><br>Cool place to eat, drink, and have a good time.  The food was pretty good, but I've had better tapas at other places.", "pics": null}}, {"review": {"des": "After dining here Saturday night I can see why they have such staying power in a VERY competitive market. Every thing was well done. <br><br>We had reservations & were seated immediately when we arrived. ;) <br><br>The place was packed but service was great. Our server was excellent, made a great wine recommendation, all of their wines are Spanish & we weren't familiar with them but she led us in the right direction. <br><br>They place bread on the table with olive oil, the water was filled before you ran out. Just great attention to detail. <br><br>The food was delicious, we started with olives & deviled egg, yum.<br><br>Then we had bacon wrapped dates. Chicken chorizo skewers, chicken meatballs, cherry tomato sauce was awesome! Every dish was delicious. <br><br>Will definitely go again when in Lincoln Park.", "pics": null}}, {"review": {"des": "There's a reason why this place is always slammed. It's such a fun environment for tapas, and the sangira is unbeatable. Plus, it's a parent pleaser! <br><br>Here's more on what I love:<br>- Ambiance. As soon as you walk into this place, you're immediately immersed into the lively and noisy energy.<br>- Sangria. They have so many varieties, and they're all good.<br>- Happy hour specials. During happy hour from 4-6 pm, the sangria pitchers are $16, and there are a ton of tapas food specials, too. You can't beat the prices!<br>- Rioja-Braised Short Rib. It's so tender and literally to die for.<br>- Paella! Authentic Spanish dish that's always cooked perfectly here where the rice is crispy and so flavorful.<br><br>Here's what to look out for:<br>- Sometimes the service can be hit or miss. The servers are usually running a mile a minute, and sometimes it seems like they're short staffed.<br>- Bathrooms are located downstairs or at the very back. The one in the back is much nicer, but often packed. The one downstairs is a hike, and could use some remodeling.<br><br>Very minor complaints. I always have a good time here and would recommend to just about anyone!", "pics": null}}, {"review": {"des": "I'm tap dancing over these tapas! (Hehehe cheesy, I know! ) but the tapas here are amazing! <br><br>The place is very popular, so making a reservation is highly recommended. There is an app where you can track your wait. <br><br>Now let me list the must: the scallops, the croquettas de bacalou, the shrimp, the chicken peri-peri, the steak with blue cheese, the goat cheese with tomato sauce, and the Brussels sprouts salad. <br><br>Avoid: the octopus and lamb skewers.<br><br>The scallops were amazing! Served on a squash purée, with candied pumpkin seeds. This was definitely a winner for me. Perfectly cooked and paired perfectly with the squash, this is a great fall dish. <br>I love cod, so the croquettas are a must. Plus, the aioli makes for a delicious experience, every bite. <br><br>Brussels sprouts salad was so refreshing, I'd actually suggest ending with that as you can lighten the tasted buds at the end.<br><br>Also for dessert, the butterscotch custard and the natilla flan with saffron are a must! <br><br>Red sangria pitchers are also a necessity! <br><br>The service is also excellent here! And you don't have to wait long as food starts coming out as soon as you order.", "pics": null}}, {"review": {"des": "Pretty overrated in my opinion - I'll start with the ambiance, It is a cool restaurant but its HUGE! way bigger than I expected it to be.. The food was very sub-par. I ordered the Brussel sprout salad and it was very boring and dry. I also ordered the salmon which was very plain and the 'roasted veggies' it came with were almost non-existent and drenched in oil. I will say the olive oil they have at the table for the bread is really tasty - probably the highlight of my meal to be honest. <br><br>The service left a lot to be desired. It was extremely slow and our food took FOREVER to come out. Will not return here", "pics": null}}, {"review": {"des": "The food here is a solid 3.5 stars - it's tasty, well made and mostly authentic to Spanish tapas.  Spain being one of my favorite countries in the world and having visited it many times I can definitely (and unsurprisingly) say that there are better tapas out there but I don't want to discredit the good food that they do produce here - it's just not mind blowing amazing to me.  Oh and critically for a Spanish restaurant their olive oil is really quite good!!!<br>So why the 4 star review - it comes down to service and accommodating large groups.  I have only come here with groups of 12 (having now visited 5 or more times) and they have always been most helpful getting us served & seated on time.  The kitchen can manage orders with MANY tapas and still produce them without big waits between plates.  The servers are engaged, present and helpful (and the managers I have worked with have been VERY helpful).  I appreciate the work they do for their customers and have always left with a smile on my face.  I guess that to me speaks volumes.", "pics": null}}, {"review": {"des": "Ooh such a great spot for tapas! I came with 4 other people, and the 5 of us had a great time trying a variety of the dishes and sipping sangria. <br><br>I don't completely remember everything that we ordered, so here's my verdict on what I can recall:<br><br>Burrata with Catalan Tomato Bread and Goat Cheese Baked in Tomato Sauce was delicious. Brussels Sprouts Salad was surprisingly good. I usually don't like raw brussels sprouts, but I enjoyed this salad. The Octopus a la Plancha was pretty mediocre, which I found surprising considering that I love octopus and I expected them to knock this one out of the park. The Shrimp with Garlic, Olive Oil, Red Pepper Flakes on the other hand was delicious, and I think we went with 2 or 3 orders of this. I'm not a fan of blue cheese but the others at my table enjoyed the Beef Tenderloin & Blue Cheese. The Grilled Hanger Steak was also a hit among us. Someone ordered a Beef Empanada and really liked it. <br><br>We definitely ordered more plates than just this... I think our final bill came out around $300 after tax and tip. Not cheap for the 5 of us, but we also ordered a lot of food. Cafe Ba-Ba-Reeba is a great spot for groups who love to try different foods and share bites, but I wouldn't come here if you're looking to keep the spending down.", "pics": null}}, {"review": {"des": "Delicious tapas!!! Love the name of this place too haha. The service is here is impECCABLE. Our server kept checking up on us and refilling our drinks. He was super friendly and helpful. Don't forget to check-in for a free dessert tapa! Loved the decor and vibes here.<br><br>We started with a pitcher for Cava Sangria between 3 people. It was basically the perfect amount. About 3 drinks per person. It was fruity and delicious. We got Spicy Potatoes with Tomato Aioli, Spinach & Manchego-Stuffed Mushrooms, Serrano ham, salchichon, chorizo & manchego platter, and Grilled Octopus with mojo verde, potatoes, olives, migas. Everything was delicious and quite filling even tho they were small plates. I like how they indicate the popular items in red on the menu. For dessert, we got Caramelized Banana, Chocolate Truffle Cake, and Butterscotch Custard. Honestly, you can't go wrong with anything here especially the popular (red) items.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Z73XDFC1D4tt19L--SR0Pw/168s.jpg", "caption": "Spicy Potatoes with Tomato Alioli"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1tp84A1Baz-CLL5nnlJ1eA/168s.jpg", "caption": "free dessert tapas when you check in! Chocolate Truffle Cake, Caramelized Banana and Butterscotch Custard"}]}}, {"review": {"des": "Cafe Ba Ba Reeba is an iconic restaurant that is heavily recommended for people looking for a taste of Chicago tapas. I'll preface this review by saying that I'm not the biggest fan of tapas (paying lots of money for small portions) because I'm a hungry girl and I particularly don't like it in large groups because it gets a bit hectic, but that won't taint the review of the restaurant itself.<br><br>We went with a group of co-workers and they were very accomdating with the seating even when we had less people than the original reservation. <br><br>We started off with the white sangria, it was good but didn't taste like there was much alcohol. <br><br>We put in an order for paella was good and very filling with two servings for 6 people.. It takes a while to come out so order first.<br><br>We ordered a bunch of tapas... Some were unmemorable. The grilled hanger was good and the grilled calimari. I thought the Pata Negra was ridiculously overpriced at $20. The tapas all come out fast so dont order too much at the beginning and just order as you need it. <br><br>Loved the free yelp check in for a dessert. We got the chocolate cake one which was very rich and yummy.<br><br>All in all, I come here on rare occasions but I'd be back... with a smaller group.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ce3fNiPI_eiXPdb35DFTNg/348s.jpg", "caption": "Free yelp dessert"}]}}, {"review": {"des": "Excited to get to Cafe Ba-Ba-Reeba for the first time for brunch! Pre-Patriots game (or as fans here would say, Bears game) 5 of us came to enjoy a delicious brunch because we had been told of this so-called fantasy for 2 years.<br>And you know what? It didn't disappoint! <br>Our server was kind and very attentive.  We way over ordered, but it was amazing!  We took some things off both the brunch and dinner menu.<br><br>The one thing that came around after we were super full was the paella. The server spent time to prepare it by the table and it looked like he spent a lot of good time on it! After he went to serve us, we realized there was sausage in it, which we made clear when we ordered we didn't want.  It sounds like there was a miscommunication from the server to the kitchen.<br>Within 5 minutes, the manager came over and apologized profusely and took some things off our bill along with the paella. It was so nice of him. I can't wait to go back, and hopefully I can try the paella!", "pics": null}}, {"review": {"des": "Drinks: Passionfruit Sangria with fresh fruit; apples were definitely the highlight. I could eat a bowl of just the sangria soaked apples. Menu suggestion? <br><br>Tapas: Everything we tired was perfectly cooked and flavorful hence the pictures of half eaten food. <br><br>(28) Moroccan Chickpea Stew <br>(30) Spicy Potatoes with tomato alioli <br>(43) Grilled Octopus (my favorite)<br>(53) Grilled Hanger Steak<br>(55) Moroccan Spiced Lamb<br>(66) Seared Spanish Sausage<br>(67) Roast Dates <br><br>Pork Shoulder Paella: Just okay; meat was unexpectedly tough. But this was the only miss of the evening. Note: you need to order a minimum of 2 servings to get the paella. <br><br>Great for a group of 4 or more so you're able to sample a lot more dishes.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lou_IENkhdwhFnfkUxI3_A/348s.jpg", "caption": "Pork Paella"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/hRHYqSaAENWwQpYkIOEElw/168s.jpg", "caption": "Grilled Octopus"}]}}, {"review": {"des": "I would only recommend this place during happy hours because it's such a steal for the deals they do. I recommend any of the potato salad, empanadas, or sangrias. <br><br>I definitely suggest ordering their specials as well. We had the fried squash, which I was hesitant about, but it was the best of the 4-5 dishes we ordered that night. Service is good, but definitely try and RSVP as they fill up quickly.", "pics": null}}, {"review": {"des": "Cafe Ba-Ba-Reeba is one of my favorite restaurants in Chicago. One of the things I like the most is the exceptional level of consistency. The tapas and pintxos are always a solid choice and the service staff is friendly, helpful and quick every time. In my opinion, this restaurant is a great place to have not only a nice casual dinner, but also to celebrate special occasions with friends or family in a laid-back but lively ambience. <br><br>My personal favorite are the patatas bravas. I have eaten tapas all around the world, from Latin America to Spain, in amazing restaurants and tapas bars but I have to say Cafe-Ba-Ba-Reeba's patatas bravas are simply the best I've ever had.", "pics": null}}, {"review": {"des": "On a recent guys trip (5 other 40ish year old guys) we came here on our final day for a unch feast of epic proportions.  One of the guys in the group set it up as he had been here several times before.   <br><br>While waiting for the table we all went to the bar.  They have a Bloody Mary bar where the bartender/waiter hands you a glass of vodka and you do the rest.  Each Bloody Mary is 10.00 each which at 1st seems steep but with amount of toppings at the bar, you can eat a meal with the bloody mary.  Unlimited bacon, shrimp, veggies, olives, etc and a variety of mixes from mild to spicy.  If Bloody Mary's aren't your thing, they also have 4-5 different sangrias including a sangria of the day.  <br><br>Café Ba-Ba-Reeba is a Spanish restaurant so the way to go is to order a bunch of tapas(small plates) and split amongst the table. We had 4 fat boys and 2skinny guys who could all eat so we tried so much that I forgot half of what I ate.  I do remember really liking the waffle battered chicken sticks, the Beef tenderloin on English muffin with poached egg and Hollandaise(I didn't share this), the chicken and charizo skewers and the hanger steak with roasted garlic and pearl onions.  The onions were unreal delicious by themselves!  The food prices are very affordable making it easy to order a ton of food.<br><br>Definitely an awesome-fun spot for brunch.  I'd say if you are looking for introduction to tapas and Spanish food, this is a great spot because you will see familiar dishes with some not so familiar.  It's easy to experiment with small plates since the cost is low.  Get a reservation as the place is very popular.", "pics": null}}, {"review": {"des": "Ugh I love this place. My mouth is always watering. Tapas are the move here and I suggest if you're in a group everyone orders one thing and you all family style eat!<br><br>My favorites:<br>-Brussels sprouts<br>-burrata (SO good ugh you won't regret it!!!)<br>-charcuterie board<br>-goat cheese in tomato sauce<br>-rioja braised short rib (it melts in your mouth and tbh I didn't share this one because it was the best short rib I've had in my 24 years)<br>-make sure someone gets PAELLA. So freaking good and it's mixed in front of you in a huge hot pan and served steaming hot", "pics": null}}, {"review": {"des": "This is the kind of place where you bring people who are visiting you from out of town. That's how good it is. First of all, the ambience is really cool in there. The bar is beautiful, and the restaurant itself is architecturally pleasing and nicely lit. The hostesses all greeted us with warm inviting smiles, and then seated the three of us.<br><br>We got a pitcher of the CLASSIC SANGRIA which was delicious. For tapas we got the ANCHOVY TOAST which I found very good even with my disdain for anchovies! We got the PAPAS BRAVAS which were some of the best I've ever had, and we also ordered the FRIED CHICKEN tapa which was my favorite. For PAELLA, we got 2 of the small ones. The SEAFOOD, and the CHICKEN PAELLA. <br>They were both outstanding!!! Especially with some lemon squeezed on top. Sooo good. <br>We were too full for dessert, but they brought my roomate a delicious little chocolate to-do with a candle on it to celebrate her birthday, which I thought was very nice. <br><br>I wanted to go back the day after, that's how delicious the food here was. And with a terrific atmosphere.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_3tj4rtFwgSDLRnrA95vDg/348s.jpg", "caption": "Paella"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2tGNPKF8JjmBznb3SK8n1Q/168s.jpg", "caption": "Paella de Mariscos"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HOzLWZdijKqO3SuQswfrfg/168s.jpg", "caption": "Anchovy White Anchovy & Tomato Toast"}]}}, {"review": {"des": "The restaurant has an area that is dimly lit and intimate, but also a room with open windows, and a frosted glass roof that allows in a beautiful amount of natural sunlight. We were originally seated in the dark, but our initial waiter was gracious enough to move us over to the brighter area. <br>Between my friend and I we shared the paella (minimum serving is for 2) and a few tapas (small bites). Our second waiter didn't seem to know the menu very well. We asked for recommendations because there were so many tasty options, but he seemed to read over my shoulder to recommend the dishes already highlighted in red on the menu. <br><br>-Paella with confit pork shoulder, crispy pork belly, chorizo, and chicharrones<br>The description sounded bomb. The reality featured a dry yet oily, under-spiced rice with really dry meat. It was just very, very far from my idea of a moist, pleasant paella.<br><br>-Grilled Octopus<br>The flavors of this confused me. I felt like the greens on the plate were frivolous. They did not enhance the octopus, and their texture didn't work well make one cohesive bite. The octopus on the other hand was cooked very well, but the flavors were subtle and a rather unidentifiable. The concept for the dish has so much potential, but the execution of it was too all scattered to be enjoyable. <br><br>-Short rib<br>If I had to relate this to something in terms of flavor, this reminded me a bit of the taste of a canned beef stew. It was tender and flavorful though.<br><br>-Grilled Hanger Steak<br>The highlight of this one were the mushrooms. There were seasoned so well and had great texture. I could have eaten a bowl of just these mushrooms. The steak was also delicious. <br><br>-Buttermilk fried Chicken<br>The sauce is a bit like a buffalo hot sauce, but more subtle. I'm not a huge fan of buffalo sauce, I find it to be a bit too acidic. The chicken was cooked very well though. Given my bias, it was just A-OK. <br><br>The inconsistencies in the meal kept me from giving Café Ba-ba-reeba a higher rating, and although I had a lot of constructive criticism of the tapas, the tapas were tasty and deserving of 4 stars. Each one had great flavors that did not require any additional seasoning, even if those flavors were not to my preference. I would recommend it for a casual place for some small bites. Another con is that it is very easy to rack up a big bill here even though the smaller portions are expected.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/eh0SVARKPN8eicVQ666hXA/348s.jpg", "caption": "Grilled Octopus"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4csG7747wLY5eF_qau1N1g/168s.jpg", "caption": "Buttermilk - Fried Chicken Thighs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FXsATUSoE3JnNtwXv3PD0A/168s.jpg", "caption": "Rioja - Braised Short Rib"}]}}, {"review": {"des": "My favorite tapas place in Chicago Service is friendly and food quite exceptional Sangria is also pretty good. I highly recommend ordering a bunch of stuff to share", "pics": null}}, {"review": {"des": "This is a very unique place. It's a Spanish tapas restaurant, meaning you have to order quite a few small dishes that you usually share amongst the table. As a party of 5, we ordered a lot of food and everything was delicious. All the food comes out as it is prepared, not all at once like a standard restaurant. <br><br>The pallellas are very good as well, but these take about 30 minutes to prepare. The atmosphere is cool, and the place is a lot bigger than it looks from the outside. <br><br>Overall, I really enjoyed this meal, though it is slightly on the pricier side for small plates. I would go back.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/s7NLaj2iAXRoLrSwMf3faA/168s.jpg", "caption": "Deviled Egg with Crispy Jamón Serrano and Stuffed Olive with White Anchovy & Piparra Pepper"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UIxRsB9eBXeZ5Z0oEkrHmw/168s.jpg", "caption": "Shrimp with Garlic, Olive Oil, Red Pepper Flakes"}]}}, {"review": {"des": "This is a nice place to go with 1-2 other people. Their variety of sangrias are tasty and most of the food is good (and reasonably priced). I will say, however, that I think the paella is overpriced. Some of my fav items are the goat cheese baked in tomato sauce, short rib, and calamari. The desserts are perfect sized (get the chocolate cake!)", "pics": null}}, {"review": {"des": "I went here for my birthday dinner in August, and I loved it. I heard high praise about this place from my coworker and other friends, and it had been on my list for a long time. The bacon-wrapped dates were as amazing as others have said, and they were excellent, probably the best things I had all night. I don't think I found any of the tapas disappointing, and the octopus was also really really good. The seared scallops were also great. I love how many options they have, and I wish I could remember every single thing I ate.<br><br>My one gripe about this place is that the tapas are tiny and the prices high, so your bill at the end of the night will likely be much higher than other equally upscale places. I would come back here for a special occasion or when I'm really in the mood to treat myself.", "pics": null}}, {"review": {"des": "This review is for happy hour only! I will update when I go back for a whole meal. <br><br>The happy hour is a good deal, $16 sangria pitchers and a bunch of small plates for cheap. We just stopped in for a quick drink but for a Friday afternoon the bar area had open seating available immediately. While brief, I enjoyed my experience there and hope to be back and try much much more!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/E5ClgN6dHb0QEOfgjLr_7g/348s.jpg", "caption": "Chicken & Ham Croquetas"}]}}, {"review": {"des": "Solid food all around with most dishes being pretty good, and the service is friendly. It's a bit dim and feels a little cramped and grimy in the bar area, but it adds to the atmosphere in a way. It's a good place to hang out with a bunch of friends for late night tapas or drinks.<br><br>We ordered about 10-12 dishes, and the one that stood out the most was the paella mixta, which I would definitely order again. I didn't have any bad dishes, so you really can't go wrong with any of the appetizers. Pick what you're in the mood for!", "pics": null}}, {"review": {"des": "This is my favorite tapas restaurant!  Cafe Ba-Ba-Reeba! gets better and better, every time I dine with them. The staff is friendly and knowledgeable. The service is speedy and the food/drinks are awesome. We made 5pm reservations for Thursday. I completely forgot that they have Happy Hour from 4pm to 6pm. There was half priced sangria, beer, pinxtos and appetizers! We tried the Estrella beer, 2 glasses of Koval Rye, deviled eggs, bacon-wrapped dates, manchego and spinach stuffed mushrooms, tomato bread, fried chicken thighs, citrus salmon and pork shoulder and chicken paella. Each dish was delicious! We will definitely be back to try their brunch.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hzkkZ2aWL0EL-y1eX0wpGg/348s.jpg", "caption": "Manchego and Spinach-Stuffed Mushroom"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EDpXgHGwLxxWXy5IrXg25A/168s.jpg", "caption": "Paella -The picture does this dish no justice."}]}}, {"review": {"des": "We came in for Sunday brunch! Food was super good! Service was bad. <br><br>We order the bacon wrapped dates, deviled egg, spinach creepe, egg with, beef empanada, and the octopus. And the flan for desert. Plus their fresh bread is super tasty. We shared these small plates among three people. It was the perfect amount of food, and one of my favorite meals I had in Chicago! <br><br>So for the service...The woman's restroom was out of soap, I let them know. 30+ minutes later, my friend again reported that there was still no soap in the woman's restroom...gross! I hope none of the staff was using the restroom during that time. <br><br>I checked in on Yelp, which presented me with a free dessert coupon. The check in coupon did not have any restrictions listed on it. But our server said he needed to check if we could use it because it was Father's Day. Not sure why this holiday made an impact as there wasn't a special menu for the day. <br><br>Another person at our table had a $10 off coupon because she had subscribed to their newsletter. The server said he didn't think he could honor the coupon. We asked him to check. My advice to the restaurant is don't offer coupons if you don't want people to use them. All these \"chats with the manager\" took forever. Our brunch ended up being unnecessary slow and long, and wasted time on our packed day of sightseeing. But in the end they did honor the coupons.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xEzPqAPGslmgQU9TVoLraw/348s.jpg", "caption": "Natilla Flan"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v_soKowW2zDOP-ateseoBQ/168s.jpg", "caption": "Deviled Egg"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Uh95yMLMdWvgYPeGA-wrOA/168s.jpg", "caption": "Brunch"}]}}, {"review": {"des": "I have been to Cafe Ba-Ba-Reeba on multiple occasions for brunch and dinner and I never leave disappointed.<br><br>We recently had our rehearsal dinner here and our experience really blew me away. The cost per person was extremely competitive to a lot of restaurants that host rehearsal dinners. They printed our menus for us and accommodated the many dietary restrictions we had and put those on the menus as well. Just perfect. My husband and I had dropped our decorations and gifts off earlier and planned to set it up before guests arrived. When we showed up the team had already put our table decorations up and set all our gifts neatly on a table. We were so amazed and surprised and what a great job they did - all we had to do was relax before our guests arrived. Our waiter was so personable and fun and he always made sure everyone had enough food and drinks (there was A LOT of food). Perfect location for our rehearsal dinner.", "pics": null}}, {"review": {"des": "Babareeba was my first Tapas exp in Chicago about 20 yrs ago. I loved it then and cont to love it now. So many must have's but their char grilled octopus and potatas bravas are prob my favs. <br><br>Their Happy Hour Drink and Food specials are not to be missed, excellent deal.", "pics": null}}, {"review": {"des": "This is the perfect place to sample Spanish tapas. Everything comes in a smaller plate so it's recommended that you order at least two plates per person. The appetizers are individually sold so if you have a few people in your group, order more than 1.<br><br>Service was good! The staff is attentive and came by constantly to ensure that we were doing okay. <br><br>The sangrias are good here and made with fresh fruit. <br><br>There is plenty of seating within the restaurant including an outdoor patio, but it gets busy during dinner time so it's best to make a reservation beforehand to avoid the wait.<br><br>Will definitely come again!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pXO9-kEzZvu_XuA3CLGH6Q/348s.jpg", "caption": "Buttermilk-fried Chicken Thighs, Piri-piri Sauce & Shaved Vegetable Salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3mZ9rZEqATKdb5KJAinkeA/168s.jpg", "caption": "Confit Pork Shoulder, Crispy Pork Belly, Chorizo Ibérico & Chicharrónes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5M9te5uiRklpv_5RjiQhdw/168s.jpg", "caption": "Goat cheese Goat Cheese Baked in Tomato Sauce"}]}}, {"review": {"des": "This is the perfect place to go with a group of friends. You can try so many items and they have pitchers of sangria which are fantastic. We've tried just about everything on the menu over the course of 5 or 6 visits and everything was good. Nothing was good enough for me to crave it again but nothing was terrible either. W have tried the paella and it had mixed reviews. Some of us thought it was lacking flavor but others thought it was just right. I think it will strongly depends on how much spice you're use to eating. I'm always cooking with lots of spice and seasoning so for me this was not seasoned enough. <br><br>I think it's a cute place to try out at least once but it's not as exceptional as many people think. We have yet to try the brunch but that's next on our list.", "pics": null}}, {"review": {"des": "This place was the real deal. Multiple sangria options, tons of tapas to choose from, and a wonderful warm and cozy vibe, despite the fact that it's quite a large restaurant. <br><br>My friend made a reservation, which she said is a must do since this place is really popular. And it was packed when we were there, so heed my friend's advice. <br><br>We went with a pitcher of the passion fruit sangria and it was so good! A perfect amount for two people--it ends up being about 3 glasses per person. <br><br>We started with the bacon wrapped dates--delicious melt in your mouth salty sweet perfection! We also got the spicy potato wedges. Very good--loved the creamy sauce that accompanied them. We followed that up with the scallops, which our server said was one of his favorites. They were excellent. And finally we got the Brussels sprouts, which was basically a salad. Also good! <br><br>If you check in on yelp, you get a free dessert! I went with the butterscotch caramel and omg, it was amazing! Highly recommend. <br><br>I really appreciated how our server let us take our time so we could really enjoy our food and drink and not feel like we were being rushed. <br><br>If you're in the area definitely try to check this place out if you can!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hEnATG37iVP4mgu6DMyhGQ/168s.jpg", "caption": "Butterscotch caramel dessert, forgot to snap a phot before taking a bite. Just divine!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qFuo41QDRl7U_zMn90hU6w/168s.jpg", "caption": "Spicy potatoes"}]}}, {"review": {"des": "Every round we got was the same thing, that silent nod when food is so good that there's just no word. We also forgot to take pictures of half the stuff, we were so excited to eat!<br><br>Sangria: great. I got the black raspberry, a white based sangria. I'm no sangria expert, but it's one of the best I've had. <br>Burrata: phenomenal, as was the bread that came with it. <br>Cheese plate: such a great way to taste! I had never tried chorizo like that before, but all the meats and cheeses were delicious!<br>Empanada: amazing. Tasted like chicken with peppers and onions (?) and came with a great sauce. <br>Croquetas: delicious!<br><br>I can't wait to come back, since there was still so much on the menu I wanted to try! Our waitress was friendly and helpful, and the service was quick.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OdNG2ptdJ6j3FgMgIJJZhw/348s.jpg", "caption": "Burrata with Catalan Tomato Bread"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LkJYHeP27cFZEr94jMhH3A/168s.jpg", "caption": "Black Raspberry Sangria"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/R02lfDMpo6O9WYnYyztSTw/168s.jpg", "caption": "Roasted Chicken Empanada"}]}}, {"review": {"des": "WOW. If I could give this place more stars I would! My boyfriend and I came here for dinner during our second visit to Chicago and we were not disappointed. We absolutely LOVE tapas and can honestly say that Cafe Ba-Ba-Reeba is our new favorite! <br><br>We came in on a Wednesday evening and got sat after about a 1.5 hour wait. Our server, Erin, greeted us promptly and got us started with a pitcher of sangria (which poured us about 2-3 glasses each). While we were looking at the tapas she recommended that we start off with some pintxos, so we ordered the pintxos platter. Everything was bite size and super tasty - our favorite was the bacon-wrapped date! <br><br>After getting a little taste from the pintxos, we shared the brussels sprouts salad, spicy potatoes, grilled iberico pork, and the seafood paella. Everything was delicious but my personal favorite was the pork, which just melts so perfectly in your mouth. <br><br>By the end of our meal we were so full and satisfied, but then Erin kindly brought us two wonderful desserts! On top of the amazing food, drinks, and sweets here, I think that our great experience was summed up by the excellent customer service! Thanks again for everything, Erin! <br><br>We'll definitely be coming back during our next visit to Chicago!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Ea9hCeJZU6l9LFyOK-59zg/348s.jpg", "caption": "Pintxos Platter"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cR9WZuMNnpRLDaMXbV-rVQ/168s.jpg", "caption": "Complimentary desserts!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Wyn33XFtXE8G1kRBT93BHg/168s.jpg", "caption": "Seafood Paella"}]}}, {"review": {"des": "I'm such a huge fan of Cafe Ba-Ba-Reeba!! I made a lunchtime reservation a few days in advance. The restaurant seems small from outside, but it actually extends super far into the back. I loved the natural lighting in the main dining room! My waitress was super sweet - I wish I had gotten her name. She offered great recommendations and checked up on me a few times. I got handed a huge basket of delicious warm sourdough bread and couldn't stop eating it haha<br><br>Starting with my favorite dishes -<br><br>Spanish-Style Garlic Shrimp (Gambas al Ajillo) - I loved this dish in Spain, so I knew I had to try it here.A small dish with 6 shrimp sauteed in lots of garlic and chili flakes. I ate it with the complimentary bread and it was a flavor explosion! Amazing.<br><br>Grilled Octopus - Tender pieces of octopus served with green salad, chickpea purée & pimentón vinaigrette. I wouldn't have thought this flavor combo would work, but it was delicious as well.<br><br>Chorizo-Wrapped Medjool Date & Cheese - I already knew I would love this, but I wasn't prepared for how big of a date it was lol. Or maybe I've only eaten small dates before? The saltiness of the chorizo perfectly complemented the sweetness of the date and tanginess of cheese.<br><br>Seared Cana de Cabra with onion jam & membrillo honey - A thick crostini topped with a large smear of creamy goat cheese, onion jam, and honey. The flavors worked well together too.<br><br>The only dish I wouldn't order again was the Buttermilk-Fried Chicken Thighs with piri-piri sauce & shaved vegetable salad. This tasted just like buffalo chicken, nothing special.<br><br>For the Yelp Check-in for a free dessert, I ordered the Chocolate Caramel Almond Bar, which tasted like a Twix! Super sweet though.<br><br>It's so rare that I can like 4 out of the 5 dishes I order at a Tapas restaurant. Wish I came with more people so we could try more dishes, especially the Paella and Goat Cheese Baked in Tomato Sauce (omg).<br><br>One of my top 3 restaurants in Chicago! Love how I can try a variety of delicious dishes without breaking the bank!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sxYNyZ5IZR7JubusYQxmhA/348s.jpg", "caption": "Garlic Shrimp"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HIBb9tL4xNK3LJNOkLf3Ew/168s.jpg", "caption": "Seared Cana De Cabra with Onion Jam and Membrillp Honey"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ROw9Lg4bm0cSyB_7z-E5Rw/168s.jpg", "caption": "Chorizo-Wrapped Medjool Date & Cheese"}]}}, {"review": {"des": "I normally dgaf about service when it comes to reviews..I mean, I just want good grub!<br><br>However, they charge prices that I would expect not to be rushed out once we ask for the bill. They cleaned the table while we were waiting for the check, very invasively so, like reaching into our personal space. Then, the waitress could not give me 2 more mins for me to look up my lettuce eats number!<br><br>Really, it put a damper to the food experience.<br><br>The seafood paella is good but not the best I have ever had. The deviled egg is pretty delish and they earned a star there. The free Yelp check in dessert was very yummy! Affogato with some sherry instead of coffee (maybe she brought us the wrong dessert?) but it was YUUUMMMMY! Two more stars for the dessert! <br><br>Don't know if I'll return. Recommendations for good paella, anyone?<br><br>Oh! They sear some good scallops. Perfect searing.", "pics": null}}, {"review": {"des": "I want to love Cafe Ba-Ba-Reeba so badly! The concept is cool, but the reality of it is just okay.<br><br>Tapas are great, and Cafe Ba-Ba-Reeba has lots of different tapas. Unfortunately, they're kind of hit-or-miss. The \"spicy potatoes\" (patatas bravas) are really good -- they definitely remind me of Spain! But the short rib is like a weird, mini-sized beef dinner. And this wouldn't be a Spanish restaurant without paella. There's a minimum of two portions, and they're each HUGE portions. Two portions could easily feed four without any tapas on the side. The paella definitely has a smoky flavor to it, but the first time I was here, it was straight up burnt. Again, kind of hit-or-miss.<br><br>Bonus points for having a gluten free menu! But with the tapas style, it's easy to over order at this place. Each time I've been here, it's at least $30 per person, and despite the fun cultural aspect, I leave thinking there's just better out there for the money.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9cuMoExqzheGTSeva5NEPg/348s.jpg", "caption": "Red Classic Sangria"}]}}, {"review": {"des": "Very good ambiance with amazing food. I's recommend that you call them for reservation and try to get a good spot, while waiting for your table, hanging out at the bar with some snacks and good wine even worth it! This place is always packed!  The food is really good, but small portions (tapas) little expensive. Would to back on a Friday night.", "pics": null}}, {"review": {"des": "Pretty pricey compared to similar places, but great fun! Super helpful waiters when you can't decide how much your table really needs. <br><br>Always crowded. They do a good job of moving you through without your feeling rushed, which is an art!", "pics": null}}, {"review": {"des": "We recently visited Cafe Ba-Ba-Reeba twice in one week, and it has already become a standing choice for birthday celebrations or for impressing out of towners. <br><br>You should definitely get a reservation, especially if you're visiting for dinner on a weekend, as we did. This place was packed and popping both times we visited, and I'd hate to imagine what the waiting times would be like.<br><br>Tapas are best experienced in a group setting, so be sure to go with at least 4-5 people. The menu design highlights crowd favorites/chef recommendations in red, and has at least 7-8 options for vegetables, seafood, lamb, chicken, and beef. Here are some of our favorites:<br><br>1. The classic red sangria - we shared a pitcher among 4 people, and it was an instant favorite! A single class costs $7, so a pitcher for $26 is money saved.<br>2. Patatas bravas - delicious with just the right amount of spicy kick, with an addictive chipotle mayo sauce.<br>3. Goat cheese in tomato sauce - perfect comfort food! Super creamy, and perfectly paired with garlic bread.<br>4. Buffalo fried chicken - another crowd pleaser! The chicken is fried and seasoned to perfection.<br><br>Paella - our server informed us that the paella is cooked to order, and would take 30-40 minutes to prepare. The paella came out just as we had finished the tapas, and we tried the required minimum 2 servings of the seafood paella and the chicken paella. I really liked the seafood paella but I was already really full and I couldn't enjoy it as much as I'd have liked to.<br><br>Do not miss the super awesome Yelp check in offer. The free dessert is one per PERSON, not per TABLE, so we went nuts and had 6-7 dessert dishes, including the flan, the custard pudding, and the chocolate cake. The custard pudding was by far my favourite, and the dessert tapas are the perfect way to end a meal.<br><br>Service is great, and the servers are attentive, well informed, and spot on with their suggestions. If you want to split the bill amongst a number of people, please speak to the server beforehand and they'll happily accommodate you.<br><br>Both times, we split the cheque by 8, with reach person getting 2-3 tapas, a couple of glasses of sangria, a plate of paella, and a free dessert tapa, which is really reasonable!<br><br>I can't wait to dine here again!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8pkOO8C8ieLU1Oz0FIllZA/348s.jpg", "caption": "Shrimp with garlic, lemon, and oil."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/r87ibbnhorJhbZcv8OeZyQ/168s.jpg", "caption": "Burrata and bread topped with tomato chutney and arugula."}]}}, {"review": {"des": "Get the classic sangria. Just do it. This restaurant is bustling with energy and I love it. I like to go here on date nights or with friends. The small plates are great to share and order one or two at a time while you enjoy company. If you order the paella, getting only one or two other plates for the table will be good. It's a pretty big portion. If the wait time is too long, they have a massive bar area with a ton of tables and counter space which is first come, first served. On Monday's their cocktails are half off which is a great deal. Cafe Ba Ba Reeba will always be high on my list.", "pics": null}}, {"review": {"des": "Came here on a Friday evening for a happy hour drink. The front bar was packed so somebody directed us to the bar in the back. It was about 10 minutes before the back bar opened (530) but we were glad to have a seat. <br>We ordered the happy hour sangria pitcher (16 dollars) and several of the tapas. The bacon wrapped dates were AMAZING!  Other items were good as well but get the dates. We also had a dessert tapa which is how all desserts should be served.  Also saw you can get a free dessert tapa for checking in on yelp which I didn't see but definitely will next time!<br>With the pitcher, 4 tapas plus the dessert tapa (and free bread) our total with tip was around 40 dollars which is a great happy hour value in an amazing building. Can't wait to return", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/8g8qMiFr0DrfEyRIPcC9Ig/348s.jpg", "caption": "Spicy Potatoes with Tomato Aioli"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/a4VwDaDtAjC-tkabQqG6ow/168s.jpg", "caption": "Roast Dates with Bacon & Apple Vinaigrette"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ek5I_Oy0qnpBAIQd3PmSOQ/168s.jpg", "caption": "Happy hour menu"}]}}, {"review": {"des": "Going to cafe ba ba Reeba is more of an experience rather than just going out to eat. Tapas are pretty unique to begin with, but you can't go wrong with ordering here! I would definitely recommend the sangria, blue cheese steaks & goat cheese - all my favorites! It's best to order a little at a time to gage how much youll be able to eat instead of ordering all at once - you will fill up pretty fast depending on what you order! <br><br>Depending on the night I would recommend making a reservation. I came on a Saturday with the wait time of 3 hours and no reservation, and have made a reservation for a different Saturday and was able to walk right in.", "pics": null}}, {"review": {"des": "Seriously delicious!  I was here for Chicago Restaurant Week and was able to sample many of their small plates for a good cost.  The plates are tapas style, so sharing is what it's all about - even though you won't want to...  <br><br>My party had a super late reservation, but the hostess was able to get us in about an hour early (we waited at the bar for a spot to open up).  For food, we ordered the bacon wrapped dates, goat cheese in tomato sauce, deviled eggs, rioja braised short rib, seafood paella, natilla flan, and maroona almond-caramel bar.  Everything was AMAZING!  The short rib was the best thing I ate - perfectly cooked and the meat was so tender - you MUST try this!  The paella is also a wonderful dish, a hearty serving and all should try this dish too.  I thought the bacon wrapped dates were good, but not the best thing on the menu.  <br><br>Make your reservations way in advance as this is understandably a pretty busy place because of its very good food!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GDwisi7rj1Oqr7pNsduKBw/348s.jpg", "caption": "Marcona Almond-Caramel Bar and Natilla Flan"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/af8TmeDDnmULuy506GkyCQ/168s.jpg", "caption": "Seafood Paella"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Bdsn3JZwVMgWMwuymGzVZA/168s.jpg", "caption": "Bacon-Wrapped Dates and Deviled Egg with Crispy Jamón Serrano"}]}}, {"review": {"des": "Oh man this place is good! I've been here many times and walk away each time feeling full but satisfied. This is great for a nice casual dinner with friends or loved ones but can even be a nice romantic place for a date night.<br><br>The staff is always friendly and helpful if you have questions on the menu. The food is beyond delicious and brought out in a timely manner. Always make a reservation because this place fills up quickly.", "pics": null}}, {"review": {"des": "Brunch tapas should be more of a thing!!! The bacon Mac and cheese was divine, as well as the spinach crepe. Oh and the rose sangria!!", "pics": null}}, {"review": {"des": "The atmosphere is fun and great for groups but the food is very average. The breakfast sausage fried rice is good and so are the deviled eggs, solid bloody mary bar garnishes. The service is pretty slow.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JuzQIZUVZey9y4kw0L7JnQ/348s.jpg", "caption": "Bacon mac with an egg"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z2IYzZyRXXq4vZdh-zcDaw/168s.jpg", "caption": "Shrimp and grits, dont order this"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OvD8MkWXaonrwP2gugMQxw/168s.jpg", "caption": "Deviled eggs"}]}}, {"review": {"des": "Big place and always busy. Great food to chow down slowly while having conversations with friends. They brought the dish as they were prepared not all your orders at once which I think it is interesting that you can enjoy it slowly and keep the surprise coming. I would recommend this place to all.", "pics": null}}, {"review": {"des": "Overrated ass place! The food and sangria is ok but the busy-ness or hype & prices certainly do not justify the taste of the food. If you're puzzled as u read this, it's jus my opinion. Not my fault, u like getting ripped off by mediocrity. Never again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/J14VT0yZcpMbKAruV3pC8w/348s.jpg", "caption": "Rioja-braised Short Rib, Manchego Mashed Potatoes, Roasted Seasonal Vegetables & Rioja Wine Glaze"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ukyBPjlrCY_ZIhQj7nm9cA/168s.jpg", "caption": "Grilled Octopus with Mojo Verde, Potatoes, Olives, Migas"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/62VbBR_zXhvHeFPg_CjOjA/168s.jpg", "caption": "Seasonal sangria (Mango)"}]}}, {"review": {"des": "I can't believe I haven't written a review about this place! So this is the location that introduced me to Tapas. Before that I no clue about what those tasty dishes were. The first time was also for a company event, so you know what that means...loads and loads of food and drinks you dont have to pay for . I digress. Anyway I have been here several times since then. Some standout dishes I love happen to be grilled squid,beef tenderloin and the paella. Their Mojitos were great as well. Cheers to my first Tapas spot!", "pics": null}}, {"review": {"des": "The ambience is very interesting. They have nooks and corners everywhere and low lit areas alongside bright natural light section. It's perfect for date nights and also just hanging out with friends. Not overly noisy nor eerie quiet. They start you off with nice warm crusty and soft bread with Spanish EVO. So yum that I could easily be full by that. Or server was very warm and asked us before stating how much time we have and he will work our order accordingly. Of course we didn't want to rush in such a pretty place! <br>We started with bacon wrapped dates dipped in apple vinegar but it didn't live up to the hype. Missed the citrus to cut the overly sweetness and I should have opted the chorrizo wrapped dates, well next time! The passion fruit sangria is good and a popular choice I was told. <br>Next came the grilled octopus which was cooked to perfect and had subtle notes of verde and a hit of olives. Loved the dish!<br>Hanger steak with mushrooms and onions- it was medium rare as most people like it. I m not a big fan. My husband who prefers his steak over most meat.. he didn't fell for it either. <br>And then the most talked about dish- the spicy potatoes with tomato aioli. First it isn't spicy per say. But you wouldn't like it any other way. It just hit the spot. Reminds me of a popular Indian street food item - aloo chat and it brought back great food memories.<br>We took up the yelp check in offer and got the free dessert on the house. Ordered the chocolate truffle cake. It was what they promised but didn't impress my soul. I took a leap of faith and ordered the caramalized banana, o boy it was something. The caramel layer on bananas gave it a nice crunch and then there were the toasted pistachios with yummy vanilla ice cream. That was a winner! <br>We will definitely return to try a few more dishes.", "pics": null}}, {"review": {"des": "I've been here several times and never noticed that the tapas here are not all that great. Our waitress was our only highlight here.  We ordered the passion fruit sangria which was actually delicious and enjoyed it on our Anniversary Dinner.  I've been trying to get my husband to try this place and wanted him to be content with our dinner.  Our first dish arrives, spicy potatoes with tomato aioli. The potatoes were extremely dry and the sauce was exaggerated spicy. Even the sauce in Spain isn't as spicy as they were on this date. i ate two pieces and left the dish.  Our next dish was goat cheese in tomato sauce. This was not a bad decision as it was both of our only dish we enjoyed. The goat cheese was creamy and tomato was not spicy.  The third dish was Octopus with potatoes. The octopus was so mushy and tasted horrible. Another dish we had to push aside. The beef empanada arrives and at this point we are both sharing one as all we have to eat is the empanada and goat cheese. We order chicken and chorizo skewers. One bite of the chicken and I just had to stop eating.  It had an off taste and texture as if it was under-cooked. The chicken and ham croquettes were extra crispy and just didn't have a good taste.  They tasted as if they were fried, refrigerated and then refried again. <br><br>There were several birthdays and a man would come out with an silver ice bucket and bang on it loudly while singing happy birthday.  It was a bit much for my taste but the other patrons seemed to enjoy. Our waitress brought us a dessert for our anniversary which turned the bad taste in my mouth into a good one.  I contemplated writing this review as I've been here a few other locations and never had a bad experience. The waitress was absolutely pleasant and if it wasn't for her I probably would of rated this night 1 star.  I'm not sure I would be able to convince my husband to come back unfortunately.", "pics": null}}, {"review": {"des": "We were looking for a last minute place to brunch and many of the common go-to spots were booked for reservations. Ba-Ba-Reeba had openings for us so we tried it out. We sat in the patio and it was absolutely beautiful with the indirect sunshine coming through.The Bloody Mary bar was totally worth it - the spread of add-ins was unbeatable! We ordered from the brunch and regular menu of tapas. My favorites were the grilled octopus, citrus cured salmon, and the brunch menu paella (photo attached). The bread service was top quality. I'm definitely coming back to try the other tapas options. One thing I wish was different - I wish the food came out all at the same time. <br><br>If you check in on yelp, you get a free dessert tapa. PER PERSON!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nlvHxIYBJVnl3QjZnQz2mQ/348s.jpg", "caption": "Brunch menu Paella tapa"}]}}, {"review": {"des": "**Vegetarian Friendly**<br><br>Looking for a place to be on a Tuesday night? This is it! <br><br>So many great tapas style dishes to share, and so many vegetarian ones too!! I particularly enjoyed the Goat Cheese Baked in Tomato Sauce...because who doesn't love goat cheese? This was also the first place I've seen offer a vegetarian paella! <br><br>They even have tapas sized desserts, which is the perfect to round out your meal since most people just need a few bites, and not an entire dish. I especially enjoyed the Marcona Almond-Carmel Bar. <br><br>Big shout-out to our wonderful waitress, Maggie, for being the MVP of our outing. We ordered the paella, and it was bland for us. We asked her to bring some red chili flakes, but she came back with chili oil, and it brought the entire dish together!! Maggie was super friendly, very attentive, and was great at making recommendations based on our dietary needs. <br><br>Definitely make a reservation prior to going. You can reserve a table for up to 4 people through OpenTable, but any more you'll need to call the restaurant. <br><br>PS: For each person that checks in on Yelp, you get a free dessert!!", "pics": null}}, {"review": {"des": "A great tapas place!!<br><br>A group of us chose this spot to start of our girls weekend on a Friday night. Well-known for their sangria; we started off with a pitcher (or two) while looking over the menu. <br><br>The servers were extremely helpful and knew the menu inside & out. They were able to give great suggestions. Because the restaurant serves tapas, our group of 10 split into 2 groups of 5 when we ordered- to make for easier sharing. They do have a few vegetarian/vegan options on the menu- I had the moroccan chickpea stew which was so delicious. <br><br>Make sure to check in on yelp and redeem your offer for a free dessert! We did a few to share- each one was delectable. <br><br>This place was PACKED on a Friday- make sure to get reservations!", "pics": null}}, {"review": {"des": "Cafe Ba-Ba-Reeba, you tapas place you! <br><br>The deviled eggs were awesome! Probably my favorite brunch pintxos, and probably my favorite deviled eggs I've tasted in any restaurant I've been in. Estupenda (wait, that is correct Spanish, right?).<br><br>Moving on, I ordered the Spanish Shrimp & Grits. Oh man, that chorizo polenta...how can I put this: SENSATIONAL! The shrimp, the polenta grit, the flavor bombarding your taste buds. Just heaven.<br><br>We also got the mac n cheese and the iberico ham hash, the dishes was good in flavor...but nothing out of the ordinary like the shrimp and grits. By that though, they were still good, but not as mind blowing.<br><br>The Spanish cubano is as amazing. That pork should was jam-packed with flavor. I could eat that all day.<br><br>At this point, we should have probably stopped eating, but we don't have self discipline when it comes to food, so we ate on with the paella. It could probably feed an army. They don't joke around with their paella. It is a must cause at this point I was having trouble breathing from all the food consumption that was done previously to this dish. But, for me to still think this plate is delicious must say something good about it cause when you're about to vomit no food taste good...except this paella. That sausage was so amazing and the beef was so tender. Legit!<br><br>The only down thing was the french toast, we did not enjoy it as much because it was a bit too toasted, like burnt almost. French toast should not be that toasty. But, overall, I still love this place.<br><br>Oh and do get their sangria. It is phenomenal.", "pics": null}}, {"review": {"des": "Cafe Ba-Ba-Reeba is the restaurant in Chicago that I've been to the most. They have the best happy hour in the city. Between 4-6pm everyday in the bar area, you can get very inexpensive tapas and $16 pitchers of their classic red sangria. My favorite item here is the spicy potatoes. If you like crisp potatoes and a kick of heat, this place is it and they serve it up with a spicy aioli. They have a wonderful Moroccan chickpea stew that's very comforting especially during the winter time. I used to love their Catatalan bread with ripe tomato & garlic but they changed the bread to be the same as the one they serve in their bread basket and it doesn't work nearly as well. I've not had the beef empanada or chicken and ham croquetas from the happy hour but have heard they're good.<br><br>From the general menu, there are many amazing dishes. I've had almost every dish from the vegetarian and seafood sections. My favorite vegetarian options that I haven't already mentioned are the burrata, potato & onion omelette, and goat cheese baked in tomato sauce. For seafood, I strongly recommend the grilled octopus, shrimp with garlic, and fried calamari. <br><br>This place is great for groups and gets busy during peak hours. Something annoying that happens in the bar area is that other guests wait nearby and sometimes will come to you and ask if you're about done because they want your seats.", "pics": null}}, {"review": {"des": "I love the idea of trying a little of a lot of different things! There are so many things to choose from, It was hard to decide. It's definitely the place you go and order a bunch of things and have to go back and order a totally different spread of items, unless one from before really stuck with you (mine was the chorizo wrapped date). I didn't get to try the sangria, which I heard is a MUST. The spicy potatoes were something to talk about, and everything else was yummy, but I wouldn't mind replacing them with all new things next time around", "pics": null}}, {"review": {"des": "This restaurant was a great place to visit after a busy day of exploring the city.  We arrived in the late evening on a Saturday night. The restaurant was very busy, and there was a wait to get a table. Luckily, since there was only two of us we were able to grab a couple of seats at the bar. <br><br>We started our feast with white peach sangria. This was an excellent choice, as there was a large amount of fresh fruit in the sangria that gave it a deliciously crisp flavor. <br><br>We decided to split some of their tapas dishes, which I highly recommend doing when you visit. The spicy potatoes with tomato aioli were just the right amount of crispiness.  The spice level of the potatoes was manageable, but I do like spicy foods.  We each ordered our own beef empanada, and this was a solid choice.  The pastry crust of the empanada was just the right amount of flakey, and the filling was well seasoned.  My favorite tapas dish we ordered was the buttermilk fried chicken thighs with piri piri sauce.  The chicken and sauce paired beautifully together for a delicious flavor.  Cafe Ba Ba Reeba has a fun, lively atmosphere and I highly recommend checking it out.", "pics": null}}, {"review": {"des": "Okay, Cafe Ba-Ba-Reeba is probably one of my favorite Chicago dining experiences since moving here. We snagged a reservation for 4 on a Saturday night, and even though the place was packed, our server was really attentive and helpful. <br><br>It was SO hard to choose what to order. Those of you who are indecisive about food can empathize. My husband and I ended up splitting the fried green peppers, the beef empanada, the citrus-cured salmon, the garlic shrimp, and the fried calamari. We also checked in on Yelp and scored free desserts, the chocolate truffle cake and the butterscotch custard. Everything was delicious; I think our top favorites were the fried green peppers, the salmon, and the calamari. <br><br>I'm dying to go back just because their menu is so huge and I'm a sucker for tapas. Their drinks also looked spectacular. Hopefully those green peppers and I will be reunited soon.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/sv6krjDzvmLNiRvMblg38g/348s.jpg", "caption": "Beef empanada"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vk8mpyL9ajbyTjah3CmCnQ/168s.jpg", "caption": "Calamari"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p1qEMT0FiOshEGwO6PYiTA/168s.jpg", "caption": "Garlic shrimp"}]}}, {"review": {"des": "Wow- yes, wow! We were lucky enough to stumble in for brunch and it was even better than we had hoped. We started with a breakfast combination that did not disappoint. The deviled egg, the yogurt bowl, the frittata were all good. The French toast and the waffle/chicken were outstanding! Two of us shared a pitcher of passion fruit sangria and enjoyed every drop. Both the macaroni and cheese and beef empanada were winners as well. There were many more things to try on the menu and I'm looking forward to a return visit.", "pics": null}}, {"review": {"des": "I've been going to Ba-Ba-Reeba for 10 years.  The service and food are consistently very good.  If you're in the mood for Spanish tapas, you can't go wrong.", "pics": null}}, {"review": {"des": "Food was hit or miss--the veggies in the veggie eggs Benedict were over cooked in my opinion. The waffles with berries were great and the chorizo paella was very yummy. Was rather annoyed because I wanted to swap out the automatic papas bravas for a different side (same price) because I don't eat potatoes but was told no and I could only swap for a different kind of potato. Also my coffee mug was served extremely dirty.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oy16gqUCTVJKb9G_dSUkWw/348s.jpg", "caption": "Chorizo paella"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/VLyWk02YgJAVZk16LHWECQ/168s.jpg", "caption": "Waffles with berries"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ZzwxSAve8i5nmdHMkz-9sg/168s.jpg", "caption": "Veggie Eggs Benedict"}]}}, {"review": {"des": "I came here with a friend at 7:30, on a Tuesday. The restaurant seemed busy and would require 30 mins wait for table. We chose to sat at the bar. It was quite noisy but that did not bother us, as a tapas place should be like that. Decor was ok, food was ok, we had the passion fruit sangria which was good. I think the food lack authenticity and the light was not helping to showcase the food.<br><br>I think overall it was ok neighborhood place, but not special worth a trip to go to.", "pics": null}}, {"review": {"des": "I've been here for dinner several times over the past year and a couple times for brunch.  Food is always fantastic!<br><br>This last time I went for dinner, service was above and beyond. Thank you so much Hector for being so knowledgeable about gluten free diets.  I recently started a gluten free diet and am still figuring out what I can and cannot eat/drink.  He checked with the bar that the drink I ordered didn't have gluten since he was concerned that the vodka might contain gluten but it turned out that the drink was gluten free.  He brought out gluten free bread for me as well as a gluten free menu.  It seemed a little slower than usual that night so he told me that if there weren't any options on the gluten free menu that I liked, he could talk to the chef about making some of the other dishes for me gluten free (SO SWEET!).  <br><br>I had no problems finding tasty dishes on the gluten free menu though.  As dishes were brought out, Hector would come to let us know which ones were safe for me to eat and which weren't gluten free.  Partway through the meal he brought freshly toasted gluten free bread for me since he explained, \"this gluten free bread doesn't taste so good once it's cold.\"<br><br>We ordered the pork paella as well and asked to add chicken too.  When our order came out, there was no chicken in it but we weren't going to say anything about the chicken not being in the entree. The paella is amazing though. It's the only thing I have to eat every time.  At the end of our meal, Hector comes back with a trio of desserts and tells us, \"I realized I forgot to put chicken in your paella so I know this isn't the same but please have these desserts on us.\"  He had a gluten free chocolate cake, mango (or was it peach?) sorbet and a fruit empanada.  <br><br>Cafe Ba-Ba-Reeba, if you read this, please make sure Hector gets a bonus or some recognition that he's doing the most amazing job.", "pics": null}}, {"review": {"des": "What a gem! Love this place! Great food, fast service. <br>We were seated fairly quickly in the back, the area had skylights so it felt open.", "pics": null}}, {"review": {"des": "Dined in a few times and have really enjoyed my experience. The servers are very accommodating and friendly. Drinks, especially the sangria are really good. And the food has always been great quality. <br>My favorites include the spicy potatoes, iberico pork and bacon wrapped dates. Overall, this is and excellent place to share tapas.", "pics": null}}, {"review": {"des": "A bit disappointed considering all the great reviews of this place! If I am rating for taste alone, I'd say the place is a solid 4/5. <br>The spicy potatoes were good -- 5/5. The smoked salmon was a bit of a let down, not the best but not the worst -- 3.5/5. The shrimp was mediocre and not very flavorful for me, but it's ceviche style so others may enjoy it -- 3/5. The scallops tasted pretty good -- 4/5. The grilled hanger steak tasted good too, but then got really hard to chew -- 4/5. Finally, the chicken empanada was pretty good but you literally get 1 for $6.50-- 5/5 for taste though. <br>Overall, I take off a star and give it a 3/5 because the portions for the price is not very worth it. I know it's a tapas place but a little ridiculous for some of the dishes!", "pics": null}}, {"review": {"des": "Favorite tapas place ever and a favorite place to eat in the city! Never had a dish I didn't like or finish. The patatas bravas are a staple I have to get each time. And service is always super friendly and comes around consistently to take new orders for your small plates!", "pics": null}}, {"review": {"des": "Delicious food and well prepared. Chill restaurant, excellent sangria, super friendly staff. <br><br>Highly recommend the scallops and deviled egg.", "pics": null}}, {"review": {"des": "I totally love this place! The decor and vibe are amazing and upbeat, the sangria is completely perfect and the food is just amazing!  I went here with a bunch of vegetarians and all we ate were patatas bravas and that cheese and tomato sauce dish - whatever that's called. Please don't ever do that to yourself here! Enjoy the octopus and lamb and all of the other foods on the menu. This is not a place to deprive yourself of the full menu!", "pics": null}}, {"review": {"des": "My new favorite brunch place! Both great interior and selections. More for special occasions, but tapas dishes are relatively large. Waiter recommended 3 tapas dishes per person but I recommend 2 for smaller appetites.<br><br>Lincoln Park has so many great brunch places to compete for my Sunday mornings. On this particular day, my friend and I were planning on eating at another place nearby, but it had an hour long wait with no waiting area (and it had already climbed to humid ~80 degrees outside). Cafe Ba-Ba-Reeba saved our lives because not only was there no wait on a busy Sunday morning, it had a well ventilated, gorgeous interior with both sunlit rooms and more intimate dim-light areas. Because it felt so big, it was never nearly as noisy as the cramped brunch place we tried earlier. <br><br>We came around 10:30 and they were serving both brunch and lunch. Our favorites were the Citrus French Toast with Goat Cheese, Spicy Potato with Tomato Aioli, and Buttermilk Fried Chicken with Piri-piri Sauce. The potatoes had a kick (not spicy) and the aioli captured tang and creaminess. The fried chicken wasn't very crispy but was delicious with the cool, also tangy sauce. And spreading goat cheese on french toast--genius! Wasn't a huge fan of the lamb kebabs because it was saltier and drier than I expected.", "pics": null}}, {"review": {"des": "Best tapas ever. I love everything about this place.<br>Sangria is so good. Staff is great. I love to just hang out at the bar . Sometimes there is no need to have a table you can actually eat at the bar. I recommend  red sangria. Gambas and los pinchos so yummy!", "pics": null}}, {"review": {"des": "Always a lively, upbeat and delicious experience! My boyfriend and I had our first date here and go back every now and then for drinks/apps. Try to snag a table outside if you can (inside can get extremely loud). Great place for a date, so you can sample different small plates and have fun trying new things - incredible menu and sangria pitcher.", "pics": null}}, {"review": {"des": "EVERYTHING IS GOOD. I've been here twice on different visits to Chicago and will keep coming back. Sangria is ahhmazing and food is even better. The prices are all reasonable and you get to try several things on the menu (tapas) so it works out well. For two of us, we ordered 4 tapas and weren't quite able to finish it all, but was totally worth getting to taste the dishes. The atmosphere is pretty \"hipster\" but also family friendly. Highly recommend!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/N1yh4D3t6M9Y6fO1pY9ueA/348s.jpg", "caption": "Black raspberry sangria. Delicious!"}]}}, {"review": {"des": "Amazing find by my Lil Sis- so happy to have found this place. Just visiting from the East Coast and we have kicking Tapas place there and this can be a good competition-  I will come back here and bring the other folks for the great delicious food, very good presentation, awesome service esp Tabatha.  So impressed!  <br>Featured in this photo is the Nutella Flan & Caramelized Banana w/ Pistachios. Must try!!!", "pics": null}}, {"review": {"des": "I love tapas so I was super stoked to come here with my girlfriends. Something about eating family style and shared plates that help people get to know each other better. The place is lively and a great place to party or celebrate an occasion. <br><br>We ordered a lot of things and my favorites were the seafood paella and the octopus appetizer. While the food was not the best that I've had it was good food for the price! <br><br>Overall, this place has good food and is a great place to gather!", "pics": null}}, {"review": {"des": "Ashley W is the best waiter. Absolutely loved her. The food was super good. I was waiting to come her for a while but somehow never visited.<br><br>Get: Grilled hangar steak, meatballs, fried green peppers, Brussels sprouts salad, shrimp, chicken peri peri. <br><br>Skip: Pork & chicken and chorizo skewer. <br><br>Sangria:  house red and cava were great. Mango was super sugary and a bit tart. <br><br>*** Note*** they offer half pitchers here, so if you get two glasses of sangria you may as well ask for a half for a dollar more. The bartender neglected to inform us when we purchased two glasses waiting for our table. This pissed me off once I found out, but otherwise I had a great time. <br><br>This place is worth the hype.", "pics": null}}]}