{"name": "girl-and-the-goat-chicago", "reviews": [{"review": {"des": "Arguably one of the best and well known restaurants in Chicago, reservations are hard to come by and the waitlist could be up to 3 months.<br><br>Stephanie Izard has created and sustained one of the hottest and most sought after seatings in all of Chicago. Tourists and locals alike continually flock here to indulge in her innovative menu with bold flavors, intricate platings, and wonderful combinations of flavors and textures. Dishes are tapas style designed to be shared by the table. Your server will tailor the progression of the dishes you order to build on flavors throughout the meal, ultimately reaching a crescendo with the final dish.<br><br>I love the hamachi crudo. It's got a chili-soy vinaigrette, finger hots, gooseberries, puffed black rice, and garnished with some microgreens. The hamachi is fresh, tender, and has a bit of a kick from the vinaigrette. The black rice adds a crunch to the dish.<br><br>The seared scallops are cooked perfectly. Each order only has 3 scallops, so plan accordingly based on your party size. There's also wild maitake and wood ear mushrooms, oyster sauce brodo, and a squash brandade. <br><br>The wood oven roasted pig face is perhaps the signature dish on the menu. There's a sunny side egg placed on top, with crispy potato sticks on the bottom. The pig face is crispy, fatty, and tender. It blends well with the potato sticks and egg.<br><br>The confit goat belly is absolutely unreal. It's got bourbon butter slathered over the entire dish, which is fantastic. There's also lump crab and lobster chunks. The goat is melt in your mouth tender, and the seafood is perfection.<br><br>The crisp braised pork shank is usually the finishing salvo of your menu, if you order it, and it's a must order. The pork is crispy on the outside and fall off the bone tender inside. It requires very minimal effort to extract meat off the bone, and the meat is so juicy, flavorful and tender.<br><br>Everything on the menu is executed flawlessly and there isn't such a thing as a bad dish. The above are just some personal favorites I get each time I visit. Even the roasted cauliflower is a must order. Other dishes that I recommend are the goat carpaccio, goat empanadas, and wood fired octopus. For dessert, get the semifreddo and toffee yummy cake. Both are so good you won't be able to pick which one's your favorite.<br><br>The service is wonderful and very helpful. Be advised that the reservations have a set time limit before they have to turn around the table, which is totally understandable given how in demand a seat here is. If you're lucky enough to sit near the kitchen, you might even be able to catch the legendary chef Izard herself checking each and every plate before they go out.", "pics": null}}, {"review": {"des": "A must visit if visiting Chicago west loop area. Reserve ahead as they're generally fully booked. They do serve full menu at the lounge seating or bar area as well. We couldn't get a reservation ahead of time so we went and waited in the lounge area and managed to get a table within 45 minutes on a Wednesday. <br>Service: we got seated at the chefs table, the server checked on us a few times. We were served all meals within 10 minutes of placing the order<br>Ambience: cozy, romantic, not too loud<br>Food: everything we got was delicious. This is a great place for veggie lovers. <br>We got the green beans- delicious! The pierogis, beet salad, and pan fried shishito peppers were outstanding!<br>For main course we tried the branzino, was alright. I loved the pavlova for dessert.<br><br>All in all, one of the best experiences in dining at Chicago", "pics": null}}, {"review": {"des": "This is truly one of the best restaurants I've been to, in terms of food quality. We were lucky to get a reservation only a week in advance on Sunday at 5:30 PM. The place was already crowded when we got there. We sat in the corner where there's the huge picture of a girl and a goat in gothic style. It looks like a very cool place. We quickly ordered a few items from the menu which we have already chosen from looking at pictures and reviews on Yelp. We went for the goat liver mousse, scallops, goat ribs, wood fire octopus and duck tartare. <br><br>Everything was delicious! It's very unique and has interesting combinations incorporating Asian fusion and influence. These are dishes that you wouldn't typically see at other restaurants so I was very excited to try, and of course they didn't disappoint. The goat liver mousse was so smooth and the bread was warm and yummy. We had to ask for more bread since we finished it so quickly. They saw that we had 3 people so they asked if we want 3 scallops instead of 2. They just charged for the extra scallops. They were cooked perfectly. The goat ribs were very soft and felt off the bones. The octopus was pretty good but that didn't seem too creative compared to the other ones. I also had duck tartare for the first time and the duck didn't taste too strong or anything. <br><br>We were very happy with the food itself overall but quite disappointed at the service. The server seems inattentive and sometimes when we asked for something, he doesn't seem too enthusiastic to get it for us. I understand maybe because the place was crowded but still it makes our experience a bit less satisfying, hence the 4 stars. <br><br>We ended order one more dish, the roasted pig face since there was so much hype about it. When it was brought out, we were told to mix everything up, the uglier the better. So we did just that! It was creamy and very rich and heavy. I think it tasted good but a bit too much and not too balanced. They probably need more veggies stuff in there. And while I ate it, I keep thinking of a Vietnamese dish that I love that I usually mix up the rice, bbq pork, eggs and vegetables. <br><br>Overall, 5 stars for food and 3 stars for service.", "pics": null}}, {"review": {"des": "Honestly what a great tapas place. Definitely recommend coming, as if it wasn't already obvious by the thousands of reviews and still a great rating.<br><br>My friends and I shared the yuzu bread, duck tartare, fried oysters, sauteed green beans, and goat empanadas. Definitely thought the duck tartare was my favorite out of the dishes we ordered, but all were so wonderfully flavorful and delicious that I wanted more after we finished each dish.<br><br>I got the pineapple right side up drink. As someone who hates the taste of alcohol, it was great because it was a very sweet drink.<br><br>They are also great about servicing coats in the winter, we got a rack on the side to hang all of our extras from peeling off our layers when we sat down.", "pics": null}}, {"review": {"des": "Girl & the Goat might just be one of the best dining experiences I've ever had. <br><br>After unsuccessfully trying to make last minute reservations via OpenDoor and by calling in, we decided to stop in to see if they could accommodate our table of two. It was shortly after opening and the hosts we friendly and gracious and explained they would be able to seat us right away, but would need our table back at six (it was 4:45, so no problem there). <br><br>The service was top notch. Our server, Kalee, was awesome. Friendly, prompt, quick to explain the process, drink and food menu, and recommendations. The dishes were perfectly timed in delivery, and the runners bringing the food were cheerful and always explained what they were delivering.<br><br>The food was absolutely out of this world. You know that show \"the Best Thing I Ever Ate\"... well, at least two of the many dishes we ordered would easily been my list if I were to ever be on the show. The spiced shrimp with tempura delicata squash... man, I've been dreaming about that squash ever since! The goat belly confit with lumps of crab and lobster bathed in browned bourbon butter was my absolute favorite of the evening. I would drive back to Chicago today if it meant I could eat it again.<br><br>This was an overall amazing experience, and we cannot wait to return!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/j0aLHGvniR5uvPrW0eFUEQ/348s.jpg", "caption": "Arctic char"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UxTpCTW15gGX9BgZ9P3bRw/168s.jpg", "caption": "Apple of my rye bread board. Blue cheese butter with Apple/spiced pecan mince."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9D364dNBimI9m6uNPKq_uw/168s.jpg", "caption": "Spiced shrimp with tempura delicata squash. So delicious!"}]}}, {"review": {"des": "I read the Yelp reviews for this place prior to arriving in Chicago and I knew I had to add it to my list. I'm so glad I did because we enjoyed the experience. <br><br>We lucked out and found a Friday night reservation on OpenTable the night we wanted to try this place out. It must have been luck because there was only one reservation left and we snatched it up without a second thought. <br><br>Upon arrival, we were seated in a seat within such close proximity to other diners. We asked the host to move our seat and he did make an effort to move us, but the next seat was honestly no better than the original. Seems like all the seating here is very tight and that was something that truly bothered us. We heard the entire conversation of the people next to us. That is a little too close for comfort. <br><br>Thank goodness the food made us forget about the poor seating arrangements. Everything we ordered was amazing! We ordered a total of four plates and dessert. The food was incredible but we honestly left the restaurant still hungry. The portion of the plates is just enough to get the taste. Our waiter recommended we do four plates but honestly we still had plenty of room to eat more. However, the four plates were so perfect that we were still satisfied. <br><br>I would add this place to your list if you are ever visiting Chicago. Minus the seating, it was a five star experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-5k5OAKLhlDoqyafi8zzNQ/348s.jpg", "caption": "Scallops"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RC2WFQEo1Ojs1DIDkcZBIA/168s.jpg", "caption": "Goat empanadas"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/v8EvyHuLk_QWsXpe9xbrvw/168s.jpg", "caption": "Broccoli"}]}}, {"review": {"des": "So we finally come to this juncture! Arguably one of the most famous restaurants that I've been wanting to visit for months now. So, was it worth the anticipation, wait and excitement!??!  Let's find out :)<br><br>Ambiance : We arrived for dinner and with the rather dim lighting, dark wood furnishings, the outlook was all very dark toned, almost Black. Interesting choice of presentation and Im sure during the day it'll look much better. I did though absolutely adore that cute little Goat motif in the center of the dining room wall.<br><br>Service : Considering it was a Friday night dinner, suffice to say the place was packed to the brim! We did have reservations though so got a neat little corner within 20 mins (I shudder at the thought of coming here as Walk Ins!!). Once seated though, the service was prompt and pleasant. <br><br>Food : We got ourselves a portion each of Goat Empanadas, Confit Goat Belly, Wood Fired Lamb Ribs and Wood Fired Oysters.<br><br>The Goat Empanadas were fried to perfection, the shell not too thick and the meat succulent although lacking a punch in flavor. <br><br>The Goat Belly was an interesting setup as I've never paired goat with seafood, let alone Lobster and Crab for that matter! The belly itself was cooked just right and as all Belly dishes go (Pork or Goat), it needs something to counter or balance that fattiness. Sadly with milder protein like crab and lobster, it just got lost and up being a one tangent dish. The bourbon butter though was exquisite!<br><br>The oysters were smoked to perfection. For a second, they almost looked raw :). The spice was well done and overall it was a decent dish<br><br>The lamb ribs were one of our favorite dishes of the night! Fall of the bone and the thick sauce coating is how you typically expect a well made ribs to be. <br><br>We ended our evening with a portion of their Aw Honey Honey dessert. A very very playful dish with tartness from the gooseberry going toe to toe with sweetness from the mousse and sponge. It wasn't an awe inspiring dish but a good one nonetheless.<br><br>This has been a long review but so was our wait to try this place. Now to answer my first question, it was ALMOST worth it. Nothing wrong with the dishes as such. I guess judging by all the ovations and glowing reviews, my expectations were inclined as such as well.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jlzrNTWWlHKTdQTHBDA1jQ/168s.jpg", "caption": "Lamb Ribs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0l5oihyYn1OAlHBxYCqlKA/168s.jpg", "caption": "Confit Goat Belly"}]}}, {"review": {"des": "Second time around, I took my boyfriend and we shared the duck tartare, goat empanadas, and lamb ribs. <br><br>The duck tartare is just slightly more chewy than raw fish and has a mild taste. It's served with duck fat crackers to add a nice crunch. There are elements of sweetness and smokiness from the complimentary ingredients and together they create a balanced dish. <br><br>The goat empanadas are fried to perfection and the breading has a lightness to it. The goat meat is juicy and well marinated. I love the creamy sauce that it comes with! <br><br>Our fave of the night was the lamb ribs. They are so tender that when you try to grab the rib, the meat literally just falls off and you end up have to use your fork and knife lol! The sauce has an asian flare, probably from the tamarind. Best part of the meat is the juicy fat. Yum! <br><br>Our waitress Kalee was so sweet and helpful and sent out a complimentary anniversary dessert, caramel corn and malt balls (she knew it was my favorite of their desserts).", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qNu-MO69taLXvU8EpuUXcg/348s.jpg", "caption": "Duck tartare"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/48JStZSxyOJIkVLidsrMkQ/168s.jpg", "caption": "Lamb ribs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8FCxKEm4JHUXxDaMgSjevg/168s.jpg", "caption": "Scallops!"}]}}, {"review": {"des": "If there is one restaurant to try in Chicago, Chef Izard's Girl and the Goat ought to be it. The food is rustic and combines fusion elements from all over the world. Those influences from Mexico, Southeast Asia, China, and Europe struck me the most.<br><br>To start things off, their cocktails are must tries. \"It's Always in Oaxaca\", a citrus-infused Mezcal drink brimmed with salt and chili powder, really hit the spot and gave the drink a pleasant kick.<br><br>The Lamb Ribs were our favorite. Smothered in a combination of house BBQ and a sweet and tangy berry reduction, the meat was both tender and savory. Other highlights included the Wood Fired Octopus and Roasted Cauliflower. The inspiration for the octopus, sitting on top a layer of mole and pickled squash, hinted Mexican and definitely surprised us in a very pleasant way. For the Cauliflower, absolutely addictive, I simply couldn't stop eating it.<br><br>The waitress also recommended Goat Empanadas, Pig Face and Duck Tongue, both are their signature dishes as well as their desserts. Honestly, I was not impressed by them and thought they were bland and quite forgettable compared to the bolder flavors of the other dishes. <br><br>My verdict: definitely worth a try for the uninitiated as the chef has certainly introduced new, exciting flavors to my palate and their cocktails are simply amazing. However, at this price point, I would be slightly hesitant to return again.", "pics": null}}, {"review": {"des": "Amazing experience here! I already made a second reservation for the end of the month and I am counting down the days! Some items we loved include the shishito peppers (10/10), muscles (9/10), pig face(10/10), calamari bruschetta (10/10), and the caramel corn dessert! These 5 items (plus a couple old fashions) had us feeling full and like we went around the world to try different items.  The atmosphere here is really fantastic and that is due to the cheerfulness of our server and her great recommendations.  I also think that since its so hard to get into this spot, all of the diners are relaxed and enjoyed everything Girl & the Goat has to offer.  Can't wait to return in a couple weeks.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PSMbiDaKs90Igw9Xbl30NA/168s.jpg", "caption": "caramel corn with chocolate AND ice cream"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QVSTu1E8K9ZHZ_F-2HXrNw/168s.jpg", "caption": "calamari bruschetta... love the goat cheese touch"}]}}, {"review": {"des": "Book your reservations at least a month in advance if you want to come eat here! Even so, it was difficult to get a good time. I ended up getting an 8:30pm reservation on a Monday night for three. Upon arrival, we were seated immediately though.<br><br>Between the three of us, we shared six dishes: Hamachi Crudo ($16), Roasted Cauliflower ($13), Wood Fired Octopus ($19), Wood Fired Whole Branzino ($26), Grilled Beef Short Ribs ($19), and Wood Fired Lamb Ribs ($22). Their portions are on the smaller side and they bring out your dishes one by one from lightest to heaviest.<br><br>Simply said, the crudo was light and refreshing to start. Since you always need some veggies, the cauliflower was a nice addition mixed in with a sour flavor from the pickled peppers. The octopus and branzino were flavorful with a smokey, roasted flavor. Now my favorites were the last two, shorts ribs and lamb ribs. I'm just a huge meat lover, so these dishes were amazing. The short ribs were similar to when you get kalbi at a Korean restaurant, but the pairing of the apple salad was a good contrast. As for the lamb ribs, they were incredibly tender. It fell off the bone so easily that you had to lift the piece of meat onto your plate. The glaze on this was smooth and truly wrapped flavor all over the meat with no dry parts. This was definitely my favorite pick and only wished there were more than just 4 pieces of ribs.<br><br>Girl and the Goat is one of those place you just need to check out at least once. The menu provides and array of dishes done in a creative manner. Although nothing completely wowed me, it was still a great meal and a chance to say you've been here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4DMYfFuCa7dFT8_qFI9zQg/348s.jpg", "caption": "Roasted Cauliflower."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/xJa9BNcv-yQAP4SYReHGxA/168s.jpg", "caption": "Wood Fired Whole Branzino."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/KsWz1t_iWGd-VuamHHltZg/168s.jpg", "caption": "Grilled Beef Short Ribs."}]}}, {"review": {"des": "Where to begin?  I was bummed to learn that Alinea only has one single top reservation available on any given day and I didn't get it. I was lamenting this policy to a friend and former Chicagoan when she said, \"Get a reservation at Girl and the Goat.\"  I had never heard of this place. I made a reservation two months ahead of my trip and, long story short, by coincidence, so did she. We ended up adding me on to her party of five and that was fortuitous, because it allowed me to try nearly every item on the menu!  The bad news for you, dear reader, is that I didn't take pics of anything. I just enjoyed the experience, and what an experience it was!  This was culinary mastery!  <br><br>Some highlights: the hamachi crudo. The textural play of butter soft hamachi, crisp puffed black rice and spicy vinaigrette was magic on the tongue. We had two of these. <br><br>The oysters: shigoku oysters with a ponzu mignonette. Again combining flavors of light brine, creamy oyster, spicy citrus mignonette. Devine. We had two orders. <br><br>Chickpea fritter chaat:  crisp outer shell, creamiest of creamy interiors, amazing flavor!  Again, we ordered a second round. <br><br>The spiced shrimp: honestly, my favorite part was the tempura delicata squash, but overall the dish was amazing. <br><br>And the overall favorite: the braised beef tongue. I'm of Mexican American descent, so I've had beef tongue multiple times. This was next level!  Thankfully, everyone at the table was adventurous and willing to try and every person there felt this was the winning dish. The slices of beef were so incredibly tender and well flavored and the crisp masa \"chips\" and tangy salsa verde just highlighted how special this dish was. <br><br>We tried many other items, too many to list. Everything was delicious. I would go back every day if I could. The overall bill was also a surprise. I would have thought it would have been much more. It was $525 for six adults, including two bottles of wine and three cocktails. We are like kings!", "pics": null}}, {"review": {"des": "Great spot in Chicago accessible by the elevated train. It's a tough seat to get but if you arrive at opening at 5 pm it's quite easy to sit at the bar and get the same menu as at the tables. Service was great. Explanation of everything on the menu and on any of our questions. They offer up daily specials as well.<br><br>Highlights for me was the pig face entree. Perfectly porky fried up on a flat plate with a runny egg that was perfectly cooked. The pork was flavorful with the right amount of collagen and protein coming through. The scallop dish was also wonderful. Fresh scallops that matched up well with the rest of the dish. Even the dessert was very creative with it's popcorn, marshmellow, and milk ice cream that satisfied at the end. <br><br>Highly recommend.", "pics": null}}, {"review": {"des": "Is the staff good? Yes ish. Is it constantly busy? Yes def. Is the food good? Yes ish. So why the three stars? Well, with all the hype Girl & the Goat gets, it simply wasn't spectacular in any sense. In fact, my Airbnb host told me to cancel my reservation when he heard I snagged a seat here. To my regret, I didn't. <br><br>As soon as we were seated, we were promptly neglected. Our waitress was running around trying to get to all her tables, and we were awkwardly seated right behind the hostess desk. I literally had to wave down another waiter to get our waitresses attention. After that snafu, however, she constantly checked in on us. Provided an app on the house when our food took extra long. Def made up for it. <br><br>The food, however, never really made up for the wait. If I need to wait 40+mins for the branzino, my hope is that it's gonna be amazinggggg. But it wasn't. AND our two veggie bowls came out before our entrees. So much earlier than our entrees, that we literally finished all the veggies before any of our protein arrived. It was disappointing in terms of how the food arrived. <br><br>Probably should've listened to my Airbnb host. Most likely wouldn't return. 3 stars.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-YZQ7lDndrWyG4LUakjPgw/348s.jpg", "caption": "Wood Fired Whole Branzino"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/a0NCFg_PWp3Y0syMm8hyOA/168s.jpg", "caption": "Confit Goat Belly"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/D3eXONaBoUZQ6wAUs0onDA/168s.jpg", "caption": "Smoked Apple Pierogies"}]}}, {"review": {"des": "Ever since I watched Top Chef more than 8 years ago, I've had this spot bookmarked on my Yelp page. It's been sitting in the \"To Try\" section until now. I've finally crossed this one off the bucket list, and with all the expectations that had built up over the years, I have to say that it exceeded mine.<br><br>The menu is set up to be shared family-style and we enjoyed picking a bunch of plates to share. The style seemed to be a modern twist on comfort food, which is something we enjoy. We ordered a couple of vegetable dishes including the sauteed green beans ($13) and the roasted cauliflower ($13). For something so simple like greenbeans and cauliflower, our tastebuds were blown away from the get-go. The green beans had a great fish sauce vinaigrette and the cashews gave it an Asian-inspired flavor. The cauliflower with pickled peppers, pine nuts and mints all blended well together. Who would've thought that mint would go well with cauliflower? And unlike most cauliflower dishes, this one didn't stink (maybe the mint helped?)!<br><br>For our fish dish, we got the seared scallops ($19) with wild maitake and wood ears, oyster sauce brodo, and squash brandade. Very well seared and flavorful. As the name implied, we had to get a couple of goat dishes and went with the goat empanadas ($16) and the confit goat belly ($19). We loved the flavor of the goat in the empanadas as it wasn't too gamey or heavy. The miso bleu aioli, grilled pickled beech mushrooms, and queso fresco, brightened up the dish. The confit goat belly was probably my least favorite dish because it was so heavy with the bourbon butter, which coated all of the goat belly, lobster, crab, and fennel.<br><br>A couple pork dishes stood out with the wood oven roasted pig face ($19) as well as the must-order crisp braised pork shank ($26). I thought these were two of the best plates. The pig face had a perfect sunny side up egg and served with tamarind, cilantro, red wine-maple, and crispy potato stix. The shank was probably my favorite dish of the evening - the skin was so crunchy and I loved that spicy sauce, buttermilk dressing and served with butternut squash kimchi and naan.<br><br>As with most places, I dreaded that dessert my ruin the wonderful meal. But, surprisingly, the desserts stood out just as much as the main courses. The chocolate pavlova says-a-me! ($11) had a perfect texture and we loved the black sesame brittle & ice cream that went with the caramel chocolate sauce and sesame whip. My favorite might have to be the sticky tasty crunchy toffee yummy cake ($11), which deserves every single one of those descriptors. The sweet potato with miso caramel whip and pickled persimmon went very well with the sour cream ice cream, which gave it a nice sweet and sour combo. <br><br>I can now see why Stephanie Izard won Top Chef as well as numerous other accolades including Iron Chef and a James Beard Award. Great food all around and one of the best meals I've had in Chicago!", "pics": null}}, {"review": {"des": "I had to book 3 months in advance for The Girl & The Goat, and even then, the earliest dinner reservation I could get was 9:15pm for a Monday evening on OpenTable. That's how crazy people book in advance! I didn't even know what I signed up for or even thought to comprehend that I would be eating goat meat here. All I knew was, if I were to go to Chicago, I must go to The Girl & The Goat. That's what everyone said. And they were right. I didn't regret it one bit.<br><br>But note: if you want to eat goat leg or goat shoulder, you must call and pre-order one day in advance. The goat shoulder is $25/lb with a 7lb minimum purchase. The goat leg was even larger.... We didn't pre-order because 7lb for 5 people was way too much food!<br><br>However, there are other goat dishes that you can still order!!!<br><br>rory mcilroy. broker's​ gin . lychee . pink peppercorn . black tea . lemon. This cocktail was one of the most refreshing, light and caffeinated cocktails I have ever had. I love the contrast of the tea and lychee and lemon yet the butter and sweet and sour flavors blended together so nicely.<br><br>goat liver mousse. berry lamb jam . cranberry mostarda . bread & butter pickles. I really love this dish even though I feel like I might already be biased because I love pate and this is similar to pate in concept. The mousse was very light and soft yet rich in goat liver flavor. I enjoyed spreading the mousse on the bread. The contrast with the pickled sauces was a palate cleanser.<br><br>hamachi crudo. chili-soy vinaigrette . finger hots . gooseberries . puffed black rice. This was everyone's favorite dish all around. I actually have never had good hamachi crudo before. The fish would always be so tough to chew. But these were as tender and soft and smooth as can be<br><br>wood oven roasted pig face. sunny side egg . tamarind . cilantro . red wine-maple . potato stix. Hmm, I think this was my favorite!!! I just enjoyed eating the meat so much!! There was such good flavor in this dish. I think it's also the tamarind.<br><br>crisp braised pork shank. buttermilk dressing . butternut squash kimchi . naan. Wait!! I think this was my favorite too!!!! The pork shank was HUGE. The meat flakes off from the bones so easy. Ugh. So. Delicious.<br><br>bucatini. milk braised pork shoulder . tomato. Hmm, I think this was also my favorite!!!! The pasta was very soft and chewy. The light tomato sauce was milky and creamy from the milk braised. The pork was soooo tender!<br><br>caramel corn & malt balls. vanilla malt ice cream . popcorn caramel . chocolate magic shell. And now let's end it with some birthday dessert with one of their famous desserts! I love the playful popcorn and chocolate and ice cream and caramel altogether!<br><br>Pros:<br>-very friendly attentive service<br>-dim ambience with perfect environment for a date or a group<br>-huge restaurant, a lot of seating<br>-delicious food<br>-goat! <br>-plenty of other restaurants and bars around to hop to afterwards <br><br>Cons:<br>-there are none! <br><br>Tip: you can book on open table 3 months in advance", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jjKAMKMk0MXwjqZeH1BFbg/348s.jpg", "caption": "Wood fired octopus"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SryWVD5UvaSXe2pvzD1Cbg/168s.jpg", "caption": "Hamachi crudo"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/g0768gJUojeDoHMDIK7Bhg/168s.jpg", "caption": "Goat Goat Carpaccio"}]}}, {"review": {"des": "Had an amazing dinner at girl and the goat!!!! I would like to go back ASAP to try more things on the menu!  We had the chickpea fritters, goat empanada and also the scallops! Everything was good but the scallops were mind blowing! <br><br>We also had the chocolate desert (with kettle corn) which def didn't disappoint! Portion size is pretty small (2 scallops), so it's definitely tapas style. <br><br>Highly recommend!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/emwKXKA-KYyiwcIRZJUBNA/348s.jpg", "caption": "Chickpea fritters"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Ejy7n2ENiNyvZhLwQXSDDQ/168s.jpg", "caption": "Scallops-must try !"}]}}, {"review": {"des": "I've lived in Chicago for nearly 10 years and this was my first visit. There's nothing notably bad about this place... the atmosphere is great, but the food is truly average to above average for what you can get in the city. The portions are tiny, relatively over priced, and leave a lot to be desired in the flavor department. No one bothered to explain our food as it came out which is usually standard at a venue like this. We received two dishes we did not order and had about a 20 mins lag until our last dish was served. <br><br>Don't get me wrong, this is a good restaurant. But for the month long wait list and price, much better can be found. <br><br>Some highlights on the menu: chickpea fritters and lamb ribs.", "pics": null}}, {"review": {"des": "3rd visit here, and Girl & the Goat is definitely a decently solid food choice in Chicago. The food isn't going to blow your mind, the wait can be super long, and the value isn't quite there - but it is a fun place to visit. Especially if you're into Stephanie's work!<br><br>So the main dish that stands out is the wood roasted pig face. Now, don't let the name put you off - it's more of the tender meat of the cheek and the dish doesn't resemble a pig. For butchers and chefs, the cheek is actually a fought-over delicacy because it is very tender and flavorful (and also scarce in quantity). Get this dish every time - it will not disappoint you. <br><br>(Honestly, if you can't come back to Girl & and the Goat often, I'd consider getting one order per two people that want to eat this.)<br><br>The other stand-out dish was the pork roast - which is much bigger than the pig face but also not nearly as flavorful. It's still very good and crispy and can help fill the carnivores of the party, so I'd recommend getting this if you have at least one big eater in your party.<br><br>The rest of the dishes are all solid choices - though nothing mind-blowing at all. Because of the limited amazing dishes here, Girl and the Goat isn't our first must-go places in our foodie world but since you're probably already here, here's a quick rundown.<br><br>- Wood Roasted Pig Face: just in case you skimmed the review and missed it above. GET THIS<br>- Bread and Butters: there's usually 3 per season, with the mushroom butter usually being there. 4/5, cool imagination put into this, helps fill you, no need to get more than one.<br>- Happy Juice: it's nostalgic to me to get this. Off-menu, and they've changed the formula since. I think it's now some kind of ginger beer and other juice. Kinda small, but a tasty drink!<br>- Cauliflower: I keep ordering this despite all my previous reviews saying it's not worth it. We got it again because our waitress really enjoyed it, but we agreed it's not worth it.<br>- Goat Loin: The meat itself was very tough for some reason. But the olives and \"Mediterrean\" flavors around it were awesome. So 4/5 for the flavors, 3/5 for the meat.<br>- Scallops: perfectly cooked. Solid 4/5<br><br>Overall, I'm not sure if Girl and the Goat feels the need to innovate since they have so much demand through popularity. It's been 6 years since my last visit, and it felt even more commercialized than before. But if the formula works, then why fix what's not broken. I would probably only come here if someone really liked Stephanie's work or the lines elsewhere are too long, and it happened to be short at G&tG. Super cute logo still!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_CQOqHcql1lo31Y08UF1lg/348s.jpg", "caption": "Pork Shoulder (good for filling)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TvMJwUwE2PnlcdmzI4uPew/168s.jpg", "caption": "The Pig Face (the best!)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HRulKguclZVDlypwIrP64Q/168s.jpg", "caption": "Goat Loin (tough)"}]}}, {"review": {"des": "110% lives up to the hype, and then some, as evidenced in part by the thousands upon thousands of glowing reviews. There is a reason you have to make a reservation months in advance. The ambience is fun and vibrant, but also feels upscale and luxurious. It's not so loud and cramped where you feel like you can't have a good conversation with your dining companions. The service is 5-star as well. <br><br>I've dined here a couple times and and tried the best of three cocktail, kohlrabi salad, pierogies, tuna, chickpea fritter, breads, cauliflower, broccoli, arctic char in curry sauce, scallops, and octopus. Oh and two of the desserts :). Everything was phenomenal and every component of each dish worked well with one another, tasted fresh and delicious, and made it a cohesive dish. This is definitely a restaurant where you can point at the menu with your eyes closed, and be confident that whatever comes your way will be amazing. <br><br>If you live in Chicago and haven't been yet, call now and make a reservation for the soonest they have available. You won't regret it.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qk6hnzVMGrb905EvA9csUg/348s.jpg", "caption": "Tuna"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9V2hZ-ZoyCTwtpcYdoUpHQ/168s.jpg", "caption": "Broccoli"}]}}, {"review": {"des": "What can I say that has not been said?  Yes, this place is amazing, yes, make your reservations now, yes, it'll totally be worth it.<br><br>I went in with a game plan, and it worked perfectly:  little nibbles, don't fill up!  We had sourdough bread to start; it was so amazing I could have eaten the whole loaf and been perfectly happy, but thanks to the aforementioned plan, I knew better.<br><br>Tables are super close together, which actually benefited us, because we made friends with three ladies from CA that were sat next to us, and started passing off all our extra food on them so we didn't get too full too quickly.<br><br>G&tG's system is to go from lighter dishes to heavier dishes, bringing out one at a time. I enjoyed this system, and it prevented our table from getting overcrowded.<br><br>Next was calamari bruschetta on goat milk ricotta; fresh, rich flavor, not too chewy. Followed this with the green beans, which were too salty for me, although the waiter said there is no added salt; it was just salty from the anchovies in the fish sauce.  Goat empanadas next, perfectly cooked, with a very mild flavor.  Grand finale was the pig face, which was super rich; it was like having pork belly and eggs over hash browns. Delicious!  Probably my favorite item.<br><br>I failed on dessert and ordered their house specialty called chocolate pavlova says-a-me!  It was not sweet enough though and just tasted weird to me. Fortunately Jon had enough sense to order the caramel corn & malt balls: vanilla malt ice cream, popcorn caramel, and chocolate shell. Crazy delicious.<br><br>Drinks were awesome (we tried a wide variety) and service was spot on, bringing fresh plates and utensils every course, which I love. This restaurant deserves the hype, and you deserve to treat yourself.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/NXX67TZMvYAyxL4jw2yaGg/348s.jpg", "caption": "Caramel corn and malt balls - yum!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/qyoMiTE_gUubqx4Ls3PHYA/168s.jpg", "caption": "Pig face!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/StD6VyobxbPp0An7O7R4PQ/168s.jpg", "caption": "Goat empanadas."}]}}, {"review": {"des": "WOWOWOW SO GOOD. I am in love with the Girl & the Goat and every other Stephanie Izard restaurant. It's been a few months since my visit but it's just so good, I had to share my thoughts!<br><br>Honestly, there is no bad dish here. If the waiter recommends something to you, just order it. They can do no wrong. My two recommendations are to make sure you make a reservation and ORDER. SOME. CRUMPETS. I didn't know what a crumpet was before Stephanie Izard and boy, I was missing out. They're like deliciously fried, chewy biscuits.<br><br>This is definitely a stop you need to make in Chicago.", "pics": null}}, {"review": {"des": "We all have our opinions and clearly this restaurant is very much loved w almost 8000 review and almost 5 star rating.<br>I heard about it from a co worker. He is a foodie just like I am, so I had to make reservation knowing that I am going to visit Chicago for Thanksgiving.<br>I made reservation in September for November 20th and the only available time at that point was 5pm.<br>We have arrived promptly and were seated right away. We were there w 2 kids and I was a bit worried that restaurant will not be able to accommodate their simple food choices. I was worried for nothing, because they were very helpful and accommodating, and my kids got great pasta w butter and side of parmesan cheese. My son also enjoyed their grilled half chicken prepared very nicely w a sweeter sauce. <br>We have ordered sweet potato bread w side of a cabbage w some spices asian style and  cream cheese butter w some herbs. It was simply delicious.<br>For main course my husband and I shared 5 dishes. They were very tiny, so if you are hungry you would want to order more....<br>Of those 5 the beef tongue stood out to me the most. I wish there was more of it, but unfortunately the dish was overpowered  by thick,  fried , and very heavy chips. I tried one and immediately pulled them all out... the rest of the dish was very nice, just not much....there was maybe a 4-5 thinly sliced beet tongue pieces and some greens.<br>We had shishito peppers bakes w parmesan. I have never tried it prepared that way and I really enjoyed  it.<br>We have also ordered the duck tongue dish. It was nice, but also taste of other ingredients has taken over the dish.<br>We had wood grilled octopus that was pretty good. I have had better and again the sauce on the bottom ( a lot of it ) was not making the octopus ( 2 small pieces) taste any better.<br>The last  dish was  enchilada w meet and it was good. My husband enjoyed it.<br>For desert I ordered a very refreshing and yammy  sorbet.<br>The waiter was very attentive and explained everything very well.<br>I guess,as many people mentioned in their reviews, we should have had their  famous burger w egg on top, but I am not a fan of burgers w eggs.<br>In the Uber the driver asked us about the experience and I told him that if you have never been, and number of reviews and stars means so much to you, I guess you could try it.<br>He laughed and told me that he called a few weeks before trying to get a table for December 29th and was told that February 22nd is the next opening. <br>I guess it is what it is. <br>I was not swept of my feet and will not be returning to this place or recommending it, but I have a feeling it will not stop people trying to get in.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-v_l-t8yE06oNFPLJt-HYA/348s.jpg", "caption": "Lovely!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8eIzIdWeIBijcF0WjDUang/168s.jpg", "caption": "Too much sauce...."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wxtdse6DEih0kYf6JamDcQ/168s.jpg", "caption": "I really enjoyed it!"}]}}, {"review": {"des": "Reservations had been sold out long before I booked my work trip to Chicago, but thanks to the AmEx Platinum concierge I was able to obtain a late night seating for one after my flight arrived.<br><br>The restaurant is typical chic for this style of establishment, with pretty much every table filled with people having a great time.  It's the type of place that's meant to be enjoyed as a part of a large group and not as a solo diner, but I ended up here anyway since I don't live in Chicago and wanted to try their food. I left about five minutes before closing and the restaurant didn't show any signs of slowing down at all.<br><br>Service was prompt and to the point. I tried three dishes--the homemade brioche, the goat empanadas, and the confit goat.  The brioche was very good, and both the empanadas and goat were amazingly savory. The lobster in the confit goat dish was so so good. Since I was a solo diner I got major FOMO when a nearby table had the roasted goat shoulder brought out (it's a portion meant for large groups).  Dessert looked delicious, but I tapped out before giving into my desire for indulgence.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PajNquUqdV74ajBWthvCRw/348s.jpg", "caption": "Confit goat"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sFqlcMNyuxnqv8GSM5kG-g/168s.jpg", "caption": "Goat empanadas"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SSBYLrHPiSNaxIOtUzvE-g/168s.jpg", "caption": "Homemade brioche"}]}}, {"review": {"des": "Came here on a Friday without reservations<br><br>It is highly suggested that you make reservations (weeks to months ahead of time), for those with no reservations please read on.<br><br>We arrived 20 minutes before the restaurant was scheduled to open and there were already people waiting on the line.  Once they open the door, you will get in the line and they will let you know if they can sit you down without reservations based on time and amount of people of your party.  If it's just two of you, then I recommend sitting at the bar which is what we did.  If you are sitting at the bar, you do not have to announce it to the host.  Just run to the bar as soon as they open the door and get whatever seats are available.<br><br>The good:<br>-Our bartender/waiter (Asian male) was amazing.  He is passionate as he explains the menu making suggestions such as how many dishes to get based on your party and tips such as going from light to heavy.<br><br>-The use many local farms to make their dishes<br><br>-Food:  I believe their menu is seasonal but we had: <br>Goat liver mousse (the bread that came with this was simply amazing)<br>Vegetarian Pierogies (super tasty)<br>Clams (tasty sauce)<br>Crab rangoon (one of my favorite)<br>Lamb ribs (so soft it fell right off the bone and probably one of the tasty lamb dishes I've had..Eva!)<br>Complimentary broccoli (good)<br>Popcorn/caramel ice cream dessert (another food orgasm)<br><br>-They play 90s hip hop which we loved (yes we are old lol)<br><br>-The bad:  I cannot think of anything<br><br>Final Verdict: So glad my fiance convinced me to go.  If we return to Chicago we are making reservations!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/r6f4u8WVxvh6OJDxILc5dg/348s.jpg", "caption": "Save room for dessert, this is going to explode in your mouth!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/imBO3a8xPfpCCNFLxcxCmg/168s.jpg", "caption": "Slamming"}]}}, {"review": {"des": "I made a reservation for Girl and the Goat about one month in advance, so I was enthusiastic when I finally got to try it. Upon arrival at 6:15 P.M. on a Friday night, the host requested that everyone in my party was present before being seated. While waiting for one friend to arrive, I overheard a walk-in customer telling his friend that they told him it'll be a two hour wait! A few minutes later, I was able to get seated in a cozy area close to the open kitchen. The server was extremely personable in introducing himself, offering suggestions upon request, and guiding us through the menu items.<br><br>I ordered the following items:<br>1. Kohlrabi Salad - This was just adequate and tasted like any normal salad. The flavors didn't stand out, but I did like the textures of the shiitake, pears, and almonds. I could've done without this dish.<br>2. Steamed Mussels - The mussels were plump and tender. However, one or two of the mussels did have an overpowering fishy taste, and I should've said something at the time.<br>3. Seared Scallops - This was perhaps the best dish ordered. The scallops were pan seared perfectly. The wood ear mushroom texture paired nicely with the scallops.<br>4. Bucatini - The pasta was cooked al dente. The tomato sauce was decent but not memorable.<br>5. Wood Oven Roasted Pig Face - I loved the creativity and presentation of this dish. The server advised us to break the egg yolk and mix all the ingredients together to enjoy all the components. It was delicious. The flavors were interesting, and I especially loved the crunch of the potato stix.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EByEhIJsAA82rEl_U0_xSA/348s.jpg", "caption": "Wood Oven Roasted Pig Face: sunny side egg, tamarind, cilantro, red wine-maple, potato stix"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fDwgIId8GBeirAEAiQifQA/168s.jpg", "caption": "Bucatini: milk braised pork shoulder, tomato"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S3st54Y4jB-G2VAd-SgydQ/168s.jpg", "caption": "Seared Scallops: wild maitake and wood ears, oyster sauce, brodo, squash brandade"}]}}, {"review": {"des": "Came here yesterday for my birthday! The brussel sprout salad that came with the Arctic char was a little salty, but other than that, everything else was amazing. Service was excellent, and I'm so looking forward to coming here again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XHIzTYMjut5I1DfNcnSUMw/348s.jpg", "caption": "Fish tempura"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2OAjjvKaA26YEErVgYP1yA/168s.jpg", "caption": "Arctic char"}]}}, {"review": {"des": "We had to wait a little over a month for a reservation on a Saturday night here. Overall, the food was really good, however it I think it was over hyped for how long we had to wait for the reservation.  <br><br>They recommend about ~2 dishes per person. We tried the \"best of three\" cocktail. It was refreshing. Then we split the bread with the peppers and butter, goat empanadas, chickpea fritters, and bucatini.  The bread and the bucatini were really good. <br><br>It's a cool place to check out and try, but I think there are other options in the area that are better and don't require you to wait so long for a reservation.", "pics": null}}, {"review": {"des": "Just like the other Goat restaurants, this place is great for vegans and vegetarians because they crafted a menu just for you! and that menu includes items from the regular menu if your dinner companion(s) want to try something from there and share with you. The service here is always the best, and the waiter was helpful in my indecisiveness. Drinks are also always very good. The atmosphere is dimly lit and never not totally packed. As most people will say in their reviews, book your rez months out. I got lucky with snagging a 2 person rez a few days out, but that is very rare.", "pics": null}}, {"review": {"des": "The place: Always bustling. The first time I went, honestly I thought it was overhyped, even though my friend and I did get seated right away in the front lounge type section. The second time, the service was impeccable, we were able to taste so much more, and it really felt like quintessential Chicago. <br><br>The taste: Ermergerd. I personally LOVE ordering several dishes and tasting as many as possible, because I am a true Millennial and don't want to commit to an entree. There were 6 of us, which meant we ordered A LOT. [Check out my pics]. The top dishes IMO were the lamb ribs [the blueberry marinade was bomb] and the chickpea fritters atop the carrot hummus. I want carrot hummus everyday. We skipped dessert b/c people were obsessed with the idea of getting donuts at the Sox game after, and also we were pretty full AF. <br><br>My face: Whatever look you make when your mind is changed. Before, I was all \"meh, even though I've watched at least one episode of I think every season of top chef, it's just ok\" now i'm like \"um if you go with a group, it's pretty great, and service is on point with refills and helpfulness\". Also, totally affordable, I think we all put in $40 for what was a pretty fantastic meal.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5irmBVJYN2AVh_n-5zr_qg/348s.jpg", "caption": "Roasted Cauliflower"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Ge5BW9p-kyAchcXkmlwy7g/168s.jpg", "caption": "Ramp Marinated Grilled Chicken"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/jmODL5I3fU35TJeVJHlFNg/168s.jpg", "caption": "Lamb ribs"}]}}, {"review": {"des": "I can't believe how great the culinary scene is in Chicago! There's nothing like or similar to Girl & The Goat in San Diego. Not even close... <br><br>We read and everybody recommended this is the place to try...but either come when they open or come late night, like an hour before closing or be prepared for a LONG wait. We tried to make resos 1 month in advance...and nothing was available. There was no way we were going to make it at 4:30pm and have a dinner...we're not seniors!...so we came late night instead on a Sunday and boy, it was still busy!!<br><br>There were some seatings available (thank god). We ordered some cocktails, 4 dishes to share and half a dessert. We started off with Hamachi Crudo, skuna bay salmon, pig face, and the bucatini. My favorite dish was the pig face...and that's a must! It oddly tasted like a childhood Vietnamese dish but Americanized, so good! Everything was delicious. The salmon dish was like a salmon poke bowl, plenty of salmon, bucatini filling and savory. The only thing I would change is the Hamachi crudo- I didn't like the puffed black rice on it...it looked like maggots... so it turned me off. We were suckered into dessert (and glad that we got it) -caramel corn and malt balls, you can get a half order! It was sweet, salty, savory, and was a GREAT ending to all the rich flavorful food. <br><br>I really wish I lived in the area because I would so come back and try everything else!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oC73C2JUbHAMNtnVulTtBA/348s.jpg", "caption": "Dessert"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/o6ok99Vvlhd1MiUeohh9YQ/168s.jpg", "caption": "Bucatini"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/wGH4JT6xF5miLYQIY9-pUQ/168s.jpg", "caption": "Pig face"}]}}, {"review": {"des": "In Chicago for a weekend the bf wanted to have one nice dinner and chose here. I was 100% impressed and had a fantastic meal!! Highlights definitely included the pig face and the green beans as well as the crumpets that came with the liver The service was excellent also. It is reservation only so you definitely need to book in advance. We ended up going around 10:15 so book now and book early. If I found myself in Chicago again I would definitely come again!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aKW1CAgWNreZB8X7Ox2wfQ/348s.jpg", "caption": "Crisp Braised Pork Shank"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/cYAcd-EbD7VkMmtC1qgJVw/168s.jpg", "caption": "Sautéed Green Beans"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gzzIHSFt9_vT9sWd2ZkCgQ/168s.jpg", "caption": "Pig Wood Oven Roasted Pig Face"}]}}, {"review": {"des": "I have wanted to eat here since before even moving to Chicago (about a year ago) and was finally able to! People are not kidding when they say you need to make reservations weeks to even months in advance if you want a good time slot. One day I was browsing open table and came upon an open Thusday at 8:30pm slot available and made the reservation right then and there! <br><br>Upon arrival to Girl & the Goat we were seated promptly. I loved the atmosphere and the 90's to early 2000's hip hop playing which I loved! <br><br>Our waiter greeted us and he was so nice and knowledgeable! We started the night off with a cocktail, I ordered the ring of fire, which was delicious. The pomegranate and ginger flavors blended so well with the tequila. <br><br>I wanted to try one of everything on the menu, sadly we were not able to do this. We ordered the sesame-grape sourdough bread, the sweet corn pierogies, the wood oven roasted pig face and the grilled chicken. I have to say the presentation of all of the dishes was almost as amazing as the flavor! My favorite dish was the sweet corn pierogies, I loved the sweet corn-tomato chimichurri it was delicious. <br><br>Luckily we saved room after dinner for dessert and ordered the carmel corn and malt balls. It had been so long since I had chocolate magic shell (which matched the throwback theme to the older hip hop). It was amazing! <br><br>Would love to come back and try everything again!", "pics": null}}, {"review": {"des": "This is a tapas style restaurant. I came because of some review I saw on tv a year or two ago. It is very popular especially for a 30 something crowd. We are older and didn't feel out of place. <br>The food for me fell into my top 10 best places I've ever eaten. We ordered about 5 plates plus dessert to celebrate our anniversary. I liked that they had many fresh seafood choices on the menu. I will post photos of some of our dishes. There were about a dozen chefs in the back making each dish that came out not only tasting fabulous but were works of art. <br>Our waiter was very attentive to our needs and an empty plate or water glass never stayed that way longer then 5 min if at all. <br>Tip: plan ahead and make a reservation weeks in advance. We were able to walk right in.", "pics": null}}, {"review": {"des": "Ummm can I just saw AMAZING! From beginning to end I loved the whole experience. I had a last minute trip to chicago and the only reservation available was at 1045pm. I kept it because I heard great things but I went in around 8pm just to see if I could get seated maybe at the bar but they actually had a table! The waiter gave me great recommendations and was even able to half size the portions for me so I was able to have multiple dishes! <br><br>I started with the wood grilled broccoli which, then got the seared scallops, bucatini and ended with caramel corn & vanilla malt balls. My favorite of them all was the seared scallop. The bucatinibis my second fave with milked pork shoulder in tomato sauce. <br><br>Everything was great and I would definitely come here again!", "pics": null}}, {"review": {"des": "Loved the food, service and the ambiance. Had a reservation for 745 pm which was arranged by the hotel concierge.  Arrived on the minute but the table wasn't quite ready.  Grabbed a cocktail at the bar and the table was ready by 8 pm. Maitre d was excellent in keeping us updated of the table status. Once seated, our waitress and the team of staff were attentive and pleasant.  The oysters were delicious.  After my 13 year old verbalized how delicious the oysters were, they brought out a complimentary order of oysters on the house.  It was a nice touch. Hamachi crudo was delicious and flavorful.  Pig face is a must try as well.  Lamb shank with kimchee sauce was my favorite. All the dishes had a perfect balance of fat and acid.  Smaller dishes.  We ordered 9 dishes for the party of 4. Portions were perfect.  We enjoyed our dining experience here.  Met and exceeded our expectations.", "pics": null}}, {"review": {"des": "Two nights in Chicago means having to squeeze in all your foodie goals.  Girl & the Goat was very high on my list, but I made it a second dinner for a Sunday evening.  Big mistake, I was really too full to enjoy anything, but the bites I had were way better than dinner #1!<br><br>Our reservation was for 10:15pm on a Sunday night.  We arrived about 45 minutes early and our table wasn't ready, so managed to squeeze in at the bar and dined there instead.  I don't know much about the work culture or work schedules in Chicago, but I was really shocked to see just how packed this place was late on a Sunday night, definitely different from Fort Lauderdale. <br><br>We both started with cocktails, my hubby ordered for me while I was in the restroom, so I forget the name, but it was Mezcal based and right up my alley.  After some time we were able to order food (bartender seemed not as friendly as I would have liked).<br><br>I knew ahead of time from studying the menu that I had to try the Pierogies and Goat Carpaccio and left enough room in my stomach for about 1 bite of each lol.  Truly wish I had more room those, these were both fantastic I would definitely get them again.  My hubby seemed to leave more room and insisted he try the Beef Cheeks and Lobster with Goat Belly, both which he said were very good! <br><br>A different atmosphere than I was expecting (especially after eating at Little Goat), this place is dark and intimate with a vintage feel, almost like a speak easy.  Loved it for sure.  <br><br>Absolutely amazing meal and I would highly recommend getting a reservation early!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IeEH1BEQDR9-7lVzJltc9g/348s.jpg", "caption": "Goat carpaccio"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lld545Xk7yCO6z9DTzPW7w/168s.jpg", "caption": "Pierogies"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kd2JzUtFTfTvefPazEUi_g/168s.jpg", "caption": "Beef cheeks"}]}}, {"review": {"des": "We came here for a nice dinner on our trip to Chicago and could not be happier!  From a great atmosphere to great food, everything hit the spot. <br><br>We had to get a reservation for here like 2 months in advance and even then could only get one for 10:45, so definitely plan ahead if you want to check it out.  <br><br>The atmosphere of the restaurant was rustic, with lots of wood and greenery around, as well as a great artwork and goats everywhere.  The staff was very friendly and informative and really helped us work our way through the menu. <br><br>The menu is a bunch of small plates separated by categories like veggies, fish, meat, and bread.  We were also given a separate menu for all the goat offerings they had.  We chose a few items from each category and were off to the races.  The menu is very eclectic and I was intrigued to try things I had never had before like duck tongues.   Everything we ordered was flowed out by our server perfectly and it created a great meal from start to finish.  <br><br>The flavors were great and complimented each other well.  Even jumping around from various styles and preparations, the dishes harmonized well. Even after all that we found the room to order some dessert which also hit the spot and was a nice ending to an amazing experience.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PA1-y6Y59zGg76Tikif4kw/348s.jpg", "caption": "Goat Carpaccio"}]}}, {"review": {"des": "Finally, on trip five to Chicago, I got to experience the glory of the Girl and the Goat. I was slated for a 10:30pm reservation on a Wednesday (odd time but I was flying in from the West Coast, so the time difference worked in my favor, plus you take what you can get at a place that is somehow still one of the hottest tickets in town years later). Slow baggage and some O'Hare Uber shenanigans meant any chance of checking into the hotel to change was a lost cause which left me rushing in a cab straight from the airport to the restaurant bags in tow. The host was incredibly understanding and kindly stowed our many bags away for the length of dinner and gave no mind to the fact that I looked like I had been traveling for the past 9 hours. <br><br>We were seated in high seats right by the kitchen, which I think is great for smaller parties as I love getting to interact with chefs and witness the frenetic energy that a busy kitchen emits. <br><br>Now on to the good stuff...<br><br>As far as drinks, I started with the \"Ring of Fire\" as slightly spicy tequila based drink balanced out with some pomegranate sweetness, followed with a nice hoppy IPA with good citra hops, juicy and hazy, and finished with the \"All Nighter\" the perfect rye based boozy after dinner cocktail to cut through some of the dessert sweetness. <br><br>The food at the Girl and the Goat is meant to be shared and my only regret is that there weren't at least two more of us to help take down some other items of the menu. <br><br>Here's a rundown of the food ordered:<br>Roasted Cauliflower with pickled peppers, pine nuts, and mint. <br>Spiced Shrimp with delicata squash, brown-butter miso aioli, and furikake<br>Seared Scallops with wild maitake and wood ears, oyster sauce brodo, and squash brandade<br>Wood-Fired Lamb Ribs with cranberry-tamarind glaze<br>Goat Empanadas with miso bleu aioli, grilled pickled beech mushrooms, and queso fresco<br>Confit Goat Belly with bourbon butter, lobster and crab, and fennel<br><br>Nearly every dish outmatched the one before it, with my personal favorites being the spiced shrimp (the pairing with the crispy squash really made this a complete dish) and the confit goat belly which was so decadent I can barely even begin to describe it. <br><br>For dessert we went for the caramel corn and malt balls which had vanilla malt ice cream, caramel popcorn and a chocolate magic shell. The piece de resistance was when one of the kindly chefs we had been interacting with throughout dinner tossed another dessert our way because \"you look like you've had a day,\" and that's how I discovered the joy of a sweet potato toffee cake and sour cream ice cream, two things I never would've imagined ordering on my own. <br><br>All in all, a fantastic experience and great to see that a restaurant with this much hype can exceed those expectations. Now in year 8(?) of operations, it seems like Stephanie Izard & Co. have found a winner that will keep folks flocking at all hours for many more years to come.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QBFkUQsCd6Gxj9G6ay1HYw/348s.jpg", "caption": "Shrimp with delicata squash"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ekXpo0K2r64QnZatLl-Z3w/168s.jpg", "caption": "Goat Empanadas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/lxvPis2-sDPQAefKe_uIVA/168s.jpg", "caption": "Sweet Potato Toffee with Sour Cream Ice Cream"}]}}, {"review": {"des": "Pros: Beautiful decor, stunning bar, excellent service. I had the hamachi crudo and the beet side salad, with gin libations. I was making a quick snack stop before heading out with friends. Everything was delicious, service was quick. I was in and out in 30-40 minutes. <br><br>Cons: This place was so hyped up that I was expecting more of a wow factor, which is why it's not receiving 5 stars, everything was delicious but I'm not day dreaming of my next visit. Very pricey for the serving sizes.", "pics": null}}, {"review": {"des": "Get reservations a couple weeks in advance! Girl & the Goat came highly recommended from friends who had previously lived in Chicago, so we had to give it a try. <br><br>Where do I begin...from the moment you enter the restaurant, you know you're in for an adventure. The waiter was very informative about the menu and specific ingredients of the dishes. We were asked by the waiter if we had any dietary restrictions and allergies (which I though was a nice touch). We were recommended to order 4-5 dishes as they are meant to be shared and are of smaller portions. Literally everything we had blew our minds (see the pictures in this review for particular dishes).<br><br>We are all in for Girl & the Goat! We will make a trip back to just to eat here!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OvN-000OlK_jeIcvmv7BlA/168s.jpg", "caption": "Goat Empanadas"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/YpIGNQL0koFJqaPjeb2yTw/168s.jpg", "caption": "Blueberry Sourdough"}]}}, {"review": {"des": "Small plates style so I recommend coming with more people so you can try more things! Highly recommend making a reservation like at least 2 weeks ahead. It gets very busy here even tho it's a pretty big place. Service was excellent. Our server was really helpful and attentive.<br><br>Started off with Roasted Cauliflower and Soft shell \"Crab Cake\". These were my favorite dishes. The soft shell crab cake is not a crab cake at all. It's soft shell crab on top of this imitation \"crab cake\". The blackberries were a nice touch. The Braised Beef Tongue was interesting... It was kinda too salty and a lot of weird textures that were more rough and chewy. The Wood Oven Roasted Pig Face was pretty good. The fatty parts were delicious. Just melts right in your mouth.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aNBV60zAIcw45WweAmbAMQ/348s.jpg", "caption": "Braised Beef Tongue"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/TfazVjs1yaMbIT_DVGn5QA/168s.jpg", "caption": "Soft shell \"Crab Cake\""}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/x0GyCdDGmD2yHAOL1AMqSg/168s.jpg", "caption": "Roasted Cauliflower"}]}}, {"review": {"des": "Tremendous.  Simply tremendous.  And, more than almost anywhere I've ever dined, they all make it seem so light and effortless.  Drinks come and food arrives with a sense of unforced happiness that's hard to really describe.  And the food is absolutely incredible - the roasted pig face is even better than advertised, the duck tongues are unbelievable.  The escargot ravioli is the one dish that was very good, but easily the slightest of the three I ordered.  <br><br>I'm so excited they're opening a location out here in Los Angeles.  This is food that begs to be available at more than just one location.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sGZ3nn4Z5eBX6rqLs23m-g/348s.jpg", "caption": "duck tongues"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eG0pCH95Qzy5RiLIs4ZXnQ/168s.jpg", "caption": "escargot ravioli"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Jrd8mYIT21Ip6iY2-rIwgQ/168s.jpg", "caption": "wood oven roasted pig face"}]}}, {"review": {"des": "Wow! Now I understand why I had to get a reservation three months in advance! The Girl & the Goat is just like Bestia in Los Angeles in terms of hype and having to book a reservation months in advance. It's funny how the Girl & the Goat is also going to open a location in LA near Bestia in the Arts District in DTLA.<br><br>The ambiance and service here are top-notch. The restaurant has a modern, rustic vibe and it's cool how you can see into the kitchen. There are goat paintings/photos/sculptures everywhere which is pretty cool to see. Our waitress was super cool and was more than happy to educate us on the menu and her personal favorites. You can tell she's really enthusiastic about working here.<br><br>Since this place is meant for sharing, we ordered 4 dishes: duck tongues, goat empanadas, wood fired lamb ribs and the pan roasted halibut. All of them were great! I honestly can't think of a negative to say about any of the dishes. The duck tongues were fantastic. Combined with tuna poke, the dish has a nice balance between the fish and the duck tongue. The crispy wontons give the plate a nice crunch and texture. I don't think I've ever had an empanada that good. The skin was so crispy! The lamb ribs fell right off the bone and the blueberry-tamarind glaze just melted in my mouth. I wish there were more ribs in one order! The halibut was tasty as well. The blueberry nuoc cham was the perfect mix of sweet, sour and salty.<br><br>Somehow, we still had room for dessert and got the chocolate pavlova and caramel corn & malt balls. The pavlova was exceptional. Paired with black sesame ice cream, it was delicious! I'm not a huge fan of chocolate but this dessert might have converted me. <br><br>It's neat to see top chef Stephanie Izard working and handling orders for the kitchen. It's not every day that you can dine at a Top Chef's restaurant and see them in action. I can't wait for the LA location to open!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mqfxHSTlwNbiKn6TzrQLUQ/348s.jpg", "caption": "Chocolate Pavlova Says-A-Me"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/W1UGPvWtYC8JOrHOFTCs-Q/168s.jpg", "caption": "Caramel corn & malt balls"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M3r460I_2G4K-npaR_H7zQ/168s.jpg", "caption": "Goat Empanadas"}]}}, {"review": {"des": "Trendy tapas place. Costs a pretty penny and then some. <br><br>I think people go for the atmosphere and location. Food is fun to share but nothing I have craved even once since our visit.<br><br>4 stars for location, ambience and service. Food is..forgettable but not bad..", "pics": null}}, {"review": {"des": "This place is a MUST GO if you're in the Chicago area!  Love it!  <br><br>Ambiance - hip, but not pretentious.  While it's not SUPER fancy, I love the lofty like feel and decor.  Sat inside and while it's a bit loud (it's always crowded), I didn't feel like I had to scream at my friends to be heard. <br><br>SERVICE:   <br>Host:  Welcoming (Yay, someone likes and values their job!), kind and very accommodating to our groups changing needs.  We arrived early and they were able to help get us in a bit quicker than expected - with a smile!<br><br>Bar was completely different.  To be fair, it was pretty packed. But when I went to the end of the bar (only clear area), female bartender flatly said, \"he'll help you over there.\"  Uh, okay - I guess I was in the way of the waiters getting drinks...but, um, rude much?   So I moved to stand behind people eating/drinking and patiently waited to get ONE of the male bar tenders attention. Being vertically challenged and fully bundled up for Chicago weather did NOT help!  There were very lovely young ladies at the bar chatting it up (nothing wrong with that), I just need a few drinks peeps - get your flirt on! Annoyed that they seemed annoyed by the interruption.  lol - whatever! <br><br>Service:  However, not even 5 minutes after that irritating experience, one of the lovely hostesses came and showed us to our table! Yay! <br><br>Our waitress was awesome as she walked our group though the ordering process and what to expect.  The servers were all wonderful, providing full descriptions of each dish as they were placed on the table. And, the  servers that kept magically refilling our drinks & waters and see if we needed anything.  <br><br>Food:  AmAzing! They never disappoint!  Loved the broccoli, flavorful hummus, incredible Goat Empanadas, perfectly tender Octopus with tastiest Mole, and the popcorn malt balls for dessert! Scrumptious!   <br><br>I will definitely be back EVERY time I'm in Chicago!  Don't miss this place if you're here!", "pics": null}}, {"review": {"des": "Where to begin. This establishment came highly recommended by many locals when they heard about my trip to Chicago. I'm so happy I listened to them! If you're reading this, make sure you book ahead, as they're super popular and fill up fast. <br><br>I'm sure I knew I would love this place from the moment I saw the drink menu. Outside of some very unique craft beverages, they serve local beers on draft and an excellent wine menu. <br><br>Once seated, we were recommended to order about 4 items between two of us, since their plates are meant for sharing. So we ordered the focaccia bread, the roasted broccoli, the lamb ribs and the pork shank. Absolutely everything was spot on fantastic. The lamb ribs come with some magical blackberry gastrique sauce and falls right off the bone. The shank came with naan bread and some hot kimchi based sauce that was a pure delight. The broccoli is beautifully roasted and creamed with a blue cheese sauce and Rice Krispies (right!!??) that almost converted me into a vegetarian. Bravo!<br><br>I will always make an effort to get a seat at the Girl and the Goat anytime I am in Chicago and you should too!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gSxAtp1BSC9VxEnSKJTZZQ/348s.jpg", "caption": "Appetizer menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/81U7LUtPCof3-pSKq5FMaw/168s.jpg", "caption": "Land menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qbTAAXysr6XbVknoo_0NBQ/168s.jpg", "caption": "Seafood menu"}]}}, {"review": {"des": "We booked this place a month ahead and we got at reservation at 10:45pm on a Saturday! The hostess said we could come early and might be seated early. We arrived around 8pm and the wait was later than 11pm so we hung out at the bar waiting for out reservation. We got some drinks and an appetizer. Then got seated at 10:45.<br>I think we got a very good seat: the chef table, it's like watching a cooking show while enjoying our foods. <br>The drink: $14/ drink. We got chai-town and Oaxaca. Oaxaca was very smooth and the turmeric flavor was very interesting. I loved it a lot. Chai-town was a bit boozier but overall it was good as well.<br>The foods: it was phenomenal!!!! I loved everything we tried. We had goat empanadas, green beans, beef tongue, and pork shank, cauliflower, shishito pepper and broccoli. Dessert was on the house, it was sour ice cream with pickle persimmons.<br>- pork shank: my favorite. Very crispy on the outside but tender inside and the meat were falling off the bone as you eat. <br>- beef tongue: perfect combination of all the flavor. Especially, the pickles in the salad, it added a little zesty taste to the whole dish.<br>- all vegetables dishes were well-seasoned, perfect fast with a umani flavor<br>- dessert: we were too full for it, but you can't waste foods. So we tried it and it was sooo delicious we finished everything<br>The service: very good customer service. We had some interaction with the chefs since we're at the chef table. Shout out to the 2 (one big guy with a beard and one with a knife tattoo on his forearm) they took good care of us!!!<br>We were very pleased with our experience here! <br>Definitely will come back in the future and highly recommended to everyone. <br>It worth every pennies you spend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MDmhN4Fxc_jNpaLnDSKUmA/348s.jpg", "caption": "Pan Fried Shishito Peppers"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_w8P1mWTPlfWYyPpvzGMsA/168s.jpg", "caption": "Braised Beef Tongue"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/vjDPQRvHLsa3b9wfJezPUw/168s.jpg", "caption": "Crisp Braised Pork Shank"}]}}, {"review": {"des": "Where do I start?<br><br>The food was amazing, there were 3 of us, so our server suggested 6 dishes. We had:<br><br>Duck Tongue<br>Halibut <br>Squash Blossom Crab Rangoon<br>The Bread<br>Lamb Ribs<br>Roasted Cauliflower <br>Roasted Shishito Peppers<br><br>The Duck Tongue was brought out for free as it was late in the night and we had asked about it, but didn't end up ordering. Let me tell you! This was the star, holy cow, it was really good and easily the best dish we tried.<br><br>The Squash Blossom Crab Rangoon was amazing and easily the best Crab Rangoon I have ever had, and I love Crab Rangoon. Amazing (they even asked if we wanted to add a third as there was 3 of us, but the dish only came with 2)<br><br>Roasted Cauliflower was excellent<br><br>Lamb Ribs were good, but I would have ordered something a bit more complex for the main protein. <br><br>Halibut was not my favorite dish, but my two friends thoroughly enjoyed.<br><br>The bread was good, it was baked with corn but the name is escaping me.<br><br>The Shishito Peppers were not good. They were definitely the spiciest of the variety I have ever had and the flavors were not there. I would pass on this dish.<br><br>We also had 2 deserts but they were nothing to write home about. <br><br>Cocktails were excellent.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/OLXq1FTcylCwDYSOVsWCnA/348s.jpg", "caption": "Peter Piper Bread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/94CaC8xTHviClu2bQf8dEA/168s.jpg", "caption": "Squash Blossom Rangoon"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wmnCXOAVuGYffRN3fwjdgA/168s.jpg", "caption": "Duck Tongues"}]}}, {"review": {"des": "I understand the hype. I understand the hype. I understand the hype.<br><br>Every time I visit Chicago, this has been on my list. Unfortunately the wait is soooo long that I just give up. This place is huge and it's always packed. Well one day my friend and I stopped by and low and behold...2 open seats at the bar on a Wednesday night. Everything was great and I don't think you could wrong with anything on the menu.<br><br>Oysters - we got both the Raw and Wood Fired. I preferred the Wood Fired as it was different and unique<br><br>Wood Fired Octopus - Hmm, cooked perfectly that tasted well with the mole<br><br>Seared Scallop - Nothing too out of the ordinary, but great quality and texture nonetheless <br><br>Pig Face - Best item on the menu for me. Crispy, tasty, and it all ties together beautifully with the egg<br><br>Talkin' bout Chai-Town - Tasty gin based drink. Not a fan of pineapple but it was still good, particularly with the combo of lemon and honey. Not too strong, but still great flavor.", "pics": null}}, {"review": {"des": "Possibly the most amazing restaurant experience I've ever had.<br><br>To start off with, my friends and I did not snag a reservation. We put our name down for a table, but the wait was at least 2 hours long. So, we ended up eagerly looking for 3 spots at the bar (so difficult, but happened)!!<br><br>The bartender was fantastic. They have great drinks. I got a beer and there was a cute goat logo on the glass :).<br><br>For 3 people, they recommended sharing 5-6 plates. We got the following:<br><br>Sockeye salmon (avocado . strawberry . asparagus . chili-crunch): The sauce was mind-blowing. Keep in mind that this is raw salmon! I think it was poke-style, but I didn't get it from the first look at the menu.<br><br>Calamari bruschetta: Flavors on point.<br><br>Goat empanadas (grilled pineapple-blueberry pico . roasted poblano cream . queso fresco): Sooo good. Meaty.<br><br>Pan roasted halibut (marcona almond butter . white asparagus . blueberry nuoc cham .beech mushroom): Delicious. I wasn't expecting much, but it was so wonderful. <br><br>Wood oven roasted pig face (sunny side egg . tamarind . cilantro . red wine-maple . potato stix): So unique and yummy! The right amount of fat and meat. This was also beautifully presented.<br><br>We were SHOCKED to get the following items on the house. I was like.. did I hear these right?! They were stellar dishes.<br><br>**Sauteed green beans (fish sauce vinaigrette . cashews): The sauce on these green beans were addicting. I could eat it forever.<br><br>**Chocolate pavlova says-a-me! (caramel chocolate sauce . sesame whip . black sesame brittle & ice cream): I think this is my favorite dessert of all time. The temperature of the dish was fabulous. It melted in my mouth. Devine flavors.<br><br>**Caramel corn & malt balls (vanilla malt ice cream . popcorn caramel . chocolate magic shell): The popcorn was soooo crunchy and delicious. Great mix.<br><br>Absolutely coming back for more whenever I'm in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IFh02UGhkm6NqQOjf5LbRQ/348s.jpg", "caption": "Caramel corn & malt balls"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xzr3bbWa0fapTEWPFhbOoA/168s.jpg", "caption": "Chocolate pavlova says-a-me"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/oAfSaQ8r5uapvC0R5cc9uA/168s.jpg", "caption": "Two amazing desserts"}]}}, {"review": {"des": "Girl & the Goat provided a really decadent birthday meal for my fiancé. <br><br>Service was pleasant and accommodating, especially when they sat us even though we were 30 minutes early for our reso! Our server wasn't the most knowledgeable about the menu and/or dishes she recommends, but everyone else was spot on with being quick and prompt. <br><br>Food was DELISH. We shared the broccoli (fried and crispy!), goat empanadas (perfect pineapple jalapeño salsa), pork shank (HUGE!!!!!! We couldn't even tackle half), pig face (fatty, crispy and creamy- perfect combos), and the chocolate popcorn dessert. We left completely stuffed with happy, happy bellies. <br><br>Although I wouldn't say it's worth a 2-3 hour wait, if you can snag a reservation for the near future, do so. You definitely won't be disappointed with your meal! :)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D_WnZ4aXJh5F55uXJuejzg/348s.jpg", "caption": "Caramel corn & malt balls"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/UAJsS3vXxkoaDmicKCRLzw/168s.jpg", "caption": "Crisp Braised Pork Shank"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NKs3hBZbWfhC11pqTBqpaQ/168s.jpg", "caption": "Pig Wood Oven Roasted Pig Face"}]}}, {"review": {"des": "Awesome cocktails - great start!<br>Great staff<br>Great service<br>Delicious creative unique dishes brought out in a timely manner for maximum enjoyment", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Fh_IRm82bwmJuZw8poFWJA/348s.jpg", "caption": "confit goat belly bourbon butter . lobster & crab . fennel"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n6SV8OfUDeu4pyX8G3_Viw/168s.jpg", "caption": "wood fired octopus pepita mole . pickled banana squash"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hYbwsm6IRr_VN8Nx2v-KWQ/168s.jpg", "caption": "raw oysters swimming in brown butter!"}]}}, {"review": {"des": "All I can say is that this is a must go to in Chicago!!!!! What an amazing experience. At first I was worried that it was just the hip place to go to, but all the hype is 100% true. If you want to go, please reserve with a good amount of time in advance. The weekend we were in town was fully booked but we decided to take a peek. We got lucky and sat in one of those long family tables outside with other parties sitting next to us.<br><br>The experience was so fantastic that we did not even notice the people around us. We started with an order of the roasted califlower which was delicious. Then ordered the scallop and sausage summer succotash along with the  wood fired lamb ribs with a blueberry glaze. Yes, it was as amazing as it sounds. I do not eat lamb, but we devoured the plate!!!! Of course we had our side of red wine to bring everything together nicely. <br><br>The staff was friendly, the food was cooked to perfection with amazing flavors and the dessert was the cherry on top. It looked different, it tasted heavenly. For all my chocolate lovers, order the chocolate pavlova!! It will not disappoint. <br><br>We are heading to Chicago in November and already reserved a table. This time we are bringing along some friends so that they too can experience this delicious adventure! Hope you have a delightful experience like us :)", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-u39gy9Z6VCyi734qyiTJg/348s.jpg", "caption": "Chocolate heaven"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/I2rG_Gyl36tHtokt2IH_xA/168s.jpg", "caption": "Babe enjoying the delicious wood fired lamb"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lOM1S78k1FMRCkRSv30nSg/168s.jpg", "caption": "Lucky we were able to sit outside...place was packed"}]}}, {"review": {"des": "Ambiance<br>The Girl and the Goat is a super duper modern rustic look and feel inside.  They have an open kitchen to see all the action.  We had a seat for two so it was in those long tables where one is close to the next table.  It's easy to hear the chatter of the next door table. <br><br>Food<br>Wow, the food did not disappoint.  So many good dishes for a great value at such a high class restaurant like this.    <br><br>-Goat satay:  Very well cooked.  Tasted almost like lamb.<br>-Pig's face: reminds me of lechon kwali of the same Philippines dish. Doesn't taste like pork, can tell more with the middle.<br>-Beef shank: Fall off the bone, very tender very moist. Goes well with kimchi, ranch, butternut squash, and the naan.<br>-PB&J: Definitely peanut butter taste with some ice cream on top.  The brittle is very good. <br>-Birthday ice cream desert -Crunchy brittle with vanilla ice cream is delicious.<br><br>Service<br>I thought the customer service is pretty good.  We were able to get a birthday desert since it was my fiancee's birthday.", "pics": null}}, {"review": {"des": "Wow. I have to say, I had my doubts. Over 7,000 reviews and reservations being made months in advance, could this place really be THAT good? Well, just like Hamilton, the HYPE IS REAL. <br><br>We made reservations for a Saturday night at 11:30pm two months in advance! It was the only slot available, which worked out perfectly because we went to see a show beforehand. We were seated in the dining room. The ambiance is dark and a little loud. They play a lot of groovy top 40 music. <br><br>We ordered a few cocktails, but the real star were the dishes. They recommend family style. It's a great way to try multiple things and trust me, you're going to want to try everything. The reason why is the flavor. Everything is full of unique and delicious flavors! <br><br>We started with the olive yu(zu) focaccia. The yuzu butter was brilliant and so smooth on the olive focaccia. I could eat this bread everyday. What an interesting way to use yuzu. <br><br>Next, we tried the goat empanadas. Again, the sauces on the empanadas were so flavorful. I loved the crunch of the onions over the warm, crisp empanadas. The goat meat was soft and tender. <br><br>We tried the bucatini and pork shank from the meats section of the menu. The bucatini noodles tasted freshly made and had a creamy sauce on it. We really liked this dish. The pork shank is MASSIVE. The meat falls right off the bone. It's so tender and the two sauces that come with it are perfection. I love the pickled radishes and naan that come with it as well. <br><br>We didn't save room for desserts. We were too full from the taste adventure we got to partake in. <br><br>This may be one of the best restaurants I've ever been to. The flavors were unreal and it was absolutely amazing.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7YANxikiNX_AFMQ-5FXbLA/168s.jpg", "caption": "Olive Yu(zu) Focaccia"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/W73E18iHtubbqwkIYPreGw/168s.jpg", "caption": "Goat Empanadas"}]}}, {"review": {"des": "Absolutely amazing. We saw a last minute reservation on Open Table for 4:30 and booked it that afternoon. By 5pm almost the entire restaurant was full. Hostesses were very friendly to me and the others I saw them seat. <br><br>The two seater tables were very tight and next to each other and tables had to be pulled out a bit for the booth person to get in and out. <br><br>Server was very knowledgeable about menu items and recommendations based on our likes. They suggest sharing everything and 4 dishes for 2 people. Our 3 filled us just fine; salad, crab cakes and pork shank. All to die for!!!", "pics": null}}, {"review": {"des": "This place is incredible. I finally was able to get a reservation at 7:15 last Friday, and after one visit, it has instantly climbed to the top of my list in not only Chicago, but also nationwide. 4.5 stars on 7500 reviews speaks for itself in the Yelp universe.<br><br>You HAVE to have a reservation if you want a table here, and likely will have to make that reservation weeks in advance if you plan on coming on a weekend. Wait times exceed 2-3 hours, as this restaurant is situated on Randolph Street in the insanely popular \"West Loop\" neighborhood in Chicago, which is quickly becoming one of the culinary capitals of the country. They're neighbors with the notorious \"Au Cheval\" amongst others. From what I understand, the bar is first come, first serve, and you can order from the full menu here if you're willing to hawk seats.<br><br>Stephanie Izard has been getting a lot of press recently, and in my opinion, she deserves even more. I cannot emphasize how pleased I was  with this meal. I had done a fair amount of research on yelp beforehand, so I had a pretty good idea of the fan favorites. Dress is very casual as well, which is an added bonus.<br><br>After about a 15-minute wait, we were seated and ordered a bottle of white wine, which was reasonably priced. They also comped us some focaccia for not having our table ready when we were seated. I'm allergic to shrimp, so we steered clear of all shellfish dishes, but here are my less-than definitive rankings of everything we ordered (favorite to least):<br><br>Roasted Cauliflower<br>Pan Roasted Halibut<br>Sautéed Green Beans<br>Blueberry Bourbon Baba<br>Grilled Pork Belly<br>Chickpea Fritter Chaat<br>Ratatouille Focaccia<br>Skuna Bay Salmon<br>Braised Beef Tongue<br>Wood Fired Lamb Ribs<br><br>I would HIGHLY recommend you get AT LEAST everything up until the Focaccia. Seriously do not skip the cauliflower... even if you don't like vegetables. I could eat this all day. The salmon and beef tongue were pretty average in my opinion, though my friends RAVED about the salmon. The only dish I didn't care much for was the ribs, but these came second-to-last, and I was pretty full at this point. They are a bit fatty, so it really depends how you like your meat. My friend said this was his favorite dish. This was MORE than enough food for the 4 of us, and we all had arrived extremely hungry.<br><br>I know that the goat empanadas, scallops, squash blossom rangoon and crab cakes are also really popular. Gives good reason to return.<br><br>As if this place wasn't already spectacular, the service was stellar (we left well over 20%+ for tip), as they were really diligent all night. Our waiter also \"sequenced\" our food out, as we ordered all at once, which demonstrated the expertise / knowledgeability of the waitstaff here. There was 4 of us dining, and all said, even with the wine and dessert, this meal came out to under $70 / person, which is incredible for a meal of this caliber.<br><br>A+, would give 6 stars if I could, and you're almost certain to love, regardless of your demographic. Concurrently a great place for any kind of date, but you shouldn't feel guilty coming in with kids either. Fingers crossed that Izard + Co. will get the praise they so deserve from the folks over at Michelin next year.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lbOUsaQx-pTKbqpHPkTzVQ/348s.jpg", "caption": "Blueberry Bourbon Baba"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fvbpdcGeeNKioEo_VZI3Uw/168s.jpg", "caption": "Wood Fire Lamb Ribs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/i4eR8NZ-P976mjN1_Bcakw/168s.jpg", "caption": "Pan Seared Halibut"}]}}, {"review": {"des": "Food is really good, but the place is a little bit noisy which makes difficult to have a conversation, however food wise and service they have 5 stars! <br><br>El lugar esta bonito y la comida muy rica, es un poco ruidoso lo que lo hace difícil para tener una conversación pero la comida, bebidas y servicio son excelentes", "pics": null}}, {"review": {"des": "Walked in with no reservation and didn't want to wait for a table so we sat at the bar (just me and one other person). We ate very comfortably at the bar but if you do want a table, make a reservation. The bar tender/server was extremely helpful! Great service! We had the such a fun-gi bread, sautéed green beans, seared scallops, and pan roasted arctic char. The combination of ingredients was surprising and amazing. Also loved how the place was decorated, comfortable setting", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Hmdlsz4-yQjVjT_U0EC1zg/348s.jpg", "caption": "Such a fun-gi"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PBb1ZumyI-6iWWEngL51gQ/168s.jpg", "caption": "Sautéed green beans"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7opVRm1be2lv9nXhg6QXUg/168s.jpg", "caption": "Pan roasted arctic char"}]}}, {"review": {"des": "Oh my gosh, what a wonderful meal! My husband and I finally used a gift card we had received for this restaurant and it was such an enjoyable experience. The server was so great, really helped with giving us recommendations. Everything is shared, they recommend 2-3 plates per person. We decided on bread, green beans, salmon, oven roasted pig face, confit goat belly, and caramel corn malt balls to top it all off. Seriously, everything I ate was delicious. I think my favorites were the salmon, it definitely was way better than it is described on the menu, and the confit goat belly, which was rich and decadent. I left extremely full and extremely satisfied. Highly recommend!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/NPmQEzbFEdTgrYHbFm9ErQ/348s.jpg", "caption": "Wood Oven Roasted Pig Face"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zvgc6O23M-Cr3YjCbWuI3w/168s.jpg", "caption": "Confit Goat Belly"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mhonLKQRcFUBuS5IcktnAA/168s.jpg", "caption": "Skuna Bay Salmon"}]}}, {"review": {"des": "Let's be serious, what can I really add here? This place is AMAZING. One of the star restaurants of Chicago, yet unassuming and inviting without a hint of snobbery. The chef shows off her skill with this restaurant - each dish is carefully curated to be packed with great flavors, unique enough to leave you wondering how they made it. We came here to celebrate a special occasion and couldn't decide what to order but our waiter was super helpful at recommending a good combo and amount of food. <br><br>Food: Let's just say it now, first things first - you HAVE to get the green beans. Schwaa? You are going to a top restaurant to get.. green beans? For real, I have never had green beans that good - I am still dreaming of the sauce and presentation. We also had the beets which were great, the soft shell crab (to die for), the pork shank (to die for) and a few cocktails (loved \"It's always sunny in oaxaca\" - so good, just sweet enough but not too sweet, complex taste with a bit of spice on the rim!). <br><br>Bottom line, one of the best restaurants and dining experiences of my life - would highly recommend you come here! We made reservations waaaay in advance (weeks) but it seems like you can walk in on non-peak days/times and get a spot. You HAVE to check this place out!!! PS the day we went, our waiter said the chef was in the line cooking. How cool is that!!??!", "pics": null}}, {"review": {"des": "My D.C. friend texted me earlier as his plan had changed and he would not make it to Chicago after all, leaving me alone to dine on a Sunday evening. Perhaps I'm not as emotional as I used to be, or perhaps I am too sick to care, either or I was not offended, I was alone and I had my eyes set on this wildly popular restaurant. Only 0.8 mile away from my hotel, I walked faster than I thought and almost missed it. I went to the bar area and got a single seat as I was dining alone and the restaurant was booked, as per usual. When you have 7000 plus reviews and still get a 4.5 stars you wonder what is the appeal, so it's really the curiosity that led me here.<br><br>I had limited appetite so I went for a goat belly and poke, and duck tongue because I actually have eaten duck tongue before and liked it. Sure enough, both dishes were pleasant and small portioned and perfect for a table for one. I also got some ice tea to chase down my salty, highly processed, yet delicious food. <br><br>I understand just about anyone who has been to Chicago more than once or twice has been here before, but until recently I rarely come here and I don't know the food scene.<br><br>So when I got home and told my fellow traveler friends, they all said, \"Oh yes, it's not a Michelin but it's so good, I've been there.\" It led me to believe that I'm really the last person in the know about Chicago's eats, but at least now I have checked off one restaurant that everyone knows about. If I'm right about this, I'll be back here in September for another meeting after D.C. <br><br>On that topic, I have not written back to my D.C. friend, who probably thinks I'm pissed at him. I'm not, I just got busy. I should probably tell him that I had gone here, I bet he's eaten here too, along with the rest of his fellow ex white house staffers under the Obama administration, along with at least half of the entire Yelp population. It's that good.", "pics": null}}, {"review": {"des": "I will get fat!<br><br>Food is so good, you can't stop even if you are stuffed! From beginning to the end everything was exceptional, except the service. We wanted to try drinks of the menu to try everything and mine was fine but wife's drink was a bit to sweet. But we didn't complain, the server asked how are the drinks and wife replied \"it's okay\" and the server had an attitude for the rest of the night. But we overlooked that because food was really good. All and all we want to go back and try somethings that we didn't the first time and give it another go. I highly recommend the lamb chops as the slide right off the bone with no effort.", "pics": null}}, {"review": {"des": "I've been waiting years to get back to Chicago to try out this gem touted by my friend Anthony B. And tonight was the night! <br>We sat at the bar (first come first served). You can also reserve a table but when I called 3 weeks prior, they had already been fully booked for a Sunday night!<br>The room was filled with the younger set: people aged 25 and up to 60s. Dress was casual due to the millennial crowd but not pretentious.<br>The bartender was great. We didn't order drinks but he gave us suggestions and and recommendations like we were ordering top shelf booze! Great staff everywhere! All of them were so incredibly helpful!<br><br>Course #1:  Kohlarabi salad with fresh fennel,  toasted almonds, roasted shiitake mushrooms, Dutch beemster and pears!  A unique pairing of flavors both sweet, savory and with a gentle crispness.<br><br>Course #2: Roasted Lamb ribs in blueberry tamarind glaze with fresh scallions! It's meat candy at its finest!!  After your first bite you will want a huge plate of this stuff!<br><br>Course #3: Wood grilled broccoli with melted Smokey Bleu Cheese and spiced crisped rice! Smokey deliciousness! Who would have thought broccoli could be healthy AND yummy!! <br><br>Course #4: Goat Belly Confit with bourbon butter, crab & lobster with fresh fennel!  I have to admit that I wasn't sure you could pair surf and turf like this, but OMG it was fabulous! Sir, I'll take ten more of these to go!<br><br>Course #5: Seared Diver Scallops with wild maitake & wood ear mushrooms in an oyster sauce brodo with a squash brandade! Again, a culinary masterpiece!<br><br>I always like to have a sweet finish. But there were two desserts I had to do and I figured I'd let them each duke it out for the honor of being number one!  It was a tie:<br><br>Dessert #1: <br>Sponge cake with a gooseberry shortbread crumble, honey mousse, whipped cream and gastriqué! <br><br>Dessert #2: <br>Homemade Malted vanilla ice cream with caramel corn and crispy chocolate shell!<br><br>OMG fantastic!  I just died and went to a gastronomical heaven!!", "pics": null}}, {"review": {"des": "You must go at least once and look for Elaine, the Girl with the Star Wars tattoos. <br><br>Listen, I just had the greatest night of my life at Girl & the Goat. We flew in from SF and had a terrible first foodie experience the night before. With empty stomachs we were hopeful this place would meet our expectations . It exceeded them by leaps and bounds. <br><br>We had 14 dishes, 1 of them so nice we had to have it twice. Sounds like a lot, but it's meant for sharing and there were four of us. My husband and I, my broke college foodie daughter, and my young pre-teen baby foodie. They recommend 8 dishes or so for 4 people but everything was so good we just kept going!  <br><br>From beginning to end, the entire staff was welcoming and the service was impeccable. It was beautiful and busy in there, but you would never know it because the service was so outstanding. Our waitress Elaine was very sweet, knowledgeable, & had great suggestions. From the drinks to the dishes she thought we would like and even some off menu suggestions, she was killing it. <br> I'm definitely not a professional reviewer, I just know how this place made me feel so if I don't describe the dish adequately, sorry! <br>All of the dishes were great but the stand outs for us were the hamachi(refreshing and light and flavorful AF), the lamb ribs(falling off the bone and we ordered it twice), the string beans, goat carpaccio(It was beautifully presented and it was tasty), Branzino in spicy shrimp sauce(so perfectly made, I could've eaten this by myself) confit goat belly(lobster shrimp and goat-oh my! but it works! The bourbon butter was very nice. ) octopus on pepita mole is so good...I mean I guess what I'm saying is, it's worth it. It really is. <br><br>Gluten free bread that is actually delicious. I'm not gluten free, my hubby is, and usually I have to sit there all \"Yeah, this is umm, good.\" But I actually meant it this time. If I wasn't told it was GF I would've never guessed.", "pics": null}}, {"review": {"des": "This place is probably on all the must-eat/try restaurants in Chicago and it definitely lives up to the hype. If you weren't keen enough to make a reservation two months in advance, you might be lucky to snap a seat in their waiting area where you can order from the full menu without having to wait for 2 hours to be seated. <br><br>Between 2 people we shared 5 plates and everything tasted incredible. The ponzu oysters, rock shrimp, and cauliflower are must try's but I think just about anything from the menu would be good.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Tqq_vw45CU7jshePsr8Oow/348s.jpg", "caption": "Florida rock shrimp"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Xe_vOqaLapIBRQwAmrdVFg/168s.jpg", "caption": "Ponzu mignonette oysters are a must try"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pGthYX1DDXMco9i2_dF4zw/168s.jpg", "caption": "Pseudo-dining/first come first served dining area"}]}}, {"review": {"des": "So much has been written about how great this place is and I get it.  I can understand the cult-like following and applaud the restaurant's success.  In my opinion, though, that success is due mainly to the staff.  There is zero pretension in the place!  It gives off the feel of the local family restaurant.  It's first-rate food, but world-class people.<br><br>Thanks for making us feel welcome.", "pics": null}}, {"review": {"des": "Update: 10/27/18<br><br>Back for another visit to \"The Girl and Goat\", and happy to say this experience was on par with our first. Had reservation for 6:30pm on a Saturday night (very busy) and was seated by 6:28pm. The staff was dressed in Harry Potter theme for Halloween which was funny.<br><br>We ordered the following on this go around:<br><br>Smoked Apple Pirogies<br>Wood fired Lamb Ribs<br>Duck Tongues<br>Wood Oven Roasted Pig Face <br>Goat Neck<br>Chocolate Pavlova Says-a-Me! (Dessert)<br>Sticky Tasty Crunchy Toffee Yummy Cake (Dessert) <br>All Nighter (Cocktail)<br>Talkin About Chai-Town (Cocktail)<br>Rory McIlroy (Cocktail)<br><br>Everything was top notch just like our last visit. We purposely tried new things this go around, since each item is always so good. The exception being the Roasted Pig Face... hard to not get that one again.<br><br>Favorites had to be the Lamb Ribs (one of the best things I've had in my life) and the Goat Neck (more food than other entrees... this was a special so probably not always available).<br><br>As usual you get through a couple small plates together and think -- \"Man this is good but will it fill me up?\" Then by the end you are totally stuffed.  <br><br>We definitely spent more this time ($36 on just cocktails).  The All Nighter is good but wow is it strong. Probably why they give you half a glass worth lol. <br><br>We will be back. Hard to beat this place.", "pics": null}}, {"review": {"des": "Oh my goodness - one of the best restaurants we visited while in Chicago. We weren't able to get a reservation so we walked in at 5 pm (30 minutes after they opened) and were able to snag a table right away at the bar. <br><br>I started off with a puttin on the spritz cocktail, which was so refreshing and hubby had a local ipa. We got the goat Empanadas and omg so flavorful! They were served with a blueberry pick which was so unexpected but so amazing at the same time. Then we had the soft shell crab cakes which had blackberries and a soy glaze. Again, so unexpected but the flavors pair so well with each other. Next had the cauliflower and the mint was good in every bite! Last, we had the pork bucatini. A bit salt but great nonetheless. <br><br>Such. Great. Food.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/j6e566Bq7s5vlVjWSLliyg/168s.jpg", "caption": "Bucatini"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PsZXB0y0F0QaYnjTItB3Og/168s.jpg", "caption": "Roasted Cauliflower"}]}}, {"review": {"des": "4.5 stars for being inventive here. Hip ambience at this top chef restaurant. The lighting was a bit too dark for me. <br><br>I would recommend getting half portions whenever possible (eg. ravioli, cauliflower, shishito pepper) to try the maximum amount of dishes here. <br><br>MUST HAVE:<br>Duck Tongues with tuna and black bean poke, crispy wontons, piri piri - this dish was phenomenal. Never thought that fried duck tongue would go with tuna but it does! Great balanced of flavors and textures. Don't get scared of duck tongues which were deep fried and little bites mixed into the entire dish. <br><br>SOLID:<br>Roasted Cauliflower with pickled peppers, pine nuts, mint - the cauliflower is a bit over cooked but really liked the pickled spicy pepper here, which saved the dish. They doused it in parmagiano cheese (which wasn't indicated on the menu). I would have preferred it without it. They should have indicated it on the menu so people can opt out. <br><br>Escargot Ravioli - bacon tamarind sauce, escarole and celery, crispy & carmelized onions. Interesting dish. Liked the caramelized onion in this dish. The sauce was a bit too salty. <br><br>SKIP:<br>Pan Fried Shishito Peppers - parmesan, sesame, miso. This dish was trying to be inventive but felt short on the mix. The shishito peppers were just way too hot (1 out of 3/4 were spicy). The Parmesan creamy crust was an interesting test but just didn't go with the crunchy spiky shishito.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qucNKpuiZNahMwzQo0ZCYw/348s.jpg", "caption": "Grilled cauliflower - ask for the cheese on the side. Pretty good."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1l2hScPKfgVj_PWX6sn6Rg/168s.jpg", "caption": "Nice ambience even though it was a bit darker than what I prefer."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/qW4ZgUN6JEeTzbhHkbH_Xw/168s.jpg", "caption": "Duck tongue with tuna poke - phenomenal"}]}}, {"review": {"des": "With the amount of reviews this restaurant has I was really hoping it would live up to the hype which it did.  Most of the dishes here were excellent, if i had to put the them in order of my favorite to least it'd go something like this. <br><br>1. lamb ribs<br>2. soft shell crab<br>3. kohlrabi salad<br>4. wood oven roasted pig face (its like a breakfast plate)<br>5. chocolate pavlova<br>6. ratatouille focaccia<br>7. pork belly<br>8. sweet onion brioche<br>9. roasted beets<br>10. hamachi crudo<br>11. roasted cauliflower<br><br>The service here is pretty good, some of my party would disagree, but the server seemed fine to me.  If you'd like to try a refreshing cocktail try the \"puttin' on the spritz\", it's fruity and tangy.   One item that looked awesome that we didn't order was the pork shank, we saw many of those come off the kitchen line.   We came here with a big group so we all got to try a bunch of things (9 people) which i'd also recommend doing.  <br>  If you're coming from out of town then I'd suggest making reservations far in advance.  For our party of 9 we had to make reso's 2 months in advance and we could only get 5pm on a Friday.", "pics": null}}, {"review": {"des": "This restaurant definitely lives up to its amazing reviews. I was in Chicago for a few days and was told this place was a must. It's based on ordering small plates -- the waitress recommended 3-4 for two people eating. The seared scallops with the summer sausage succotash were divine. The best thing I ate however was the pork shank with naan, peach slices, and two amazing sauces. It was my birthday and on top of the dessert we ordered, they brought me another delicious little treat as well. This place is perfect if you are looking to spend a bit more money on food. I didn't even mind though because it was one of the best food experiences I've ever encountered. Our waitress was super friendly and the rest of the staff were super attentive and continuously made sure we had everything we needed. I'll be dreaming of this food for years!", "pics": null}}, {"review": {"des": "When a friend of mine mentioned that the Girl & the Goat was one of the best meals they've ever had in their life, I knew I had to make a trip out during my Chicago vacation. The universe must have been on my side the day I tried getting reservations because after a few minutes, I was able to snag a 7:30 dinner on my first night. (FYI: the restaurant will call you 2 days before your reservation to confirm.) When we arrived, the restaurant was completely packed (and it was a Wednesday night)!  The G&G definitely emits an overall vibey/classy/cool/ comfortable feel. I like that people dressed up but it's lowkey enough to wear jeans.<br><br>Okay, so on to the food! Our server (who was very nice and accommodating) recommended 5 plates for a party of 2. We ordered: 1) the sesame grape sourdough with BLACK SESAME BUTTER *yum!!*  2) goat empanadas 3) braised beef tongue 4)shishito peppers 5) roasted pig face. <br>I was completely blown away with the flavors & the execution of the dishes! The g&g is probably one of tastiest dining experiences i have ever had! <br><br>My only pit of the evening was the Carmel corn and malt balls dessert. It was extremely salty! My boyfriend and i couldn't finish it because the salt was just too overpowering. :(", "pics": null}}, {"review": {"des": "Coming from New York City, I have to say this was one of the best meals I've had in 2018 so far. I had reservations for 2 on Sunday 9pm and the restaurant was packed. It was spacious, dark and loud. The service was fantastic from the moment I stepped in. <br><br>The waiter suggested 6-7 plates to share between 2 people. Unless you're starving I'd say 3-4 plates is more than enough! <br><br>We ordered: <br>- Goat empanadas: Good! The pico and cheese was an interesting twist giving it a burst of flavor. I only wished the portion was bigger. <br><br>- Confit goat belly: My favorite of the night! The confit was PERFECT! Crispy and super fatty melttt in your mouth delicious. The crab and lobster were soaked in this addictive buttery sauce. I almost licked the plate clean. <br><br>- Pork shank: Great! The pork shank was huge, crispy on the outside and tender on the inside. It came with a creamy buttermilk dressing and kimchi sauce that wasn't too overpowering. I LOVED the warm buttery naan. I felt that the pork itself wasn't that special. It needed the side condiments.<br><br>- Lemon make you happy: I was stuffed by the time I got to dessert. The lemon cake came warm. Very good but I thought the cake was way too sweet. <br><br>- Bubba watson cocktail: This was delicious but sadly weak with the alcohol. I had the rest of my meal with red wine. <br><br>Chef Stephanie Izard did an incredible job with the menu. She took flavors from different cultures all over the world. The combination with the ingredients paired perfectly! Such a memorable dinner. I highly recommend making reservations in advance. By the time I left around 11pm, there were still people waiting to be seated!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XPsESJc4Xxowr4PEsPB3DA/348s.jpg", "caption": "Lemon Make You Happy"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/8qBOqJZye1xC4DX3YYDDlA/168s.jpg", "caption": "Confit Goat Belly"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0vIUYF1nd2ree-ucfebGTw/168s.jpg", "caption": "Goat Empanadas"}]}}, {"review": {"des": "I'd say this place is a bit too hyped and I debated between 3 or 4 stars. Gave it 4 stars since I only tried it once and maybe I ordered too much/got full of the first items considering I dined alone here. <br><br>I ordered the chickpea fritters, pig face, and these dumpling things. I thought the fritters were good but nothing to write home about. I found the pig face too salty / too heavy for me, but this was also one of the dishes that came out last. The dumplings were also good but I thought the chickpea fritters were more interesting. <br><br>I'd consider trying this place again with a larger party so I can try more items. The cocktails were fine, but considering I had just come from The Aviary, it's hard for any cocktail to measure up.", "pics": null}}, {"review": {"des": "Echoing a lot of what I've read about this place.  Was lucky to get a reservation from a friend.  Service was fantastic.  The food was great, especially the goat empenadas.<br><br>Cocktails were also very good, we were seating right next to the famous painting.<br><br>I'd say for the price and pain of entry, I can't quite give it 5 stars.  The food is great but I can also get meals around that rival it for a little cheaper with less of a hassle.<br><br>I will still probably be back, like it a lot.", "pics": null}}, {"review": {"des": "The greatest! The tastiest! One of my favorites in Chicago. Wish she'd bring back the deviled eggs though. :( <br><br>Everything I've had here is a flavor explosion. Service is exceptional.", "pics": null}}, {"review": {"des": "Despite my initial skepticism, Girl & the Goat is well deserving of its 4.5 star rating. I'm always suspicious of restaurants that are universally hyped. And Girl & the Goat falls squarely in that bucket. There wasn't a single person who I told about my upcoming trip to the restaurant who didn't \"ooh\" and \"aah\" about it. Which made me eye roll a bit.<br><br>Anywho, it turns out that Girl & the Goat is worthy of the hype. Most of the dishes we ordered were excellent, including the scallops, octopus and hamachi crudo. Other dishes were really good, although I'll probably try other things next time I'm there (e.g., the chickpea fritters, oysters and \"breads\"). I was really looking forward to trying to goat empanadas, but I was so stuffed by the time they arrived that I could only muster one bite, and I feel like I can't fairly judge them based on that bite.<br><br>Food aside, I was also really impressed with the staff. In my experience, the staff at trendy restaurants is often pretentious and annoying. But here, everyone from the hosts to the servers to the busers were friendly, respectful and seemed genuinely welcoming (shout out to my man Einstein, in particular). For me, this actually elevated the experience to a solid 5 stars.", "pics": null}}, {"review": {"des": "Might be my favorite restaurant in Chicago. <br><br>Interior - Decorative, classy, and fun. <br><br>Service - Good. Dishes are timed on point to make sure you enjoy each item sufficiently before the next dish is delivered so you aren't swamped with 3 dishes at the same time all out of order. <br><br>Roasted cauliflower (pickled peppers, pine nuts, mint) - There is cheese. Delicious, salted, savory, soft, and tastes like home. <br><br>Escargot Ravioli (bacon tamarind sauce, escarole & celery, crispy onions) - Couldn't taste the escargot. Resembled more like flattened dumplings in some broth. Loved it. <br><br>Pan roasted halibut (marcona almond butter, white asparagus . blueberry nuoc cham, beech mushroom) - Fish sauce!! It was truly delicious and honored the Vietnamese fish sauce taste without watering it down. Must order. <br><br>Crisp braised pork shank (buttermilk dressing, grilled spring onion & radish kimch, naan) - Pork falls off the bone. Delicious, savory, soft. Naan is decent but the pork is so good without it. <br><br>Lemon make you happy (lemon​ pound cake, sorrel ice cream, almond crunch, cheesecake sauce) - My husband hates lemon and pound cake but he ate it all. Must order.<br><br>The Jam (Old Forester Bourbon, strawberry shrub, saison) - The perfect refreshing summer strawberry drink.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZRf2BuxedoiKPNpUuU2MVQ/348s.jpg", "caption": "Lemon pound cake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WeAxhKhm0bcpnJHGk_UTzQ/168s.jpg", "caption": "Pork Crisp Braised Pork Shank"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IqS61piNFUgfkA_knyUkKQ/168s.jpg", "caption": "Pan Roasted Halibut"}]}}]}