{"name": "kumas-corner-belmont-chicago", "reviews": [{"review": {"des": "Um..... of course this place gets 5 stars. It's f#&$ing Kumas! My favorite place in Chicago. Atmosphere, and great food. What more could you ask for! I can't believe that it took me over 4 years to get to the original location, but happy I did. Great Kuma's feel, same great quality burger, and of course the metal! I should eventually order something other than the Zeppelin.... but it's just so freaking delicious. <br><br>There's no question, of course I will be back. If you're reading this, do yourself, your stomach, and taste buds a favor and get your butt here.", "pics": null}}, {"review": {"des": "With all the hype I had to stop in when I came to town for a show and they did not disappoint.  The service was amazing and the staff was very friendly.<br><br>The menu has metal themed gourmet burgers, many of them sounded amazing.  The burgers come with pretzel buns or the option to get a gluten free bun for an up charge.  Our food came out quickly and the portions were large.  Even though I'm not a big fan of pretzel buns, I thought my burger was great.", "pics": null}}, {"review": {"des": "I had try a burger here after hearing all the hype about it. I think if I went to Kuma's without thinking I was going to get the best burger that's ever crossed my lips without anything coming close to being as good, I would have been more impressed. <br>However, it is a pretty damn good burger. I love the atmosphere as well. I've noticed there's a theme throughout the city with heavy metal + bomb burger places. Which even though I'm not personally into heavy metal, I dig the combination. <br>I'm a huge appetizer girl, but considering I heard these burgers were massive I skipped on ordering anything else. I'm glad I did because the photos are not deceiving... these burgers are huuuge. And they don't skimp on the fries either. Speaking of the fries... they were alright. I wouldn't knock the burger based on the fries but they weren't anything special. I ordered the Kaijo burger which is topped with bacon, blue cheese and friend onion straws. My fiancé ordered the Pantera burger. Mixed feelings on my choice. Like I said, it was very good, don't get me wrong. I would have eaten an entire bowl of those fried onions. But it was a little one note for me. The pretzel bun to patty ratio was off, too much bread to meat. So the whole thing just tasted slightly dry. My fiancé enjoyed his, but also agreed it wasn't the best burger he's EVER had. I liked his better than mine, maybe I'd stick with a traditional bun next time. <br>The service was great and I feel like places like these have the best employees, they're always so laid back and down to earth. Their menu has sooo many great burger combinations that I would definitely come back to try more. Not my number 1 burger place, but it's up there and everyone should try it!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/jg9HQED4Y55wr8vCgPiweQ/348s.jpg", "caption": "Top: Pantera Bottom: Kaijo"}]}}, {"review": {"des": "Heavy metal and burgers. Burgers meet mosh pit. Head bangers and burgers. Their burgers are big and bold, and take inspiration from heavy metal music as you'll notice the theme throughout the restaurant.  When I first moved to Chicago just over 3 years ago, the guys delivering my mattress were raving about the burgers Kuma's Corner and that it was a must try when in Chicago. Over 3 years later, I can say that the burgers indeed did not disappoint! Along side of the heavy metal playing throughout the shop, the walls are lined with decor of some of the heavy hitters and even their burgers named after famous bands.<br><br>Being naturally drawn to burgers with a bit of a kick to them and being an Iron Maiden fan, you could say I didn't have to look too much further to find the burger calling my name. The Iron Maiden is stacked with avocados, cherry peppers, pepperjack cheese, slabbed with a healthy serving of chipotle mayo, and of course the fresh lettuce, tomato, and red onions to complete the burger experience. All of this stacked on a 10oz patty cooked to your liking. The medium came out perfect and I kind of loved you could see the fire roaring from kitchen with the heavy metal blasting. Really don't have anything bad to say about the burger... it was big, juicy, and messy from the get go. The combination of ingredients had my taste buds two stepping the entire time. The fries were pretty good, no complaints there.<br><br>While the burgers are pretty awesome, ambiance is a bit dark and gloomy. Probably wouldn't be a first choice for a date or after a gnarly hangover just due to consistent metal being played. But if that doesn't bother you and you're looking for a great burger, Kuma's won't disappoint. <br><br>Not much else I got on this one. 'Til next time, cheers!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xXEJOwIWECxRb_LbXFDpbA/348s.jpg", "caption": "Kuma's"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UEHDO6aJUzh3WpKYlmqS0Q/168s.jpg", "caption": "Neurosis"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qPsWCXgrIsaEGFDG24ixqw/168s.jpg", "caption": "Iron Maiden"}]}}, {"review": {"des": "Forgot the picture of the burger my apologies. <br><br>First know they do not take reservations and your entire party must be present to be seated. Wasn't  a huge crowd but just an FYI. The place is also a little tight. <br><br>The jalapeño poppers had a really good flavor with chorizo in them. We picked the Mac and cheese with back and andouille sausage and it was great. Nice and cheesy and so flavorful!<br><br>For burgers they were all really good. The vegan burger was good but nothing you go crazy over. The YOB has great flavors had to remove some of the roasted peppers just because it was too many. <br><br>Your eyes will be bigger than your stomach just a warning!", "pics": null}}, {"review": {"des": "Dark.<br><br>Metal.<br><br>Burgers.<br><br>This place in three words.<br><br>I came here with some Chicago friends, knowing nothing about the place other than it had good burgers.  And I'm thankful for that.<br><br>The heavily-tatted waitresses and loud aggressive music were a welcome surprise!  And, it doesn't feel like wallpaper, it feels like it's a part of the core of this place.<br><br>The burgers are the kind that lean heavily on their exotic/quality/novel toppings.  I got whatever the special was, because I like to pretend I'm a local, and it was incredible.  Just the right amount of \"sink\" when bite into it.", "pics": null}}, {"review": {"des": "What an amazing restaurant! They have a draft of the month where $1 goes to charity (diff charity every month) and I seriously love that! <br><br>The concept is metal, so metal music playing (which is awesome!) and the burgers are named after some metal bands. I loved it! Their burgers are so delicious and the toppings are creative. For $14 it's a great price, especially when you can choose 10 oz beef patty, chicken breast, impossible burger, or a couple of other options. I plan to be back real soon to try more combos. The portions are huge, it's a unique, cool concept, and they put a lot of thought in to the creations offered. They also have a seasonal Mac n cheese and burger to choose from as well. <br><br>I ordered the lair of the Minotaur burger, which had Brie cheese, caramalized onions and a bourbon pear topping. Also supposedly pancetta, but I did not taste that. Regardless, this was delicious! I had my beef patty cooked to medium well and I ate every bite. My friend ordered the pantera and he was licking his plate clean. Seriously impressed with the burgers they cooked up here. <br><br>Parking was very easy. Came in on a Friday evening and waited maybe 15 min for a table at 6 pm. Highly recommend and will definitely be back soon!", "pics": null}}, {"review": {"des": "One of the best burgers in Chicago in my opinion. This restaurant is very divey in a good unique way. Their entire play list is heavy metal, almost as if the clothing store Hot Topic decided to open a restaurant. They have other locations in the Chicago land area, but this is the original and the only one that's unique and divey. It's a relatively small place, they don't do reservations, but you can get a drink at the bar while you wait. The menu is different kinds of burgers named after heavy metal songs. If you are vegetarian you are out of luck here. My two favorites are the Kuma's burger and slayer. Kuma's burger is a simple burger with an egg on top, I love it because all the flavors are on point and it's not overly complicated. The slayer is a burger patty smothered in chili and fries. You eat it with a fork and it's just a wonderful combination. They have a different special burger every month, and so far the ones I've tried have all been very good. One last thing that you can't miss is their Mac and cheese. It's customizable and it is honestly the best Mac and cheese I've ever had so far. You have to order it!", "pics": null}}, {"review": {"des": "I've only been to this place 3 times since discovering a few years back but every time I go, I try something new...never disappointed. <br><br>Th burger combinations are ridiculous..ly good. Can't remember the name of one of their specials but it was a burger with a waffle, maple bacon, a chicken tender, perhaps some syrup, and maybe cheese? Whatever it was, holy crap! I want another! <br><br>If you've never been, do yourself a favor and go...now! Oh, and get the jalepeno poppers that are stuffed with chorizo. You can thank me later.", "pics": null}}, {"review": {"des": "There are many imitators, buy only a few innovators.  Kumas Corner, and their Avondale location specifically, is the home of innovation.  It's true, once this restaurant came onto the Chicago gastropub and bar scene, all of a sudden similar restaurants started popping up all over the place trying to cash in on the gourmet burger.  Some even stole the pretzel roll while others tried stealing the edgy imagery (tsk tsk tsk).  But, when it comes to gourmet burgers and an intense atmosphere, Kumas is where you need to go.  Yes, they blast heavy metal, and yes they play gnarly horror movies on the big screen.  It's part of the Kumas experience to watch a zombie flick while eating your burger.  They have been praised by hundreds of food publications, making top 10 burger lists all over the world, and they have become foodie tv show icons (thank you Food Network).<br><br>I've been coming here for years and have tried damn near almost everything on the menu.  Best appetizers are the jalapeño poppers or the buffalo chicken strips.  When it comes to burgers, you've got options: If you like spicey, get the Plague Bringer burger or the High on Fire.  If you like mellow, get the Pantera or the Kumas Burger.  And if you like to take a walk on the wild side, try the Lair of the Minotaur or the Slayer.  <br><br>For the past year or so though, I have been getting their mac and cheese.  Honestly, their mac is absolutely fantastic!  When my girlfriend and I go, we usually get a burger and a mac and cheese and just split half and half so we get the best of both worlds.  I always get sweet corn, jalapeños and caramelized onions in my mac and cheese.  Stupid good.<br><br>Kumas is popularly known for being the place to make you wait a few hours to get a seat.  It's all about timing, if you do go, try to avoid dinner hours.  Best time to go is after 9:30pm.  Yes, it is also true, they don't serve Miller or Budweiser products.  Leave that p!$$ water for when you're watching football games and get an actual beer!  Also, heavy metal is being blasted, and edgy imagery is everywhere.  If that offends you, well... <br><br>Just enjoy the food and overall experience!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/R1lviORbA1gkkFeooqrNTw/348s.jpg", "caption": "House Salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dRrIg8NNf9_XRaF2nrFhlg/168s.jpg", "caption": "Mac & Cheese"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xzHCB2ktyfyn35_C5rxKrg/168s.jpg", "caption": "Plague Bringer Burger"}]}}, {"review": {"des": "I've loved Kuma's since my first bite 4 years ago and I keep coming back for more.<br><br>Located on Belmont in Avondale, this is basically a hidden gem. While everyone knows about it, it's definitely off the tourist trails. It's a small space and they're always blasting heavy metal and it's always a good time.<br><br>My favorite burger is the Goatsnake burger. I literally order it every time I get it for delivery or whenever I stop in. It's a burger with goat cheese and corn and fried onions and it's delicious. <br><br>They serve the Impossible Burger here and you can get a vegan sandwich or you can replace the beef patty with the Impossible Burger. I actually find the Impossible Burger delicious but I don't always want to spend the extra few dollars to change the burger.<br><br>The one downside to Kuma's can be the wait. If you come during peak times, it's going to be a bit of a wait and there's not really anywhere to wait. Even the hostesses have to chill in a corner by the door.<br><br>Overall I definitely love Kuma's and I highly recommend checking this place out!", "pics": null}}, {"review": {"des": "Hubby and I decided to give the original Kuma's another try since we weren't really impressed with the burgers during our initial visit years ago.  Back then, they only had one location and the wait was terribly long (over an hour) with not much space inside to wait comfortably.  I had tried the Mastodon burger but remember the patty being really dry.<br><br>Fast forward to now when we decided to go for Friday night dinner around 6pm.  We got there and didn't have to wait for a table for 3.  My colleague had recommended trying the Mac and Cheese, which he liked better than the burgers.  It comes with scallions and a choice of 2 other ingredients so we ordered broccoli and corn for our toddler.  It was definitely one of the best mac and cheeses I've ordered.  The portion is so huge too that we were eating it for another 2 days.<br><br>For the burger, I tried the YOB that came with smoked gouda, a ginormous roasted red pepper, and garlic mayo.  The burger was juicy this time.  Also not as big of a burger, as I was almost able to finish it in one sitting.  Then again, I was also 9 months pregnant so that may have been a factor.<br><br>Overall, I definitely liked it the second time around and glad we are closer to the original location especially since the other one ended up closing recently.", "pics": null}}, {"review": {"des": "Burgers are awesome! The place is small so the wait can get a little long, but def worth it!", "pics": null}}, {"review": {"des": "Great burgers and service! I was a little intimitated learning this was a \"heavy metal\" place but the staff were soooo nice that I had a really good time. <br><br>I would definitely recommend trying the different brews available and trying a little bit of everything on the menu. This place is a hidden gem and worth the trip!", "pics": null}}, {"review": {"des": "Hands down the best burger joint in all of my adventures! This place is not for the faint of heart, proceed with caution. Death metal fills the airwaves with 0% possibility of the volume being turned down or station changed. Forget about watching the game, the tv plays classics such as Conan. You will need to dedicate all of your attention on the food anyways.<br><br>I chose the burger of the month, which blew my mind away. This appeared to be an 80/20 burger topped with grilled buffalo, fried blood sausage, gouda cheese, bone marrow butter, and cherry jam; the behemoth was served inside a warm pretzel bun with hand cut fries as a side. <br><br>The beer selection is above average and everything about Kuma's will keep you coming back.", "pics": null}}, {"review": {"des": "Finally came here, for lunch. Believe the hype. An incredible selection of burgers...and mac & cheese! Each month there is a special for both in addition to the multitude of combinations you can get of each one. Huge menu includes great appetizers (my first time trying fried pickles - DAMN GOOD!), salads, and sandwiches. What really impressed me the most? This place has been featured on a variety of shows and has a huge following - and yet the staff is down to Earth and just plain wonderful! Kindness, patience (you might have questions regarding items, recommendations, side orders, etc.), just great, cool people. Cannot wait to come back.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Wlv4XFTp_Jwb6fKrAE8hjw/348s.jpg", "caption": "Packed at 12:45pm on a weekday. If that doesn't hint as to what a great place this joint is, I don't know what will..."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/kb9t3f8v1mJEFq2-J8e0DA/168s.jpg", "caption": "September Burger Special..."}]}}, {"review": {"des": "The burgers here are amazing. The fried zuccini is some of the best we've ever had. I like their dinner salad too. Lots of fresh veggies! <br><br>Definitely worth the drive.", "pics": null}}, {"review": {"des": "This place is amazing! Luv the rock, goth decor <br>We sat at the bar and Vivian was my kinda bar tender Frank, experienced and funny. She gave several suggestions for beers, drinks n burgers <br><br>We had Lil Boy (beer), the Neurosis & Led Zeplin Burgers.<br>The food was cooked in an open kitchen, the burgers were thick, flavorful and broiled to perfection. We had regular fries but the waffle ones looked better!<br><br>The Kuma's on Belmont is one of the best known burger establishments in Chicago and our burgers lived up to that reputation!<br><br>Peace & Luv<br>Dequria", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ex4Z39SlYHqQrkkc1iweQA/348s.jpg", "caption": "Led Zeplin"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2fGP7zCFzWL_0wlcrBX_1Q/168s.jpg", "caption": "Vivian"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_Qd7u2JauaYLj-CV8rkerw/168s.jpg", "caption": "Neurosis"}]}}, {"review": {"des": "Very cool place inside. Bartenders were very nice. Great burger selection and the Black Sabbath burger was awesome!! If you're craving a big burger, this is place to go!!", "pics": null}}, {"review": {"des": "Alrighty I'm not sure why I even have to write a review of this place. Rock n roll has been relegated to the Dark shameful corners of society with the rise of the only thing that's cool is hip hop and all that goes with it BUT NOT AT MUTHAFUGGIN KUMAS. I would not recommend this place if you aren't awesome or are a snowflake. I would recommend this if you love loud music, interesting people who love life and have a story to tell, love great service, love awesome flavor filled food, love a massive selection of great cocktails and beers and spotting the occasional rock star.<br><br>Don't bring your kids, unless you are a great parent who doesn't want to shelter your kids with lame weekend soccer games and a helmet for everything... and in that case, bring your kids and show them what a good time looks and smells like.<br><br>Go, spend money, tip heavy and stuff your face. You won't regret it.", "pics": null}}, {"review": {"des": "The best restaurant in Chicago. Period. Nothing I've ever been to in the city compares in the slightest. Kuma is an excellent laid back bar with incredibly reasonable prices, huge portions, and amazing flavor beyond compare. I can't stress how much it's necessary to eat here if you've never gone.<br><br>I went twice in one week because I couldn't get enough. The second time I came, everyone in the restaurant from the hostess to my first waitress recognized my boyfriend and me, telling us how happy they were that we came back. S+ service with attentive and personable staff.<br><br>The fries are out of this world, extra crispy and a huge portion to boot that comes with your burger. I ordered a side of garlic edamame instead, and that was also amazing. If you go with someone else, I recommend getting one side order of edamame and one of fries so you can share. The \"sides\" are huge.<br><br>Now on to the burger. Best burger ever. Cooked to perfection, humongous, and topped with an egg for extra impact. I'm having trouble describing how good it is because words can't do it justice. I recommend getting the Kuma burger for starters. Expect to see me at least once a month. Keep being amazing Kuma.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wuHKxF4ylr4uoDdi3vdctw/348s.jpg", "caption": "Kuma Burger, must have"}]}}, {"review": {"des": "The burgers here are good. The staff was very artistic and the service was good.<br>The heavy metal was loud and this place has quite the following.<br><br>I would suggest trying it.  I would not wait in line for it, but I wont wait in line for very many places.<br><br>great at lunch.", "pics": null}}, {"review": {"des": "The burgers here are extremely filling, and well-seasoned. Definitely one of the better gourmet burger joints in Chicago.<br><br>My one complaint is that the fries paled in comparison to the burgers.<br> <br>I had the black Sabbath. It tasted like a southwestern chili, but in a burger, but in a good way.<br><br>This place is normally busy, so expect a bit of a wait to get seated if you're coming around a rush hour. Also, beware that they play some really heavy music, so from experience, I recommend that you don't come here if you're trying to recover from a hangover despite how hefty/hearty the food is. <br><br>The aesthetic here isn't quite my forte so I'm not awfully compelled to come again, but without a doubt, I would recommend it to someone who wants to appreciate a good burger.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Gifs-P5xDSqzy9-namQy5w/348s.jpg", "caption": "Black Sabbath Burger- southwestern chipotle flavors"}]}}, {"review": {"des": "I love the vibe at Kuma's Corner. It's a small, dark restaurant with loud, raucous music in the background and a great selection of beer. <br>The burgers are big and they have big personalities too. I've been twice so far and have had the Famous Kuma and the Mastodon. <br>Both were huge, came with these big and crispy fries and were gulped down with a large beer or cider (very reasonably priced).", "pics": null}}, {"review": {"des": "I came here with some friends on a Friday night and I swore to myself I would never come back here again because I had such a horrible experience. I'm a huge fan of burgers and I was excited to hear about a place that has uniquely named burgers and plays heavy metal music, which I'm a huge fan of. The staff was beyond rude, it was disgusting. They don't allow you in groups larger than 5 and will not move tables together to accommodate for larger groups. My friend was nice enough switch places with me so I could sit with the larger group, but because they already ordered, they said I couldn't order anything..... I was pretty upset. My friend shared his plate with me - he ordered the black sabbath burger and neither of us were able to take more than a bite or two. The chili tasted old and funky. The night was a total wreck and I couldn't wait to get out of there. <br><br>Fast forward 4 years, I decided to give this place another try and Im so glad I did. It was a lot less busy and our waitress was so sweet and helpful- totally different experience!! I ordered the Iron Maiden which was great, my friend ordered the plague bringer which is now what I order every single time because it is so GOOD. Literally the best burger I've ever had. The fries are always perfectly cooked. The jalapeño poppers from here are also pretty amazing- I day dream about them sometimes. Glad I revisited and had a waaaay better experience. You're totally missing out if you haven't tried this place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hHh42wHuIq945-aIDUMXlw/348s.jpg", "caption": "Iron Maiden and plague bringer"}]}}, {"review": {"des": "A lot of stores on belmont are closing.... so, y'all should come back lol take the Porciugo spot, they left so you guys can come back with them delicious mac and cheese! <br><br>The mac and cheese is sooooo good! I always get it when I go to Kuma's too back when it existed  it taste good hot, taste better when you put it in the fridge and reheat it the next day. Such a versatile dish and such amazing flavor. I actually used to hate mac and cheese up until I tried Kuma's mac and cheese.<br><br>Quite honestly, not a fan of the burgers at kuma's corner, it's different but felt short. The buns aren't toasted. The weird stuff doesn't add to the flavor. The unique flavors doesn't make me feel like im eating a burger. Like just the simple burger is good just not amazing. If I'm rating this place as a burger joint then it's probably a 3 stars", "pics": null}}, {"review": {"des": "For the most part I always get my food to go and I'm always pleasantly impressed if my food is still warm by the time I get to eat it. Well, I was impressed. I got the neuroses Burger with fries. I can honestly say it I'm a fry, connoisseur and they are definitely in the top five. Regarding the burger, heavenly.<br><br>Now, as I mentioned I usually get my food to go via delivery however I actually picked up this time. If you pick up on a Saturday fair warning don't arrive early. There is no room to stand and wait. Ended up standing outside because I felt like I was in a way. The restaurant had great energy and the music was Heavy Metal but I'm sure it was because the cook's needed the energy from the music.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WoMc9X6CFEg6aZCTflTCNw/168s.jpg", "caption": "Neurosis Burger and Fries"}]}}, {"review": {"des": "Our favorite burger joint. I have to tell my story from the first time we went to Kuma's. We went on a Sunday afternoon in the Summertime, I think it was 2013 or so. Place was packed, and the only spot we could sit was at the bar. We ordered food and the burgers did not disappoint at all. I got \"The Famous Kuma\" and it was fantastic. I think my Wife ordered Neurosis and she loved it too.<br><br>There is something else from that day too. I mentioned already that the place was packed. The bar was two people deep and the staff was swamped running around. I asked the bartender what the name of the movie was that was playing on the TV (I'm a Sci-Fi geek). She said that it was the movie Escape 2000. We were waiting on our food, and the same bartender came back a few minutes later. She handed me the Escape 2000 DVD case and said to check it out if I wanted to see the movie info. I couldn't believe how nice she was. The place was hot (there is no AC) the staff was swamped, and despite all of that she STILL took the time to go grab the DVD case for me even when I didn't ask for it and she handed it to me with a smile on her face. A staff that is efficient, friendly and good to their patrons is worth their weight in gold.<br><br>We live in the Burbs close to the Schaumburg Kuma's. Our son is now 2 1/2 and our daughter is 9 months. They have both been going to Kuma's since they were tiny babies and they will continue to go there as they grow up.<br><br>Oh, one last thing. Everything on the menu is fantastic but if you are going to Kuma's for the first time--do yourself a favor and get the fried pickles and order The Slayer. You're welcome!", "pics": null}}, {"review": {"des": "For the last GoodBeer venue of my Chicago visit, I returned to this long-established Avondale bar and elaborate-burger joint.  The bar and tables were crowded at lunch, but I snagged the last barstool.  I found the loud, pounding rock distracting.<br><br> I tried two items from their excellent packaged beer selection.<br><br>- From Chicago's Whiner Beer Co., canned Hell Kitty Kitty Belgian-Style Pale Ale.  7% ABV.  Pours a clear amber, with a one-finger cream head.  Somewhat tart, citrusy nose.  Tart tropical fruit and orange taste; suggests a high-test witbier.  Brewed with Bastogne yeast, described as \"Orval yeast without the Brett\"--though I fancy I did pick up a hint of Brett funk.  Dry-hopped with Zythos, Sterling, and Hallertau Perle.  <br><br>- From Unity Vibration Living Kombucha Tea LLC in Ypsilanti, MI, bottled Bourbon Peach American Wild Ale.  8.0%.  Gluten-free, for those concerned with such; unpasteurized and unfiltered.  And \"Paleo friendly,\" perhaps for any straggling Cro-Magnon beer geeks.  Very slightly hazy straw color, no head.  Vinegary nose.  The flavor profile is reminiscent of a peach variant of Long Island Iced Tea, sweet and sour.  Includes some organic black tea.  Any bourbon character eluded me.  <br><br>New pub-crawl opportunity since my last visit in 2013:  they're a bit over a block west of the Beer Temple taproom and bottle shop, on Elston just south of Belmont.", "pics": null}}, {"review": {"des": "This was definitely the best burger I've had in the Chicago area. I was lucky enough to get there with my friends and be immediately seated with no wait. Typically the line for this place is wrapped around the building. After being promptly seated, our drink and appetizer order was taken. The buffalo chicken tender appetizer with bleu cheese on the side is just spectacular. The sauce nice and chunky just like It should be, and the tenders moist and juicy. All the burgers are named after metal bands and come in 10oz sizes. We did learn on the weekend you cannot order the smaller size. I ordered the Metallica and added an egg to it. The burger was definitely everything I imagined. Perfect amount of chew, flavor and ahhhh the cheese! Overall, great experience. I highly recommend next time you are in the Chicago area!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/F8A6Pn3jGRKXkHIyidJ72A/348s.jpg", "caption": "Metallica Burger no bun added an egg"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/eKrSnA-u0rpZr8a2V8WuQQ/168s.jpg", "caption": "Burger menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/FKZQ_-bXULEEvLWEoUcM2Q/168s.jpg", "caption": "Bar area"}]}}, {"review": {"des": "Awesome burgers and bar bites.<br>Easy, casual atmosphere. A lot more neighborhood locals and less bikers these days. Staff and patrons are friend, easy place to just hang, chill and enjoy.", "pics": null}}, {"review": {"des": "If you love metal music and tasty food, this is the place to go! The staff is amazing & the food is terrific. Expensive, at $15 a burger but you WILL get what you paid for. I promise you'll be left with leftovers, haha. <br>The burger was cooked exactly the way I liked it and came out perfectly put together. <br>The restaurant is decorated with posters and they play metal music in the background creating a nice dark cool vibe. <br>It's something new!", "pics": null}}, {"review": {"des": "Favorite burger joint in Chicago. If you're hungry (you have to be hungry to eat here) and want to get dirty with a greasy burger this is the perfect place.", "pics": null}}, {"review": {"des": "BADASSSSSSSSS<br>great service, delicious burgers, metal, hot chicks dressed in black, what could make it better? A Fucking dank ass delicious ceasar salad??! YES PLEASE <br>I wish kuma fortune and fame.<br>Every thing I've ever eaten there has been epic.", "pics": null}}, {"review": {"des": "So I finally came back like I said I was. I did order a different burger this time as well. <br><br>High on Fire came with roasted red pepper, grilled pineapple, sriracha hot sauce, sweet chili paste and prosciutto. What an amazing tasting burger. It comes served on a pretzel bun, which is very smart to use with how juicy this burger is. Had they used any other bun, it would deteriorate and become difficult to eat. I ordered my burger medium rare, a huge patty and perfectly cooked. Every bite had very intense flavors. The sweetness from the grilled pineapple complimented the saltiness with the prosciutto very well, combine that with the sriracha and sweet Chili sauce and you get all kinds of goodness in your mouth. I would definitely recommend this burger. It might be my go to burger here, but I might venture off and order something else. Their fries are also very fresh and tasted good with the side of what I would assume homemade ketchup. My wife ordered the Kaijo burger w/ Blue cheese and smoked bacon. It was also very tasty but not as good as my High on Fire. <br><br>I'm not really quite sure why their lunch special version of their burgers didn't taste as good as this, but I probably wouldn't order them again. I'll stick to their regular sized burgers.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8TLNlOy-qn9ZEv_DPYJ7hw/348s.jpg", "caption": "Kaijo Burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/QWPz4e6x7IhANbJ6tVsBoQ/168s.jpg", "caption": "High On Fire Burger"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/SYJ14-TAe7Vr60IxNIP1VQ/168s.jpg", "caption": "Famous Kuma burger lunch special"}]}}, {"review": {"des": "This Chicago staple offers up some of the best burgers in the city. With a heavy metal atmosphere they cook up unique burgers cooked to preference and Mac and cheese. If you appreciate burgers then Kuma's corner is definitely a Chicago bucket list item for you. <br><br>First off their beer list is great, serving beer from many local brewery's- including half acre, 3 floyds and many more. I got the scorched tundra VIII by pipeworks brewing, which is a deliciously citrusy and tropical IPA with an appropriately malty body and smooth finish. The gf got the kiss the sun, which had white whisky, pineapple, the afore mentioned IPA, and a spicy kick. <br><br>For the burger we settled on the Kuma's burger to appreciate their burger making skills. This includes a pretzel bun, bacon, cheese, lettuce, onion, tomato, egg and 10 oz burger. We ordered this medium rare and it came exactly as I imagined it. This is a solid burger with a great beefy flavor. It's rare that medium rare is done right on a burger but they did it. The toppings were all fresh but the bun was a bit doughy. Overall solid burger, we will try another version next time. Also the fried were perfectly fried with just the right amount of salt.<br><br>Come for the burgers, stay for the beer. Make your judgement of whether Kuma's or Au Cheval is the best Chicago burger. Drink some whisky on tap.<br><br>Atmosphere: 5/5<br>Food/drink: 5/5<br>Cost: 5/5<br>Service: 5/5<br>Overall: 5/5", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pGLfbS9CUMhJSkNiH3AU1Q/348s.jpg", "caption": "Kuma's famous burger"}]}}, {"review": {"des": "Kumas corner is in my neighborhood so I decided to have a meeting there today.<br>I didnt eat although the burgers looked delicious.<br>I got to kumas aroubd 4pm (thursday) <br>Approximately at 5pm the place was packed ! <br>As I walked in I was greated immediately <br>All the staff were super friendly and a waitress was at my table instantly and again when my guest showed up. <br>Kumas carries local draft beer but they also serve cocktails.<br>I knew kumas was a pub so I expected the music to be a little on the louder side but I didnt realize it was more of a heavy metal pub so the music was mostly that genre if I got it right .. so it isnt the best place to have a meeting haha. Although it could be a cool place for dinner / lunch. <br>There is free parking on the side of the building but like I said the place gets packed.", "pics": null}}, {"review": {"des": "Kumas, what happened to you? Don't answer, I already know- your new management SUCKS and is tanking my all time favorite burger place faster than the Titanic <br><br>It's a bad sign when a grungy, hole-in-the-wall metal bar opens a location in Lakeview, the wannabe-Chicago suburb and chain-restaurant Mecca referred to as Schaumburg, then the trendiest part of the West Loop. It's worse when veteran bartenders and other staff start leaving. And the most tragic part- the food has suffered and no longer deserves the 5 stars I previously bestowed upon it.<br><br>If you are aiming to try Kumas for the first time, you should for the experience. It's only a matter of time before the new owner destroys the brand completely and it's gone. But know that what you are tasting is merely a shadow of the amazing experience that used to be Kumas. The quality of the ingredients (yeah, we all noticed you're using cheaper beef) had tragically declined and it's just not the same.<br><br>Also, if you're reading this new management, shame on you for putting veggie options on the menu. Sell out.", "pics": null}}, {"review": {"des": "One of the worst burgers I've ever had. Dry, under-seasoned, and tasteless would best describe the burger.<br><br>Cmon now. Anyone that goes will find shake shack, au cheval, etc... will understand.", "pics": null}}, {"review": {"des": "I heard about this place and had to check it out. I came for lunch during the week and set at the bar. The bartender was very good. She was friendly, suggested few options based on what I told her I like. The burger was OMG! See the pictures. Was amazing. The meet and seasoning the way it was cooked. Hit the right spot. My drink was very good as well with a little spice. Will comeback", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FVb8GG7HNzi4OAryRDxs6w/348s.jpg", "caption": "My drink with the kick"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EfXnAkHjq5LtWwxlLm4R-Q/168s.jpg", "caption": "Burger with egg yam!"}]}}, {"review": {"des": "So I'm writing a review for a place who doesn't give a high happy shit about Yelp because they KNOW<br>their shit is fucking awesome. From the service to the Beer and food selection, it's everything you've heard about and more.<br><br>Just go. Don't argue with me. Thank me later (and in private ).<br><br>Dammit- I labeled the pics incorrectly. Bite me.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/se4GwGvVuP_fqOpSVPodKA/348s.jpg", "caption": "Here's the Metallica. Wear a bib."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0RQ8mglJUlS6KBmFeNzY9g/168s.jpg", "caption": "And here's the Slayer...comes with the side of anger. No bun, lots of yum."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7UQiDjUK4LEtL1ttQMVU7Q/168s.jpg", "caption": "This is the \"side of anger\" that comes with the Slayer."}]}}, {"review": {"des": "Great service and burgers!<br><br>I'm not so into heavy metal but I enjoyed the atmosphere of this bar. They were playing the crow on the TV. I almost wanted to stay just to finish it.<br><br>Our server lazer kitty was phenomenal. It was a full bar and she managed to take care of my friend and I pretty well. Our drinks were always full and she was always a step ahead of us when i came to what we needed.<br><br>I ordered the KUMA burger which comes with fried egg and served with a nice big pretzel bun. Let's just say that burger was gone in less than 5 minutes. I would give it 4/5 rating. It's not the best burger ever but I would put it up there!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L1ErbwL8a-Tf13Tthd_KuQ/168s.jpg", "caption": "The famous kuma burger!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JE6JavQNsD1AksposgwVqA/168s.jpg", "caption": "Neurosis burger with chicken!"}]}}, {"review": {"des": "Hmm.. This place wasn't what I originally expected when I looked it up on Yelp, but definitely not disappointing. Street parking can be easily found in the neighborhood which was pleasantly surprising since Chicago seems to be robbing me of meter money ($4 for an hour... crazy right?!). Anyways, this place actually looks quite old from the outside. The inside is quite dark and old school as well. I came here on a Monday afternoon where there was no loud, heavy, head banging music and the restaurant was mostly empty except those sitting at the bar.<br><br>The menu is relatively simple with Mac & Cheese options, burger options, a couple of appetizers and salads. There is another menu for drinks that I didn't pay attention to because.. it was way too hot to be day drinking! Anyways, the Mac & Cheeses are custom.. so you get to choose two toppings for $14. I decided to go with bacon and broccoli, strange combo..  I know! And they also have a lunch special burger that's $10 and comes with a side of fries. <br><br>The food came out very quickly and our waitress was actually very friendly. She came to refill our water often but one thing I do have to mention is that this place does NOT have any AC! The Mac & Cheese was delicious and HUGE in size! I could not finish it, and the burger was equally as good.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3rIUELmNcCbOFxhGlRKGwQ/348s.jpg", "caption": "Mac & Cheese & Plague Bringer"}]}}, {"review": {"des": "I would give their burgers a 3.5.  i mean it was good - what wouldn't be good with beef, cheese, and bacon. BUT it was their mac and cheese that would bring me back.  We added mushrooms and bacon and it was perfect.", "pics": null}}, {"review": {"des": "Really like the vibe of this place. <br><br>Great music playing, the menu is awesome, and it's cool to walk in and see 10 cops having lunch.<br><br>I ordered a Mac n Cheese and a burger, I was not impressed with either, but they were good. Just nothing special.<br><br>I expected more based on the reviews. <br><br>Would def not mind eating here again, as the menu offers so much.", "pics": null}}, {"review": {"des": "I'm actually quite shocked that I haven't written a review for this wondrous and critically acclaimed restaurant yet; I've been there a handful of times and have not had one bad experience eating one of their amazing burgers. <br><br>Oh Kuma's...I means, burgers itself are already a delight, but the way you make them, it's as if you've changed the game! Everyone enjoys a classic beef patty with cheese, lettuce, tomatoes, onions, pickles and some condiments, but here at Kuma's, it goes a bit differently. You'll get all of those basic ingredients, but then there are some extras: maybe some avocado, some roasted red peppers, fried egg(s), some chili, bacon, chicken tenders for God's sake! The customizations that these chefs make are ridiculous, but the results are nothing short of tasty. <br><br>They have other meals here that aren't burgers that I should really check out, such as various apps, mac n cheese and salads, and they also have an extensive selection of beer, draft and bottles/cans. My go-to is usually Allagash White, but I like to venture out and try new drinks when I can, being a beer aficionado. <br><br>Let's not forget about the main theme that lies within Kuma's: the METAL music. Songs that blast out the speakers, turned up to the highest volume that are as heavy as the burgers produced in the kitchen. Good stuff.<br><br>Also, they sell merch. How cute! <br><br>Whether you're from Chicago or visiting, Kuma's Corner is one of those places you NEED to check out at least once. Only downside is if you get there during a lunch/dinner rush, you will wait a while, so make sure you got something to pass the time with.", "pics": null}}, {"review": {"des": "Returning for this places awesome burgers and atmosphere. Best part was American Psycho playing in the background to some rocking tunes and having most people captivated by it. 11/10 Sunday funday", "pics": null}}, {"review": {"des": "Very bad place, i'm here right now and i just ordered a burger, and the fries were very cold and the meat was awful like a rock. I don't recommend this place.", "pics": null}}, {"review": {"des": "They don't lie when they say this is the place to go for a burger!. My wife and I came here and found ourselves waiting to be seated. Which was estimated to be about 40min to an hour. And they were not lying. Because there were plenty of people who had come before us waiting to be seated. <br><br>  But yet another FYI for my fellow yelpers or readers. If you can find a spot at the bar and don't mind eating at the bar. It's first come, first serve. <br><br> You can always tell when someone enjoys there craft. Because you know the do with some of these creations they make for burgers. My wife enjoyed hers as well as I did. I mean that's a damn good burger if I'd say so myself. <br><br>  So my rating is on the food / Burgers. A definite place to bring a friend, or someone you'd like to treat to a darn good burger. The also have a selection of beers for you beer drinkers out there : ) cause we all know, there is nothing better than a burger and a good beer ; )", "pics": null}}, {"review": {"des": "Most know and love Kuma's, though I would argue that the original location is certainly the best. You have a lovely mix of loud metal and delicious food and beer. In the summer I'm a big fan of the patio out back, which makes it easier to get a seat as the restaurant is small and often crowded. <br><br>They offer a rotating selection of burgers of the month as well as vegan patties- this month's burger even has vegan cheese! I have sampled several of their burgers but have to say that the Kuma's burger is always the reigning champ in my book. <br><br>Also- have I mentioned their ketchup is oddly delicious? As a ketchup connoisseur I value this very highly.", "pics": null}}, {"review": {"des": "A good burger, but nothing really memorable about it. The meat was perfectly cooked however and I would definitely come back when in the area. However, just for takeout - the vibe seemed a bit loud.", "pics": null}}, {"review": {"des": "I don't do many updates because I'm stubborn af, but I can't even front no mo'. Kumas is the undisputed king of burgers (& I ain't talkin' Whoppers) in this city. Because I said so. <br><br>Not just burgers. But mac & cheese too. There's something so satisfying about good mac & cheese. Just like watching steel chair shots to the head in late 90's WWF. Truly pleasurable. <br><br>I'll gladly devote one day off a year just to come here and elude crowds and wait times. It's worth any inconveniences. That's it.", "pics": null}}, {"review": {"des": "Living around the corner from Kuma's, I was thrilled to finally be able to eat something vegan there. I'd been hearing a lot about the Impossible Burger: that it was unbelievably beef-like, but local restaurants hadn't been doing it justice, lacking the vegan substitutes that would make it feel like eating a burger. For example, a whack ass \"burger\" (lettuce wrap) at Umami. So, when I heard that Kuma's would be serving the Impossible Burger, my interest was piqued -- and when I read the list of toppings it'd be served with, I knew I had to try it ASAP. <br><br>I haven't had a beef burger in many years, so I wasn't sure that I'd even notice if it was a convincing replacement, but one bite was enough to prove otherwise. The patty itself was delicious, but what made the meal for me was the preparation. The burger was served on a pretzel roll (a personal favorite of mine), with vegan cheese AND vegan mayonnaise (pretty deluxe for a place that previously prided itself on offering no vegan options). The tomato jam, mashed avocado, red onion, and arugula all added nicely to the flavor and I left feeling very satisfied. <br><br>Of course, since Kuma's will always have some attitude, we overheard the folks next to us talking shit on vegan burgers and veganism. Personally, I was delighted to listen to their shit-talk while anticipating a cruelty-free burger. They certainly don't have to eat the vegan burger but it's great to be able to come back to a mainstay in my neighborhood that I once ate at frequently. I will, most certainly, be back! -tlf & kaq", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oYE4cZMmsstU1cKLMbaZqA/348s.jpg", "caption": "THE IMPOSSIBLE BURGER!"}]}}, {"review": {"des": "Best Burgers Evvvvvva!  The menu is flippin amazing- but plan on spending some serious time analyzing all the mouth watering options.  Love that this place offers an amazing culinary experience in such a laid back atmosphere.  Did I mention the service was amazing too?!", "pics": null}}, {"review": {"des": "Kuma's is one of the best burgers in town (in my opinion). It is a small, dark, loud atmosphere where you may have to raise your voice level up a couple notches to have a actually conversation to the person next to you.<br><br>I have been here multiple times. Each time has been a great experience even with the wait time. I had secons thoughts about last night.<br><br>(THE BAD)<br>It's a Saturday night, around 9:30 p.m. with the storming weather. My co-workers decides to venture off for some mac and cheese and burgers. I arrived second in our party and NO ONE acknowledged us at all. From previous experience (especially on a busy weekend), the host would greet you, ask you how many people, and if everyone is there. NOPE, not a single word to any of us. The hostess saw us. You really can't miss a three person party standing at the entrance.<br><br>So, about 20 minutes goes by and not a single word. \"Is she just waiting for tables to free up? Is she just keeping a mental note?\" We almost decided to just go down the street to eat, but we decided to stick it out. We were standing around for about 30 minutes so we ordered some drinks while we waited. <br><br>NOW, another party showed up and she greeted them, asked them how many people and so forth. I was grateful to hear from the gentlemen, \"Just 2 people, but I think they were here first\" and pointed at me. YES I AM NOT INVISIBLE. <br><br>ONLY THEN, she asked me how many people and that it will be 45 minutes to an hour wait unless we find a spot at the bar to sit.<br><br>Food was taking much longer to come to our table which I can forgive for a busy night. The food is always cooked well and taste delicious. No complaints there.", "pics": null}}, {"review": {"des": "Kuma's is a hit or miss for me. They are really good! Don't get me wrong. Food is amazing when you eat it there. Tastes great and fresh. I have eaten Kuma's corner take out on a couple separate occasions and wasn't a fan but other than that It just taught me to appreciate it more while eating there. I work just down the street so it's a great lunch spot as well! They also introduced me to my new favorite beer!", "pics": null}}, {"review": {"des": "Atmosphere pushes this place to a coveted 5th star.  Super friendly bar tender, cool paintings/art work on walls and great metal music blasting while you eat.  <br><br>Burger was pretty darn good and defiantly was a meal in itself!  I had the Kuma Burger and it came out exactly how I had ordered it.  Juicy, cooked medium (with a little pink) and all toppings were fresh.  2 hands needed for sure.  <br><br>I was also impressed with the whisky on tap.  Cool idea! They had 2 of my favorites, Four Roses and Makers Mark.... it was lunch, yet I really wanted to order a whisky & soda, just to watch the amber nectar of Kentucky pour out the spout!  Had a long drive home, next time I guess!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tudvipkDK5YEHq-TtNtBaA/168s.jpg", "caption": "Kuma Burger - Huge!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fbBQ68IheOZEYZm-386FKg/168s.jpg", "caption": "Whiskey on tap?? Awesome!!"}]}}, {"review": {"des": "First time at Kuma's and I will definitely be coming back! Stopped by with my partner and we got a table right away. We chose the patio because it seemed to be more quiet and spacious. I got the Iron Maiden with fries and she had the Metallica with the house salad. Both excellent burgers! Our server suggested garlic mayo for the fries and it was a fantastic combo. The fries were on the crispy side, but that's how I like it. The whole menu is awesome and everything looks tempting. <br><br>The service was good, just attentive enough without being overbearing. The only thing that was underwhelming was the salad. It wasn't bad, just pretty average. But hey, who gets a salad at a burger place, right?? We'll just skip it next time and get more fries!<br><br>Thank you, Kuma's!", "pics": null}}, {"review": {"des": "Great beer selection, service was good,but the food wasn't. Fries are old and seems like just heated in microwave. My burger bun was kinda cold( I'm not sure it's supposed to be cold)<br>I wouldn't interesting to come back...least for eating", "pics": null}}, {"review": {"des": "They definitely know how to do burgers. I love when places ask how you'd like your burger, and actually cook it the way you said! More often than not, medium means well done to a lot of burger joints.. not this one.. medium was actually pink! and my medium well was actually grey through out! Awesome.<br><br>Burgers averaging $15 so this meal isn't cheap. I ate half my burger and to-goed the other half. I got the potato chips and the boyfriend got fries so we could try both. The fries flat out sucked and was not crispy in any way.<br><br>The $14 mac and cheese was pretty damn good. And this is coming from someone who doesn't really care for mac and cheese. It was worth it. Reheating it up, I could see all the butter they used which was a bit of a turn off but I'd still get it again. <br><br>Boyfriend said that \"this wasn't life changing but close to it.\" He loved it that much.<br><br>Service was super attentive. Robo cop was playing. Heavy metal rock music made the place loud. This place definitely isn't a good one to hold conversation. But to eat well made burgers? Yes, this is the place.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/K-VdaDaHjuvXCcxtMTCKkg/168s.jpg", "caption": "YOB  $14"}]}}, {"review": {"des": "If you're one of those people who loves a huge burger with homestyle fries (I'd say beer, but I don't drink), then this is your spot. <br><br>I went twice in the span of 7 days cause it was so good. The Original Kuma Burger is a great starter for someone who's testing the waters here, but go on up and try the Mastodon for a total food coma of deliciousness in BBQ sauce.<br><br>Contrary to popular belief, I'd skip out on the Jalapeno peppers. A bit overpriced for what they are. <br><br>Regardless, this is the best burger in the city!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/MQ779MtBCa_BDy67RscEqw/168s.jpg", "caption": "Mastodon Burger"}]}}, {"review": {"des": "Life changing mac and cheese and other great menu items.<br><br>This place was really tasty and had fun vibes. When I arrived, they would not seat me until the whole party was there, which was fine, I sat at the bar and choose a beer from their pretty decent selection. Once we were sat, we ordered mac and cheese to share and I got the plague bringer burger with a black bean patty, it was excellent! The mac and cheese, as mentioned above, had something special about it, super cheesey and good. At our table we got both chips and fries, you cannot go wrong with either choice. Oh and there is metal music to listen to while you wait and enjoy your food. Cheers!", "pics": null}}, {"review": {"des": "Yum! My favorite burger is Goastsnake, a delicious corn relish, goat cheese, and fried onions. Pure perfection. Usually a long wait especially at meal times and weekends, but well worth the wait!", "pics": null}}, {"review": {"des": "My favorite burger joint. I always step in here when I'm in the area for the food and the atmosphere. This is the first restaurant I visited on my first ever trip to Chicago. They have metal music from the 80s playing, 90s movies on the flat screen (Office Space today), and the nicest tatted up waitresses ever! I always go for a burger and a local brew. The Mac and Cheese is good too. Everyone from businessmen, grandmas, construction workers, and millennials come here.", "pics": null}}, {"review": {"des": "Unfortunately very disappointed with the quality of our food ordered to go. Our salad came with all of the toppings on the side. Not to mention the lettuce was a rather small/old chunk. The flavor was great but very disappointed I spent $12 on this.", "pics": null}}, {"review": {"des": "I was going through some old travel photos and realized that I hadn't posted reviews for a lot of places in Chicago that we've eaten at, like this place.  It's been years since we've eaten here, so I will do my best.<br><br>From what I recall, there was quite a bit of a wait to get in during lunch, but you can have drinks while you wait from the bar.  I remember it being a small place and it can get pretty packed.  The food was really good, so I recommend grabbing a good burger from this place.", "pics": null}}, {"review": {"des": "Interesting gothic emo vampiric heavy metal vibe when walking in this place. They were playing what I believe was Dark Shadows on their main television while blasting some heavy metal music so that's how I arrived at that sense of their ambience here. Additionally a bunch of the guests seem to be parts of biker gangs as they were clad in their distinctive vest jackets. It was an interesting setting to say the least.<br><br>It took a while for us to get our order taken, but that was fine because each of us in our group had difficulty deciding on which of the extremely eclectic burgers we wanted to get. Many of their burgers were also named after hard rock bands, and had some heavy metal feeling to them, which I found amusing as well. Whenever I'm faced with difficulty deciding, I usually just get the main flagship dish at a restaurant, and so that's what I did here.<br><br>The Famous Kuma - Honestly, not a great burger. For a place that specializes in burgers, and with so many interesting options and combinations to choose from, I was pretty stunned at how flavorless the actual burger meat was to me. It was extremely greasy and messy, which aren't necessarily negative attributes for me - but when something is so greasy and full of fat, you really expect it to be bursting with flavor, which was definitely not the case. It's like sinking your teeth into something drenched in plain oil... The bacon was also too salty and without much hearty bacon flavor. The burger was just falling apart by the end of the meal, since there was so much oil soaking through all of it.<br><br>The fries were pretty good.<br><br>In retrospect, I should have ordered a burger other than the Famous Kuma, because I think a huge part of the allure of Kuma's is trying out some of their more intriguing flavor combinations. I sampled my friend's Goatsnake, which actually was brimming with flavor from the goat cheese and vinagrette, and was quite good. So I guess the flavor in most of their burgers actually comes from the toppings as opposed to the burger meat itself.<br><br>Overall, I was pretty disappointed with my Famous Kuma burger. I would definitely give this place another try, and in the future would opt for one of their more eccentric burgers instead. Don't come here expecting a burger with great meat, but if you do come here, make sure to get a burger that has really flavorful and interesting toppings.", "pics": null}}, {"review": {"des": "There are not enough good things I can say about this place! From the casual ambiance, the very kind workers, to the heavenly food, this place is a go-to for anyone visiting Chicago! If heavy metal isn't your thing- brace yourself, but still come for the amazing burgers and Mac-n-cheese!", "pics": null}}, {"review": {"des": "We came around 4pm on a Saturday and were able to get a spot at the bar right away. If we wanted a table it would have been a 30ish minute wait. I had very high hopes for Kuma's as I've heard so many good things and let me just say I was NOT disappointed. My party tried the Sovereign burger and the Mac and cheese and both were delicious. If you're only able to try one get a burger; cooked perfectly and full of flavor, worth the hype. I enjoyed the atmosphere too, but I could see how some might not with the metal playing. Anyway- Kuma's, I'll be back!!", "pics": null}}, {"review": {"des": "I'll start by saying I've been to a different location in the suburbs of Chicago. First time at this location and as soon as I walked in I wasn't impressed.<br>I witnessed a party of 3 customers walk in and inquire about the wait time. <br>The host ( dont know his name ) did his best to seat them as soon as possible.<br>They sat. <br>I told him party of 2. There were 3 tables open and instead of giving the same courtesy and seeing what he could do. He told us \"bar or 30 minutes\" <br><br>Not impressed", "pics": null}}, {"review": {"des": "Amazing food when I come here I have to go all out and buy enough to last three meals. Amazing service but luckily not so crowded today.", "pics": null}}, {"review": {"des": "This place is.. in your face (and i mean that in the best way possible). Definitely a loud, heavy metal type of place, it is a little difficult having conversations with bigger groups due to the music. The walls of the restaurant and bathroom are plastered with (what i'm assuming are) heavy metal band stickers and signage and posters. I was a little intimidated by Kuma's corner when i first walked in, but the hostess and our server (Sparkle) ended up being very nice and friendly and accommodating!<br><br>The food is also very delicious, but don't come looking for healthy options! I was feeling a salad, so i ordered a wedge salad. The wedge salad is wedge lettuce with bacon crumbles, crispy potatoes and fried onions! It was more of a fried onion/potato plate with some wedge lettuce :) Obviously, everything was delicious, just not as light as i was hoping.<br><br>The Kuma's burger with fried egg on top seems to be a staple and it was very good! Be warned: the burgers are 10oz, so definitely on the bigger/heavier side. Our friend ordered the BBQ Pork fries, which probably was the best thing we ordered that night. The fries are perfectly topped with cheese and pulled pork. lastly, the husband ordered the Slayer burger, which isn't a burger at all, but a patty on top of a bed of fries, topped with lots of goodness. Like i said above, Kuma's corner is not for the health conscious meal seeker.", "pics": null}}, {"review": {"des": "Finally made it to this location. My husband and I frequent kumas west loop and have been to Schaumburg location and lake view location before it closed. I was a little underwhelmed as the decor here is more divey than the other locations. We did appreciate that the sound system here actually allowed you to hear the vocals. Food was not quite as good as West Loop location. Edamame was over salted and something was off with the buns (maybe not put on the griddle first?) but I wasn't charged the outrageous $7 impossible burger up charge like I usually am so I wasn't too upset.", "pics": null}}, {"review": {"des": "I went with my wife to Kuma's expecting to have a wonderful experience. We thought the hamburgers would be great.<br>I have been postponing to go for one or another reason... even if I live few blocks from the restaurant.<br><br>The ambiance was great and the music fantastic... I love rock,metal, punk etc...<br><br>The beers were very good.<br><br>The burgers in the other hand.... mmmmmhhh not really.<br><br>We ordered the Mac and cheese which was wonderful.<br>I ordered the kuma's especial burger, bison.<br>My wife ordered another burger.<br>The burgers were really nothing out of this world.... not much flavor.... not what we expected......at all.<br>Maybe we were expecting to much<br>To make matter worse the price, I think, was a little to much. We knew the bison meat would be more expensive... $4.<br>We knew that adding avocado would cost more, $2.<br>But to charge $2 for grilled onions... the burger comes with raw onions.... seemed a little bit abusive...<br>The total bill was over $80 <br>Which maybe not a lot... but I think that there are many other places just by Milwaukee Ave.... between kedzie and  diversely avenue... that have better burgers and  similar beers.<br><br>Now....full disclosure.... as in any of my TripAdvisor or yelp reviews<br><br>I have been working in  a hotel, Westin, for many years..... I know how a great burger should taste!<br>And I'm sorry to review that Kuma's wasn't <br>Just as good as I thought would be.", "pics": null}}, {"review": {"des": "Great Customer Service and friendly staff.... I enjoyed there famous Impossible Burger and fries with a Cider called Grizzly Pear which was pretty good also seeing that I'm NOT a Beer drinker....", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fAXgczkTB9eOFl_lFkQ8Ww/168s.jpg", "caption": "The cider Called Grizzly Pear"}]}}, {"review": {"des": "Love this place. Every time I'm in town, it's a must. Great food and great vibe. So many creative selections of burgers and always great beer too. Metal and great food. Gets busy at dinner on weekends for sure. So get there early, or plan on a little wait. But totally worth it.", "pics": null}}, {"review": {"des": "Kuma's corner best restaurant -bar to have a huge delicious hamburger.  I love the hamburgers  of  month.   If you come to Kuma's make sure<br>You come starving because the portions are BIG.<br>I love the rock music  but is NOT blasting loud.  Be ready to wait in line if you come for dinner.  No reservation are require bummer but is worth the wait and anticipation for the best meal of your life.  If You think for all that food  is going to make you broke NO WAY. The prices are down to earth and worth your pocket.  plenty of food  to take home for another meal next day.  Yum very delicious.<br><br>I have been here twice and I truly recommended.  I love the selection of food.  The servers are very nice and friendly.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/x9jLxApqiCsNLzWCLNqjnw/348s.jpg", "caption": "Burger of the month"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QA4y4vKf_0kktRXuHTuaNA/168s.jpg", "caption": "Absu burger"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Djvbja0TlUWxB7Qbc-_9bg/168s.jpg", "caption": "Best corn soup"}]}}, {"review": {"des": "This was hands down the best burger I've ever eaten.  Lets start from the beginning.  sometime in fall of 2017 my boyfriend came running into the room telling me to turn on the food network.  There was a show on about the best burgers from different cities and Kumas was on there.  We sat watching with our tongues hanging out and I immediately went onto my phone and bookmarked the website into my phone.  <br>Almost a year later we are in chicago heading to Michigan for my brothers wedding.  There was a list of things we wanted to do and see, but the top of that list sat Kumas Corner.<br>We got dropped of by our lyft driver and stood outside the corner just staring.  We walked in and to a warm greeting and sat down at the bar.  The bartender was very friendly (she had eggs on her shorts!) and explained the menus to us and then gave us space to decide.  I decided on the burger of the month, the Cult Leader,which was super juicy burger with bacon date jam, habanero marmalade, thick applewood smoked bacon and arugula.  My boyfriend chose the Pantera, which was the same amazing beef patty, house made ranchero sauce, cheddar cheese, moneterrey jack cheese, bacon, roasted poblano peppers, and tortilla strips. We also chose an order of the jalapeno poppers. We sat and watched Frankenstein's monster as we waited, cause apparently this place is just that cool that they play movies for their guests.  They were all horror films except this one, but it was perfect. <br>The poppers came out crispy and perfectly golden brown and were served with raspberry dipping sauce.  They had chorizo mixed into the cream cheese and they were the most perfect, delicious poppers I have ever tasted.  I dream about them still.  The burgers arrived and we both just sat in awe for a few seconds before we could speak.  After a couple pictures for instagram we dove in to our meals and didn't come up for air until they were both half gone. (they were good sized)<br>We agreed they put any other burger experience to shame. <br>We ate our left overs several hours later and they were just as delicious.  If I ever make it back to Chicago this will again be the number one must on the list of things to do.<br>(side note: all the cocktails looked awesome but I was super hung over so I stuck to my best friend; Water)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/k1OoaAcvdlpjvkCflutywA/348s.jpg", "caption": "Jalapeño poppers. So delicious."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/B55QN7m-0VLUMODn9Zexyw/168s.jpg", "caption": "Pantera!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/MJEGJVkHLzRHLY5JWnDPUg/168s.jpg", "caption": "Cult Leader. Perfect."}]}}, {"review": {"des": "My review is based on my visit a few years ago...I realized I never left a review when it came up in my search!  <br><br>We came here with some local friends who said this was the place to go for a good burger!  We were warned that the wait could possibly be crazy, but to our surprise, it wasn't that long of a wait after all.  <br>The menu was full of burgers named after the rock and roll genre, the staff was super amazing, and the mac and cheese was soooooo good!  I am not big on burgers too meaty (i.e. one patty equals a pound of meat...yuk)...but these were just right.  They were cooked just right (no one had to send anything back), and service was quick!  We ordered a mac and cheese to share and that was the one thing I remember saying \"we should've ordered two\".  <br><br>I always said if I am ever in the area again, I would surely go back to Kuma's!  They made a great impression on me, so for that, they are a favorite!", "pics": null}}, {"review": {"des": "Just a few weeks ago, I had the best tasting burger in Chicago! I visited Kuma's on a weekday for lunch and ordered the Kuma lunch special which is basically a smaller version of the Kuma burger. This lunch special came with a side of fries. I loved it! <br><br>I was given the option to have my burger cooked 3 ways (rare, medium or well done). I went with the medium and it was cooked superbly. The burger was tender and there was a substantial amount of meat in the patty. One bite sends you into sensory/umami overload! I never had a succulent burger with a runny fried egg but after having this one, I can't have burgers made any other way. This one is definitely the gold standard.<br><br>As for ambiance, this place caters to clientele with an open mind. The servers are prompt and polite. It's just that the atmosphere may be off-putting to some folk. It's definitely got a thrash metal/biker bar feel to it. If you are extremely religious, I wouldn't advise you come here. You will be offended. If your the \"June Cleaver\" type that enjoys an exchange of boring pleasantries, this is also not the place for you. <br><br>Parking is only accessible on the streets and is not metered. I'd come here on a weekday to get guaranteed seating.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jxJ3SDhpWI5dNyWya-MjOQ/348s.jpg", "caption": "The digs. They had Mad Max playing while we were there along with some Thrash metal playing in the background."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mblYSCPox4VbfKG2-qdpuw/168s.jpg", "caption": "Our orders. We got the same thing."}]}}]}