{"name": "little-goat-diner-chicago-4", "reviews": [{"review": {"des": "My husband and I wanted to try a semi-nice meal while we were in Chicago with our newborn baby (we knew we had to opt out of fancy establishments since they're not baby-friendly) - I found this place on Yelp near our hotel and we made our way here for dinner one night. We walked in without a reservation and luckily we landed a table in the back (we arrived early but the place was already super packed with a line of people after us!).<br><br>We decided to share a hot crab dip, the fat club sandwich, and a cookies 'n cream shake. The service was amazing and the food was even more awesome! I'm very glad we gave this place a try and definitely will be going back if we visit Chicago again!", "pics": null}}, {"review": {"des": "Meh. Not for me. There are so many other choices for better brunch food. I love fusion and this diner does deliver on interesting flavors but overall does not live up to the hype. <br><br>I got the Tonkatsu sandwich... if I were just judging the tonkatsu I'd say it was pretty decent! But the sandwich overall was missing something to bring it all together. I kept eating the parts individually (which I never do) because they tasted better on their own than in a sandwich. <br><br>My boyfriend did say the patty melt was one of the best he's ever had and their beer was good. <br><br>The ambiance is .. chaotic. It's always busy and the bus boys/girls are always moving around. They are fast on service but the constant moving makes it hard to relax for a nice meal. <br><br>Anyways not a place I'm dying to go back to but would if the opportunity presented itself.", "pics": null}}, {"review": {"des": "I have frequented Little Goat on numerous occasions and again this evening.  The waitstaff has always been sub-par . The food. Very good diner food. <br><br>As an ex-industry veteran I am appalled how inconsiderate and non-attentive the service staff is here in one of the most highly trafficked restaurant rows in Chicago. <br><br>The kitchen staff is obviously the only reason this place is  still open. The owner should be made aware that this business is not upholding the reputation that her other wonderful restaurants uphold.", "pics": null}}, {"review": {"des": "The French toast is a 10/10. The Little Piggy went to China gets a rating of culturally confused. I didn't enjoy the numbing sensation and it hard an off bitter and sour taste to it. I also didn't find it spicy at all, just numbing from the peppercorns. I actually found the dish too much to finish myself and had to share with someone else. However I would highly recommend the French toast. <br><br>Great joint for a nice brunch. I got here earlier in the day so I didn't have to wait in line. I would highly recommend this place as the quality of the food is food and the service was pretty attentive.", "pics": null}}, {"review": {"des": "Love this place- child friendly, wide variety on the menu, large portions and good service. There is usually a wait, so I would plan ahead for that, but there's lots to do in the neighborhood while waiting for a table.<br><br>I love how the restaurant mixes Asian and American flavors and serve it up in a casual \"diner\" experience. I definitely recommend", "pics": null}}, {"review": {"des": "Little Goat is a cute little diner with fantastic food.  Make sure to make reservations so you don't have to wait.  When we went, there was a very long line for walk-ins.  There is also a little bakery that sells cakes, cookies, scones, pies, etc.  We ate at the diner.  <br><br>Favorite was the hot crab dip.  It has cheesy crab with ritz crackers.  It's super cheesy and delicious.  We also liked the goat chili cheese fries, which were smothered in creamy cheese and chives.  Crispy shrimp cocktail was also good - the shrimp come in lettuce wraps with a cocktail sauce.  The Reuben was great - corned beef, kimchi, kraut, havarti and a delicious sauce.  <br><br>Service was great.  It's got a super friendly vibe.  Prices are very reasonable.  Would definitely come back here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/AeJHSpc_HfQltgMTEoiF7Q/348s.jpg", "caption": "Crispy shrimp cocktail"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WUKB_JP66zTVIlZUo1Mk7w/168s.jpg", "caption": "Brussels sprouts"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RMnpcZIq6VrWfR5f3NgbsQ/168s.jpg", "caption": "Crispy shrimp cocktail"}]}}, {"review": {"des": "We were so excited to come here and it definitely didn't disappoint. The BF and I shared the This Little Piggy went to China, the 3 sister's oatmeal, and the goat milk latte. I liked all three dishes. The sausage and biscuit with chili sauce and berries was so unexpected; it was salty, sweet, and spicy all in one. Really interesting and I think a must order. I loved the 3 sister's oatmeal as well, although it was very rich and decadent. I needed a little more blueberry and granola to balance out the dish. Finally, I thought the goat milk latte was very unique (in the best possible way). I don't love goat milk but I think this latte was superb in highlighting it. <br><br>Even though I was a little groggy at 6:30 a.m., it was still a very memorable meal. I highly recommend to fellow foodies, especially if you can't get a reservation at her other restaurant!", "pics": null}}, {"review": {"des": "I came back Little goat diner after a visit several years ago which was as truly perfection. This visit, while good want as great as I remembered. I returned to my favorite \"This little piggy went to China \"'which includes a sesame cheddar biscuit, pork sausage, eggs, and a chili garlic chive sauce. When I started with my first bite I thought .. this is cold! But when I felt the eggs and sausage I realized they were all warm but the chili garlic sauce was very cold which made the entire dish cool. The flavors are amazing so I'll give them a pass but keep the sauce out of the frig so they don't cool off the entree! <br>We also had pork belly home fries. They were a bowl of flavor! Perfect in every way. <br><br>We were smart enough to get reservations so we didn't have to wait once we arrived but there were only early times available so we really needed that coffee. We could have used another refill but with the number of persons waiting on tables, I hardly blame the staff for gently encouraging us to move along.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dGNMMm5fxpETm64dbAMLUA/348s.jpg", "caption": "Thus little piggy went to China with scrambled eggs"}]}}, {"review": {"des": "Impromptu Saturday night dinner without a reservation. Thankfully the dinner was able to seat our party of four. Little Goat has sissy's been good, but it's been a while since my last visit. <br>I had the chili pork chop with a side of shaved Brussels sprouts. All good.", "pics": null}}, {"review": {"des": "Slightly obsessed with Stephanie Izard = going to two of her restaurants in a 3 day weekend trip.  <br><br>Reservations were made, thankfully, because the wait here can be insane.  Despite the word \"Diner\" in the name, I didn't quite realize just how diner-themed this place would be.  That's not a bad thing, it goes perfectly with her comfort food themed menu, and got me even more excited about the dishes.<br><br>Ok, so \"comfort food\" doesn't quite cover the menu here.  True there are comfort food staples, but then you're also hit with some twists on traditional Asian dishes, which makes me even happier.  <br><br>Dishes are quite big here, so don't do like we did and order 3 things to share, it's just way way too much.  My hubby loved his Goat Melt, and I loved my Korean Bi Bim Bop on cauliflower rice, and washed it down with a Bloody Mary.  I think we both ate half our dishes and were stuffed, but yet our 3rd item came out lol.  Jessica G. insisted I order the crumpets, but luckily I had forgotten, no way we would have had room!<br><br>The service was quick and friendly and made me want to stay longer and order even more!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WUHSv2qO085i9mLXg__7iw/348s.jpg", "caption": "Patty melt (goat party)"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ao-VD5uY69Xi8Q6TwCQJCg/168s.jpg", "caption": "Bi bim bop"}]}}, {"review": {"des": "I'm not even mad about the 4hr wait at Au Cheval in the middle of a weekday (does anyone have jobs in Chicago?) because it got my hangry butt into Little Goat Diner instead. <br><br>Now that I've had \"This Little Piggy Went to China\", breakfast will never be the same. It has: sesame cheddar biscuit, sunny side eggs, sichuan pork sausage, chili garlic chive sauce, and seasonal berries. What an incredible flavor bomb of all the things: savory, cheesy, creamy, tangy, sweet, tart, gahhh. Get this! The omelet of the day was perfect too. It contained mushrooms and cream cheese and was not overcooked. I am also a fan of their hash browns which are made up of very thinly grated potatoes and some cheese too.<br><br>It was not quite a 5 star experience due to the slow service and the pricing, though. Though the omelet was quite good, it was small, only filled with one veggie + cheese, and didn't come with anything else, but was $14 + tax/tip. But kudos for serving breakfast all day!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/gYBY7cN3T4MX4MgqDKezMw/348s.jpg", "caption": "This Little Piggy Went to China"}]}}, {"review": {"des": "Came with a reservation on Saturday morning. Would definitely recommend getting a reservation because it was very busy! <br>We got the cinnabun, goat chili fries, this little piggy went to China, a beef stew special, a lox omelet special, and the crumpets with assorted toppings.<br>The cinnabun was amazingly warm, soft gooey and smothered in warm cream cheese frosting. We easily devoured it especially as t came out first. <br>The goat chili fries came out next and was like a poutine with a cheese sauce covering the goat chili. Also very yummy! <br>By the time our entrees came out we were stuffed! We all especially loved the crumpets! Not sure if I've even had one before but they were crunchy on the outside yet soft and airy on the inside! Amazing. I also liked the this little piggy went to China. It was a szechuanese flavored sausage biscuit essentially. We left extremely stuffed! Great place for brunch!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aoGEsZK1A4lr5FX7wAMcZw/348s.jpg", "caption": "This little piggy went to china"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CHNrIWaQ8xoU3i54WmjsiA/168s.jpg", "caption": "Cinnabun"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SBxQnMwDVvUF_ZWkwahzNg/168s.jpg", "caption": "Goat chili fries"}]}}, {"review": {"des": "I hosted a work event at the bar area of LGD and the process was fairly painless from booking to the event execution. I worked with a party coordinator and all of the contracts and details were available to sign online. (easy) There was sufficient communication leading up to the event and also prompt responses from my liaison. <br><br>The event started up a bit bumpy as they did not anticipate 20+ hungry individuals would wipe out the food in minutes. After looking for someone to place additional orders... about 30 min in, they were able to get more food out to the group. The food itself was delicious and the portions were appropriate for the size of the group. I would suggest not having the bartender be the go-between for ordering food with the kitchen because they are busy servicing drink orders and may not have enough capacity to monitor how much of the food is being consumed. There should always be a liaison monitoring how the group is doing during the event to make sure things are flowing smoothly. <br><br>The event ended well with only a small bump in the beginning which is why the rating. The venue itself is beautiful and the food was excellent as expected. Guests also were happy with the drink options. <br><br>Thank you!", "pics": null}}, {"review": {"des": "People are pleasant, ooey gooey cinnamon rolls are sugary deliciousness, and the food is amazing. It's classics with a twist. My grilled cheese came out with some tapanade and pork in it, a beautiful blend of flavors. The hot chocolate had a fun design on the top of it. The decor was simple, the tables clean, and the bathrooms are 5 single stalls, 3 gender neutral.<br>I will definitely go back. It isn't a diner, it's amazing.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nLxXE5s40SweYMlK3uUHMQ/168s.jpg", "caption": "Grilled cheese- looks unassuming on the outside. The inside is full of flavor! Olives, tomatoes, some pork and probably other things!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k6NTA1XdXIABU_X2bIJ9WQ/168s.jpg", "caption": "Hot chocolate"}]}}, {"review": {"des": "I love Stephanie Izard and after several visits to Girl and the Goat, I was excited to try Little Goat Diner. The visit contained some great and some not so great experiences.<br><br>Great: <br>-Table service was solid. Not in your face and annoying but prompt, kind, and good at their job. <br>--Our complimentary appetizer was great. I was shocked at how awesome the sesame bread was. Definitely fresh made from that kitchen with great flavor. <br>My side dish was huge, and the star of the meal. The pork belly home fries hit all the right notes. A crispy, salty, savory delight. <br><br>Not so great:<br>-We put our name in but never received a notification text when our table was ready. The estimate was 45 minutes, so at 60 minutes I went back with that feeling something was wrong, and it was. We verified the glitch was on their end yet seemed to have to push pretty hard to get immediate seating. Not cool.<br>-My main course was not good. I ordered the los drowned sandwhich which sounded good but the flavors clashed vs. combined, IMO. <br><br>I'm glad that I have it a try, but I'll stick with the OG when back in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/beVTt5iUTR9vSf0Ix2cKqQ/348s.jpg", "caption": "Pork belly home fries. Delish!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zftCNxYtBpXNTQoHCzb9eg/168s.jpg", "caption": "Los Drowned"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/9CnKiUxztLlUfWJEY_wNog/168s.jpg", "caption": "Naan crudite platter"}]}}, {"review": {"des": "I'm not sure who copied who, but this place is VERY similar to Spenard Roadhouse in Anchorage:<br><br>hip-casual ambiance<br>comfort food with a twist<br>great service<br>always crowded<br>rotating menu<br>has other restaurants in different styles around town under same ownership<br><br>That is, to say, it's excellent.<br><br>This is kind of a local, farm-to-table-ish take on diner food.  We got sides and shareables and sampled each others food.  (something I also do at Spenard Roadhouse)  Everything was excellent, it made me wish I had a larger stomach.<br><br>I love the bar that doubles as a waiting area, it doesn't at all feel like an afterthought, it has its own little vibe going on.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wewuxFRnhSwLAEFKTtgQJg/348s.jpg", "caption": "pineapple gazpacho"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jS0DJLdHd8zeLA8cOjDGPg/168s.jpg", "caption": "chili"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/0VakdHHLWWKrvJDEJ-XUWA/168s.jpg", "caption": "some of the best nachos ever"}]}}, {"review": {"des": "One of my absolute favorite places to eat while in Chicago. This is my second time and I want to go back every time I visit. First time I had breakfast so this time I wanted to have lunch. I had the Fat Club sandwich...soooo yummy! I love the atmosphere and comfy seating-it's a large dinging area but definitely fills up on weekends. Everything I or my friends have tried has been delicious. I noticed they  ask if there are any food restrictions or allergies and that they use organic sugar on the tables. Little details that I notice and appreciate. Love love love. Can't wait to go back!", "pics": null}}, {"review": {"des": "Before you ask -- Yes, the wait is absolutely worth it. Little Goat Diner is essentially the totally casual, American diner version of Girl and the Goat. The menu items are incredibly unique and incredibly delicious.<br><br>I've been here a few times and each time, the waiters were extraordinarily helpful and polite. No matter how busy the place is, the food always seems to come out very quickly. <br><br>Here's how I'd rank the dishes I've tried:<br><br>This Little Piggy Went to China (4/5) - This is the most interesting dish I tried here. It's mostly savory (aside from some berries) and has a good mix of textures going on.<br>Okonomiyaki (5/5) - Hard to describe beyond savory pancake, but incredibly delicious and I recommend it very highly<br>Los Drowned (4.5/5) - Juicy, flavorful, unique, yum. <br>Paratha Burrito (4.5/5) - I'd describe this is a sort of contemporary American-Indian fusion. Not a burrito you'd eat with your hands, but just as tasty as an other burrito.<br><br>I'd suggest making a reservation or coming in between lunch-dinner to cut the wait short.<br><br>Definitely stop by if you're hungry and in West Loop!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RiuFEZrHhUt8kW6AMbQkiw/168s.jpg", "caption": "Paratha Burrito"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/e-cqZXCFAf0DdgILFpSrXA/168s.jpg", "caption": "This Little Piggy Went To China"}]}}, {"review": {"des": "Not your typical brunch place!<br><br>Even my husband who's not a very big brunch guy was very impressed.<br><br> A lot of the dishes have international influence, especially Asian spices. <br><br>The hubby got the Okonomiyaki which is a Japanese savory crepe with toppings on top and I got the Everything with Everything that came with a few crumpets, lox, pickles, etc and once you mix everything, it was very good and very creative.<br><br>Everything was very flavorful. The place is very cozy and the service was on spot too.<br><br> I recommend a reservation through Opentable as there was quite a wait when we went.<br><br>If you go with an open mind and don't expect the typical pancakes or omelettes, you will enjoy it.<br><br>Definitely check out the bar/store next door where you can buy some sauces by the same chef!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/_R_Gk0W0ga63p6XxYVL2yw/348s.jpg", "caption": "Hash Browns"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ytzrUPa18QDt80nn0_vAFQ/168s.jpg", "caption": "This Little Piggy Went To China"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/dbTSGTsIOS9fe1nUzVqyqw/168s.jpg", "caption": "Everything Is Everything Crumpets"}]}}, {"review": {"des": "Being such a big fan of the show Top Chef I had to check out this Stephanie Izard restaurant and it did not let me down.<br>I don't think you can go wrong with any of her restaurants... and this place definitely keeps great the reputation going.<br>I came here for a hangover remedy and would highly recommend anyone in the same position do the same. (But in all seriousness) They have SO many amazing items on their menu and you can never go wrong with a place that serves breakfast choices all day long! <br>I actually love that from certain booths you can see the food being put out on the \"to be served\" counter because it allowed my fiancé and I to get some ideas of what we wanted. Once he saw that giant burger come out, it was game over. So naturally that's what he ordered (Goat Almighty). And I went with the machos nachos because even from afar I was drooling over them.<br>I will have to say that the goat almighty might not be a good choice if you're going on a first date, since watching my fiancé devour that giant burger was an experience all in itself. I mean, it's huge. And according to him, very worth it.<br>The nachos couldn't have been better. The homemade masa chips were perfectly crispy and hearty while still tasting light and flaky. The pork melts in your mouth and all of the fixins on top just added layers and layers of flavor. I went to town on these nachos for about 15 minutes and still couldn't even put a dent in them. You definitely get your moneys worth here. And a dish like the nachos would be perfect for sharing. I was so happy with my choice but it was hard for me to decide on what to eat, so I cannot wait to go back and try more fabulous food. We had a really sweet server as well, wonderful service here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tiDvdAJD7e1OH1hAErouKQ/168s.jpg", "caption": "Goat almighty burger... huge!!!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uTIwAzIhxrv8ORGQaQ4Udw/168s.jpg", "caption": "Top: Goat almighty burger Bottom: machos nachos"}]}}, {"review": {"des": "Little Goat gets better the more I visit.  The menu is very extensive, so you're sure to find something you're in the mood for.  You can never go wrong with all day breakfast, but I recently was introduced to the Chickpea Salad. Wow!  I'm not usually a salad guy, but trust me on this!  I had it once with griddled chicken, and once without, and it was great both times.  The desserts are awesome, too!", "pics": null}}, {"review": {"des": "This place is always crowded (even on a Wednesday lunch hour), but luckily they take reservations so please take advantage of that. It's cute and people's \"go-to\" when visiting out of town or wanting to brunch on Saturday, but I disagree.<br><br>Perhaps I'm not a fusion fan, but that's the point of the menu. Lots of flavors everywhere, and I don't think they always work. I've gone for both dinner and lunch. I tried their machos nachos, and it was a soggy mess of flavors partying in my mouth. Would not recommend. I decided to try a simpler \"flavored\" dish so I tried their patty melt. It's decent and hit the craving for a Whataburger patty melt, but not worth paying triple the price for. I ordered fries a la carte with it, and they never came. I asked for it twice and the waitress kept saying \"fries take a while and are on their way\" while everyone else at the table already received their fries! I ended up splitting fries with someone else at the table, and glad I did because it was definitely a lot of fries for one person to devour.", "pics": null}}, {"review": {"des": "I absolutely love Little Goat. I've been here multiple times with friends and have gotten the following:<br><br>Goat Almighty ($20 but enough for two easily): delicious combination of meats, burger toppings, etc on a buttery brioche bun. I especially love the yucatan pork. Yum!<br><br>Fish tacos: So delicious. I love the flakiness of the fish combined with their fresh slaw. <br><br>My friend swears by the Los Drowned. It was my friend's bday and they gave her a cake shake for free. I will always be back for their speedy service and their delicious foods, cheap prices, large portions.", "pics": null}}, {"review": {"des": "We love this place! We have now been there three times and it is definitely becoming a part of our rotation!<br><br>The first visit I tried the Reuben and fries and thought it was absolutely delicious! I also had a hard time deciding what to get because everything sounded so good! We knew we needed to come back!<br><br>The second time we sat at the bar and worked on lesson planning using the WiFi and pursued the incredible coffee menu, as well as the extensive alcohol menu! There is something for everyone and every beverage need!<br><br>This last time, we brought a friend and tried the incredible fried chicken sandwich, the bahn-mi burger, and the fries. Oh my goodness. The fried chicken sandwich is a game changer! It will be hard to ever get anything else again!<br><br>The wait-staff were kind, the restaurant was clean and welcoming, and the wait is usually manageable considering the weight at surrounding restaurants. If you've never been, I highly recommend that you drop into the Little Goat diner at your next opportunity", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2JCsc8Y_NjuKxsmmEuVkvg/168s.jpg", "caption": "House Smoked Fries"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7PLPVrjOzEq7uSg1R70H0g/168s.jpg", "caption": "Fried chicken sandwich"}]}}, {"review": {"des": "Heard about this place and its sister restaurant a lot and had to know what the hype was about. Well, now I also love this place haha. Where to begin? The place itself was really charming and classy. They open as early as 7am so we were able snag a last min reservation on sunday morning at 830 am before the rush. We were about 15min late sadly so lost our table but we still got some counter seats! Waitress was really nice and helpful and the service was super fast considering how busy it was and became. Their system, which we observed from our counter seats facing the kitchen, seemed super efficient and the food always looked so amazing.<br><br>If you like thick yogurt I highly recommend the honey yogurt and granola (its nut free) to start with or on the side (but beware, it is quite filling). If you like the taste of goat cheese, I highly recommend the little goat latte. The goat milk they use made it taste slightly like goat cheese which I loved. I've never had anything like it before. Not too sweet of a latte either but a little rich (they top it with whipped cream).<br><br>We ended up ordering the everything is everything crumpets and smoked corned beef hash with over medium eggs. The hash was what I was craving and satisfied me but that dish as a whole was a little bland. A little bit of pepper and salt solved that though! The everything is everything is like a lox platter with the most amazing homemade sesame english muffins. They're super soft and buttery almost like a biscuit and were awesome with tzatziki spread and lox. A lot of pickled items on that plate too which I loved.<br><br>Definitely coming back here again in the future!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pvUSrbmWi6NvZYYnwCG15A/168s.jpg", "caption": "everything is everything crumpets"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/dVnLCeo_S3tbrt1wCCVsuA/168s.jpg", "caption": "Smoked corned beef hash with eggs"}]}}, {"review": {"des": "We decided to stop in here for breakfast on a Saturday morning around 10:30am. The wait was about 20-40 minutes but they have a bakery section where they have a few booths and a good amount of bar seating that's first come first serve and serves the full menu. We waited about 10 minutes before we found space at the bar. The server quickly brought us menus and water. We started with hot coffee which was fine. Nothing special. For food my husband had the Elvis waffles and the I got the bullseye French toast. <br><br>The Elvis waffles were a big portion. It's 3 waffles with peanutbutter butter, bananas and a bacon syrup(we asked for the regular syrup instead). My husband enjoyed them! He said the waffles were light and fluffy and the peanutbutter butter was different but a good different. The amount of peanutbutter butter they give you is way tooo much. <br><br>The bullseye French toast was unlike something I've ever had. It's an sweet onion brioche with an egg in the middle and topped with fried chicken, strawberries and a bbq maple syrup. At first I thought the sweet onion brioche would be gross for French toast but I was so wrong. The onion flavor was so faint especially in comparison to the other flavors of the dish. The French toast itself wasn't as dense or custardy as I like but it had all the falcons I crave when I went French toast. The egg in the middle was cooked past medium but less than well done. It was a little gooey but not runny. The fried chicken was basic fried chicken. I recommend getting a bit of the egg, French toast and chicken all in one, the flavors work so well together it's amazing. <br><br>I recommend coming here at least once so you can try the bullseye French toast. It's a very unique dish. My husband liked his waffles but they weren't something he'd specifically go back there for. I do recommend making reservations if you have a large party because it gets really busy on weekend.<br><br>Overall the food and service was good. They have a decently sized menu so we'll def be back to try something else next time! We also saw the Owner and Iron Chef Stephanie Izard which was a pleasant surprise!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/45JqGWZwumSXeNG04cOCkg/348s.jpg", "caption": "Bull's Eye French Toast"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1MXEUVJ7zfyD0QO9j0qXfg/168s.jpg", "caption": "Menu 09.29.18"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ihIm-iHPEvjhaupxcKf_Vg/168s.jpg", "caption": "Fat Elvis Waffles"}]}}, {"review": {"des": "This restaurant is at a prime location in Chicago. The only downside is to find a good parking stop (Unless you go for Valet). Once you figure out where to park, and when you finally make it here you will love it. You will love all the Goat artsy stuff. We had a 35-40 minute wait time. Once we checked in, we walked around to explore the places around.<br>We went into the Little Goat cafe which is part of the same diner. We got a Latte, a hot chocolate and a light snack to satiate our immediate hunger.<br>After 30 minutes, we were shown our places to sit. I got the \"Sloppy goat\" burger and it was fantastic. You don't get goat burgers in a lot of places in the US, and once I saw this I jumped at the opportunity to order them.<br>My girlfriend ordered Chamomile tea, fruit cup and a yogurt parfait. They have a variety of heave meals plus light meal combinations. So you will always be able to find what you want based on your current appetite.", "pics": null}}, {"review": {"des": "I've dined here twice now (once on my own dime and once on company dime) and I just don't get the hype around the food. It's so heavy and salty. The milkshake is $9 and I didn't enjoy it because it was ridiculously thick and sweet and had to abandon it. In my most recent visit, I had the this little piggy went to China, which is a yelp favorite, and it was too salty. If the sauce was kept separate from the sandwich, it would be more palatable. I did enjoy the sides that my table ordered; tempura mashed potatoes, french fries, and brussel sprouts which were cooked to perfection.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/HRVQ6ZpSa2CT3i-r5bzkIA/168s.jpg", "caption": "Tempura mashed potato"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0WGzets6LT-qBwtVL3yDBg/168s.jpg", "caption": "This little piggy went to China"}]}}, {"review": {"des": "I am a bit disappointed! This place is just average. We drove in from O'Hare fighting moderate but aggressive traffic and paid $16 for valet parking in order to eat at that this awesome sounding place with 3900 reviews yielding a four star average. <br><br>To get a table at lunch time was a 1 hour wait. They have an espresso bar and outdoor seating so we enjoyed espresso drinks and cookies outside while we waited. I got an americano (surprise, I know) but the others got lattes and macchiatos with goat milk - except wait they were out of goat milk. All good nonetheless. <br><br>Once seated, in a booth with torn upholstery and very worn out springs, I ordered a burger with goat meat and cheddar instead of American cheese, and the corn elotes as a $7 side. The bun was brioche and well on the way to being burnt. Burnt was the overwhelming flavor of this burger. The cheese was American, not cheddar. Other than the meat, it was a mushy mess. The goat meat itself was fine.  The corn elotes were good but would have been happier with half the portion. <br><br>So we had fun seeking this place out and eating at such a hipster place, but I can really only recommend the espressos.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qBxEPVbxYTWnWBrxoVgzfQ/348s.jpg", "caption": "Elote Corn"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/apbdEBbuv3jlmBtg-MPM3g/168s.jpg", "caption": "Goat burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/AUu45Abec-XJjBQ7-AeBeA/168s.jpg", "caption": "Hand crafted espressos"}]}}, {"review": {"des": "This place is no ordinary diner. Think of it as a hip gathering conjunction with upscale pricing. The food is delicious and part of the experience. The area is divided into diner, bar, bakery, coffee bar, and slight gift shop. <br><br>Reservations can be made until a cut off time. We decided to chance it and arrived at noon. There was a 30 minute wait. By luck, two spots opened at the bar. The bar is in a connected room, and is not part of the reservation seating. It's first come first serve. We were told by the bartender that everything comes in shareable sizes and that you can't go wrong with anything in the menu. Always choose your first choice, he said. <br><br>I ordered the This Little Piggy Went To China (cheddar biscuit, sunny side egg, Sichuan pork sausage party, chili garlic sauce). This is the most ordered plate at LG, and I can understand why. It's not spicy, like normal Sichuan dishes. But, it is savory and numbing. My husband ordered the Fat Elvis Waffles. He said they were normal but delicious banana and peanut butter waffles with bacon syrup. Great portions.<br><br>Service at this restaurant (and it's sister restaurants) is guaranteed five stars. People here are polished.<br><br>Pricing is on the higher side. It's the West Loop... what are ya gonna do?! Would I come here again? If I'm back in the West Loop and wait time is around 30 minutes (rare), I wouldn't say no.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jSMNIE8UpS3Ic3tZRBaozQ/168s.jpg", "caption": "This Little Piggy Went to China"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Z83yNUNvPDND6dnXE3gILA/168s.jpg", "caption": "Fat Elvis Waffles"}]}}, {"review": {"des": "Wow! Incredible. My husband and I went here today after a recommendation from a friend. We are visiting Chicago for the weekend. <br><br>We made a 9:30 reservation for breakfast and we're so glad that we did as it was packed when we got there. We started the meal off with a cappuccino and a cold brewed coffee and then my husband had the biscuits and gravy and I had the shrimp and grits. Each were delicious and satisfied us after a night out. <br><br>I was pleasantly surprised that the shrimp and grits were not extremely heavy and also that they grits were not overly cheesy. The flavors worked well together and I loved that this pistachios. <br><br>My husband was worried about the mushrooms in the gravy as he's not a big fan of them, however it was not overpowering and worked beautifully. <br><br>We absolutely will come back on our next trip to Chicago!", "pics": null}}, {"review": {"des": "Stephanie Izard does it again! After Girl & The Goat, and Duck, Duck Goat, I had to complete the trifecta...<br><br>MUST order: Pork Belly Pancake!!! It's savory and crunchy and piled with a slaw so it feels less bad for you. The textures work very well together. <br><br>I'm excited to come back and try something sweet!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wSHAgQ5mmz0-D7gIn0VaNg/348s.jpg", "caption": "Ft. Pork Belly Pancake, Bloody Mary, Tostada Special"}]}}, {"review": {"des": "Who hasn't heard of Stephanie Izard? Ok if you haven't, this isn't meant to be offensive. When I used to watch top chef, I was inspired by the woman chef that kicked butt in the kitchen. I had her restaurant on my list for to- go since that time. <br><br>When we found ourselves in Chicago for few days and I had a dinner for one on my schedule, I headed to the Little Goat Diner. I know the girl and the goat is not the same as the diner but upon entering the restaurant I was told it would be a 30 minute wait, but the diner was open for seating. Diner it is, I said. <br><br>The ambiance in this restaurant is very diner-esque, appropriately so. For example there are booths, and a counter with seats and old school menus. My server was a young woman that was friendly and willing to answer questions.  I asked her about the goat chili fries and she confirmed my question about it being a large enough portion for dinner for one. <br><br>My food came out few minutes after ordering; with lots of patrons seated,  the kitchen staff is on their A game pushing out food fast. The fries were freshly cut, fried and delicious. The goat chili on the other hand wasn't a winner. It didn't work for this application. It was too smoky or overpowering for the fries and it wasn't the meat; I thought something in the chili seasoning was too intense. Goat chili with rice (or even spaghetti, if you're from Cincinnati) may work but on top of french fries wasn't my favorite. <br><br>Sadly I don't live in Chicago to revisit this diner to try other things but with an okay experience on this go, I'd rather go to the Girl and Goat restaurant on my next visit.", "pics": null}}, {"review": {"des": "Upon recommendation by my Chicago-resident cousin, a group of 5 of us showed up around 1:15 PM on Monday afternoon. There was a wait (on a Monday?! intense!), so we strolled around the West Loop for about 45 minutes until we were called to be seated. Upon arrival, we were placed at one end of a long communal table. The space is pretty loud, so it was a bit hard to hear each other at times. The place is diner-chic with a variety of seating including bar stools & booths as well as a photo booth near the entrance.<br><br>Yes way, breakfast all day! Most dishes are classic American with an ethnic twist. I ordered the This Little Piggy Went to China, which is a sesame cheddar biscuit cut in half with the bottom piece topped with savory Sichuan pork sausage and a sunny egg. The chili garlic chive sauce and greens added unexpected flavors that went together tremendously well. If you're looking to kick it up even more, ask for bottles of their house-made hot sauces (which come in hot & very hot). The dish also comes with some blackberries which look lovely and add a tart sweetness to balance it all out. Our table also shared the pork belly home fries which were savory and delicious, especially with that hot sauce.<br><br>This really is ideal brunch fare in my opinion! Little Goat is super tasty, unique, and fun! The only reason I'm docking a star is due to the service. Simply put, our waiter had a 'tude. When I asked which kombucha there was, he said they were out. No apologizing or offering of alternatives. They were also out of goat milk for the latte. He didn't come by to check on us (even when my friend was trying to flag him down to order a drink) and just seemed like he didn't want to deal with us at all. When he came at the end to collect our payment, we handed him our 5 cards and asked if he could split it. He scoffed \"I guess\" and rolled his eyes. So unnecessary. I guess it's better that he didn't come around often, so we weren't as affected by his negativity. I just don't understand how you can be so disinterested when you're surrounded by all of this delicious food!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-BGNKdG98SqnLTEetm5oxw/168s.jpg", "caption": "TLPWTC"}]}}, {"review": {"des": "Stopped here with some gal pals for lunch. It was delish!<br>I had the pork belly pancake (I asked to add a poached egg) and my pals each had one of the goat burgers. We all loved our dishes and raved about how the flavors are so interesting together. With our dishes, I noticed an Asian flair.<br>With the pork belly pancake, I think they should just add the poached egg. It was so delicious and really helped pull the dish together.<br>I took half of it home and had the rest for breakfast the next day.<br>We came at a time when it wasn't busy (2pm on a weekday)... so service and all that was great.", "pics": null}}, {"review": {"des": "Been dying to come here since Stephanie Izard had won her respective season of Top Chef. Finally got the chance to do so when I was revisiting Chicago along with the bf and a friend last month. I'm glad we had made a reservation to come here in advance, because even though it was during the day on a Monday, the place was pretty packed and soon after we had arrived, a line had formed outside.<br><br>I had an order of their parathas burrito and we also got a side of crumpets to share. The burrito was delicious: the eggs and bean salad was definitely more Mexican in flavor profile, but the chili pepper sauce and the paratha wrap was obviously more Indian. The crumpets were unfortunately a tad too greasy for me, but the strawberry rhubarb spread it came with was delicious. <br><br>Service was pretty attentive and the interior is super cute, as is the giant little (oxymoron, anybody?) rotating goat on the roof of the establishment. I'm very glad we got the chance to come here and would come back here in a heartbeat if I happened to find myself in Chicago ago.", "pics": null}}, {"review": {"des": "I love Stephanie Izard and really wish I could go to Girl and the Goat, but since I was alone, I opted for the diner. I was so excited to come here. I arrived at around 2pm. It was fairly quiet since the lunch crowd had died and I was seated at the counter. <br><br>I sat there for a while trying to decide what I wanted... everything looked so good. I wanted to do the chicken + waffles combo (not the Bullseye French Toast) but figured that it was going to be way too much food so opted for the fried chicken + chili cheese fries. After seeing the giant portions of the fried chicken coming out for other tables, I asked if it was possible to change to the Bullseye French Toast instead. My waitress was extremely accommodating and put in the french toast for me. <br><br>My cheese fries came out first. I have to admit, I am not the biggest fan of chili since I don't really like beans... so I don't know why I ordered it, but I couldn't resist cheese fries. However, the fries were extremely skinny, and the cheese was a melted fancy cheese... so I didn't get the same satisfaction I normally get from salty fries with fake melted nacho cheese. As much as I enjoy fancy food, I learned that I do not enjoy fancy cheese fries. <br><br>My french toast came out next. It's their twist on chicken and waffles. The french toast had 2 eggs fried on top. The syrup was already poured on but I like that it didn't drench my bread and made it soggy. The chicken was cut up chicken tenders. It was already coated in syrup so aside from tasting sweet, I didn't taste much else.<br><br>I got a Los Drowned and the Not Chinese broccoli to go to eat at the hotel. Someone else ate the sandwich and I ate the Not Chinese Broccoli. It was a couple pieces of broccoli coated in something similar to the sweet chili sauce. Not $7. <br><br>I was fairly disappointed because I think I hyped it up too much in my head. Although if I lived in the area I'd definitely like to try the entire menu and see whether it was just what I ordered that was disappointing.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zDSqZdMNqq5300fhIYBkBA/348s.jpg", "caption": "Bull's eye French Toast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/D3IYWbCRjLQpLn15JJVlQA/168s.jpg", "caption": "Cheese fries"}]}}, {"review": {"des": "We were visiting my home state to see family but stopped at chicago to explore and sight see. Several friends recommended this place to us and it did not disappoint!<br><br>All of the entrees we ordered was bursting with flavor and life!!!<br><br>I seriously felt regret that I wouldn't have the time nor the stomach room to try everything on the menu. We got the burrito, shrimp and grits and banh mi burger.<br><br>We all loved it and I loved it so much, I bought both of the chef's cookbooks, on display in their bakery next door, later on after my trip.<br><br>I look forward to hopefully being able to come back again. The cinnamon roll that came out to the table next to us looked absolutely amazing and is on my top-to-do list next time I am in the area.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zv4CpC3iLKf2IBWFoVHFjQ/348s.jpg", "caption": "Banh mi burger"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hXax19fWi39mkXINgaUrOg/168s.jpg", "caption": "Shrimp and grits"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/d3DACwjdO1oKgie68APLQg/168s.jpg", "caption": "A savory and delicious burrito!"}]}}, {"review": {"des": "LGD!!! Wow, I loved every bite of the white cheddar mac and cheese, goat chili and smoked fries I was able to consume. The service was very attentive and I was so pleased to see bottled soda options (Cheerwine!). The restaurant even offers valet parking, if so inclined", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qGfOk4IITX3y6yfB6_rs8w/348s.jpg", "caption": "Butterscotch Root Beer with Cheerwine in the back"}]}}, {"review": {"des": "I was excited to come here, but left super dissatisfied.<br><br>The waitress was nice and described the dishes well. So service wasn't that bad.<br><br>I think the AC isn't as great by the counter space since there was 90 degree weather outside. I felt so hot but I am sure that's because the kitchen is right in front of us. I thought it was weird that they didn't give ice water. It was water in a pouring jug under the counter space. The seats were pretty uncomfortable, too. Our seats were kinda loose.<br><br>I looked at the menu and a lot of it I wasn't feeling. It's got a lot of Asian flavors, some Mexican flavors on top of trying to give diner dishes. So it was hard for me to decide on something because there was one flavor I felt like was out of place. I finally decided on the Bull's Eye French Toast with a side of hash browns. I love brioche toast and the chicken sounded good so I went for it. I really liked that the egg was inside of the toast. It was a pleasant surprise and softened up the toast nicely too! I did find that the strawberries on top of the chicken was weird. The sugared strawberries were wilted and stained my chicken. It was weird because I didn't want to eat strawberry flavored chicken. I guess it makes sense to put the strawberries on the chicken on the toast because where else would it go, but it certainly did not make the eating experience taste better.<br><br>Also, they completely forgot my hash browns. The cheese inside hash browns sounded good, but I didn't get that when they finally bought out my hash browns. I'm glad they said it was on the house, though. Since I already had finished half my french toast by the time the hash browns came so I barely touched the hash browns.<br><br>This is my first time trying a restaurant in the Stephanie Izard empire and I'm not as impressed. I'm less likely to want to want to come back to this place and I don't have a desire to try her other restaurants. Although, if I am able to grab a decent reservation time for her other restaurants then maybe I would try the rest.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5Wpy7ooDQ3y_T72T4jE9zg/348s.jpg", "caption": "Menu"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fJ2Dp2YLJBx0-dDC2efgnw/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2agfiAIzn6ZqDFGBmWH_Jg/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "Ok so I treated myself to brunch on my birthday. It was a random choice based on Yelp reviews and recommendations. I couldn't have been happier with this choice.<br><br>I originally wanted to get the Bull's Eye French toast. But my server informed me that the egg couldn't be cooked any other way, and I didn't want the runny egg in the toast. So I chose the Fat Elvis waffle, with cheese grits and sausage. It was phenomenal. The portions were plentiful and super flavorful.<br><br>My server was also very attentive and wanted to make sure the choice was a good one. So pleased with this place, I can't wait to return and try another entree.<br><br>One thing I liked about this spot is that there's a bar attached and it was very nice. I waited there until my table was ready. The bathrooms are clean and the restaurant is generally very well maintained. I consider it upscale casual dining as advertised. Definitely try it.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sZ9TLeRR_vxN8__AzVqdyQ/168s.jpg", "caption": "The Fat Elvis Waffles - so good!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kxEQ0uGcPC7mLliR5ZZwZg/168s.jpg", "caption": "Delicious drink from the bar"}]}}, {"review": {"des": "This place is amazing and be sure to make a reservation! We went on a busy Sunday morning (actually Father's Day) for breakfast. Since we had a reservation, we were sat at a nice comfy booth within a couple of minutes. The service was outstanding, friendly and gave great recommendations. Upon request, they have a vegan menu, how cool is that? It has many of the dishes with some simple substitutions so I don't have to even ask for them. Sweet!<br><br>We went with a sampling of a few dishes. First off, everything crumpets. Get this, they were fresh out of the oven hot and delish. Next I tried the scallion pancake off the vegan menu. This was so tasty and fresh; super impressed with the veggies, flavor, and <br>presentation. I was having a hard time not getting a sweet pancake and our server suggested a single blueberry pancake. Awesome! Got a taste for it, but glad I didn't get a full order. It was probably my least fav of the bunch. We also tried the tempura mashed potatoes. This was a unique dish that had a tasty Asian flare. <br><br>All in all, I would definitely go back and try some of the same and new dishes when back in the Chicago area. Such a creative menu (those desserts going by to other tables looked amazing). I loved the little goat touches, especially the coffee mug. I couldn't resist buying it in the cafe next store. Thanks Chef Stephanie and team for such an amazing meal!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/nfxFzGMqyp4m13Pof_NGZg/348s.jpg", "caption": "Everything Crumpets side"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Z-LUzsZ6XYvn5kiwA-CAnA/168s.jpg", "caption": "Blueberry Pancake"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rxRFfXJtNjkOw8BHn2Pu7g/168s.jpg", "caption": "Tempura Mashed Potato"}]}}, {"review": {"des": "The Little Goat diner is an absolute must when I'm Chicago.  Amazing food every time I have been.  Good coffee and knowledgeable staff too it off. We went on a birthday and were given the cinnamon roll with a candle in it for free.  Nice touch to great food.  Explore the menu!", "pics": null}}, {"review": {"des": "I love the feel of this diner, as it straddles a 50's diner but modernized and with lots of natural light. We were seated at a small table, but I didn't feel too crowded next to my neighbor.<br><br>First up, I ordered the sesame milk latte. I have to say, this tasted horrible. The first sip, I grimaced and it had a weird salty flavor. However, my meal got better when I saw they had omonoyaki on the menu which is a unique Japanese food that consists of a poached egg, cabbage flour and vegetables and meat. I have never seen this dish outside of Japan. <br><br>I was a little hesitant to order it, but decided to go forward anyway when the waitress assured me Japanese customers confirmed it was authentic. Pleasantly surprised when it came with little Tempura crunches on top. It was very tasty and I could not figure out what it reminded me of, until it struck me--It tasted exactly like the fried dough of takoyaki (fried batter with octopus in the middle minus the octopus)<br><br>My friend ordered crumpets which came with lox, cream cheese, pickled onions and egg salad. Very unique fusion food! The waitress was also friendly and very knowledgeable about the dishes and the ingredients.<br><br>If it wasn't for my strange latte, this would have been a 5 Star experience. Definitely go, if you get a chance!", "pics": null}}, {"review": {"des": "I was in Chicago for a short conference and I knew I had to make it out of my hotel in Rosemont to venture into the city for a good meal.  I wasn't able to get a reservation at Girl and the Goat but I was able to get a counter reservation for 1 at Little Goat Diner. This ended up being a great choice for a solo diner so I didn't feel as lonely at a table by myself.  The waitress was very nice and helpful in the menu options.  The couple next to me even offered their suggestions to me. <br><br>Breakfast is served all day and there is a wide selection of drinks. I would definitely want to try out the drinks next time.  This time I did the breakfast and ordered the This Little Piggy Went to China.  It was a sesame cheddar biscuit with Szechuan pork sausage and a chili garlic chive sauce.  There was also a fried egg on top.  It was delicious but the numbness of the Szechuan pork sausage was strange for me.  I had a hot yet cold feeling on my tongue that was too much for me.  The flavor profile is very complex and tasty though.  I would want to try something a little less exotic next time so I can handle it better lol.  Overall a fun and exciting dining adventure :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/y3r7Ph8zn6DBSjYCwQqD5w/168s.jpg", "caption": "Outside"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nJa6pABwroC0EWa06bYHxg/168s.jpg", "caption": "This Little Piggy Went To China $14"}]}}, {"review": {"des": "Update: girlfriend left shopping bag at restaurant and it was held and safely returned next day so at least staff is honest!  Adding one star :)<br><br>This place is disappointing for the price.  Service was nonexistent, the food was cold and the $20 burgers don't even come with fries.  The nachos were pretty money but overall this place is not worth the price tag.  Was expecting so much more...", "pics": null}}, {"review": {"des": "I can only say one word about this place: amazing.<br><br>We showed up on a Saturday at noon. That was a mistake, it was an hour and fifteen minute wait! It was worth it, though. I got the little goat latte- with goat milk and whipped cream. I was immediately interested. The menu had a ton of interesting and different creations- i wanted to try everything. <br><br>I finally settled on the fat club. It's the best club I've ever had- and it's my favorite sandwich. It had cucumber on it, which initially confused me but I ended up loving it. <br><br>For dessert, I got the honey comb chai ice cream. Woah!!! What a dessert. It was so sweet and the chai blended well. I would have it everyday, if possible.", "pics": null}}, {"review": {"des": "This is a must visit if you are in Chicago! The food was nothing but amazing and the presentation was superb. We sat at the bar and got great service vs. waiting for an hour for a table. Great food, great atmosphere and great company!", "pics": null}}, {"review": {"des": "Came here for breakfast while visiting in Chicago. Every employee we encountered was super nice and helpful, and even gave us other Chicago recommendations. The corned beef and hash was good, and not pictured are the biscuits and gravy. They were mostly flavorless which is kind of a bummer because it's a more expensive spot to eat. Other than that it's a really beautiful environment and nicely decorated.", "pics": null}}, {"review": {"des": "Great decor. <br>Really well executed food that is super tasty. <br>Helpful, fast service. <br><br>My wife is a huge fan of Girl and the Goat, so we were really excited to try LGD. <br><br>Right off the bat the decor and styling of the restaurant is just plain fun. It felt like a combination of a classic diner and my grandmother's kitchen. <br><br>We started with the Crisp Shrimp Cocktail. This was a surprising and original take on a classic. The ramen wrapping gave the shrimp a great crunch - while the lettuce and cocktail sauce wrapped everything together perfectly. <br><br>My wife and I decided to split the Tonkatsu sandwich and the Patty Melt. <br>The Tonkatsu was incredibly savory. The pork was nice and crispy, but still juicy. The combination of the of mayo, cabbage and bbq sauce was the perfect topping. And putting the whole thing inbetween classic white bread was just fun. I would order this again in a moment. <br><br>But for me, the real star was the Patty Melt. It was ooey, gooey, juicy, cheesey, crispy and all-around delicious. While each of the components of this sandwich was high-quality, it was the execution that really made it shine. The LGD team took a classic (the Patty Melt) and nailed it. They didn't feel the need to do anything crazy with it - they simply took a classic sandwich and did it perfectly. <br><br>I hope to be back to LGD soon!", "pics": null}}, {"review": {"des": "The food here is great. I had breakfast on a busy Sunday when in town and had the chicken and waffles. Also had mimosas (which were really small and expensive, meh) but overall the food was inventive and delicious. It's like an American diner with Asian,Mexican and comfort food influences. I am only giving four stars because the service was not all that great. The people who worked here weren't very nice and took forever to do things unfortunately. I would definitely go again though", "pics": null}}, {"review": {"des": "Came here with a date because Au Cheval was too crowded.<br><br>I ended up not eating because but had a few beers at the counter area and the place is really nice.  Cool vibe inside, and was nice and busy.  Would come back and try the dinners sometime", "pics": null}}, {"review": {"des": "Sitting at the counter watching the frenzied chefs in the kitchen cranking out perfect dish after perfect dish is a lot like watching an episode of Top Chef. But it's also a lot like being in a tile box with 150 people screaming to be heard... because that's exactly what it is.<br><br>Somewhere along the line restaurant designers decided that people wanted to eat in a loud environment because it made them feel like they were in a happening scene. They achieved this by not bothering to hire acoustic engineers. But even an authentic diner doesn't have that kind of ambiance. It's a place where you can hear the rattle of cutlery, and the waitress chatting up the regulars. There's certainly no chance of that here.<br><br>But the food is wonderful. Each dish is Stephanie Izard's take on traditional cuisine, with her own twists. And those twists are exceptional.<br><br>Okonomiyaki is a wonderful Japanese breakfast pancake/egg dish with a delicious combination of savory sauces and crunchy bits to add texture.<br><br>Tempura fried mashed potatoes are light, with a perfectly crisp and not oily shell.<br><br>And One Twisted Sundae is a decadent sweet/salty combination of pretzel ice cream, caramel sauce, and whipped cream.<br><br>There are an interesting cocktail menu and a limited selection of beer and wine, but if you want to go authentic you can choose from fountain drinks, shakes and floats.<br><br>I guess the service is good. I couldn't hear well enough to tell.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FK-Qfhc9vPddPoeJSNXt1A/348s.jpg", "caption": "One Twisted Sundae (Pretzel ice cream)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8IbM2IBUFwcClQ1dGwfYtQ/168s.jpg", "caption": "Tempura Mashed Potato"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RQ-Cd1kV6yBZizqBZuyAbg/168s.jpg", "caption": "Okonomiyaki (Pronounced Yum)"}]}}, {"review": {"des": "I just don't get the hype? It was alright. It's got a cool updated modern diner feel and super family friendly. We saw lots of families and kids dining but also it's def a spot for millennial foodies. Our waiter recommended the tempura mashed potatoes, it was horrible. I had the patty melt and it was so greasy and heavy, also disappointing. The only thing we liked was a salad we shared before our entrees which was a cold beef and soba noodle salad. I think it was a seasonal menu item. Idk if I would go back.", "pics": null}}, {"review": {"des": "Ordered a bunch of popular menu items including Little Piggy Went to China, Pork Belly and Shrimp, Brussels sprouts and Okonomiyaki. Same problem as the Girl and Goat: food is way too salty. The meat is over-seasoned and you can't really taste its flavor other than an overdose of salt. The shakes here are decent though. The cookies and cream shake was a blast.", "pics": null}}, {"review": {"des": "Ok, so I will say some places truly do live up to its hype. Well done Little Goat you do live up to the reputation. <br>Stephanie Izard's version of 'diner' with eclectic ingredients still manages to make dishes familiar enough and very delicious. <br>Sloppy goat with a slight tang (pickled peppers & coleslaw) with soft brioche bun definitely had delicious game! <br>Baked crab dip with Ritz crackers, Pork belly home fries, honey yogurt with house granola was out of this world delicious. Thick yogurt with moderate sweetness perfectly complimented the flavor. Root beer float was also a nice touch.<br>When in area and looking for a lighter flare, this place is a must try.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9btHDQYbHd8ZxcypaAgT-A/168s.jpg", "caption": "Outdoor seating"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/209USa66bohnC5mp032slg/168s.jpg", "caption": "Valet parking"}]}}, {"review": {"des": "Came on a Saturday afternoon - super packed! Once seated, service was quick and food came out fast. Cute, bright space with lots of seating. Would be interested to check out the bakery next door on our next visit! <br>Bulls Eye French Toast is just as good as all these reviews say. Also ordered a side of cheesy grits that were very flavorful! Would recommend both.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_9-5S7j4I7g40zYgyIly-Q/348s.jpg", "caption": "So good"}]}}, {"review": {"des": "Saturday Lunch at the market, Fulton to be exact, incredibly busy outside as well as inside. We had a short wait, quite impressed with how quickly the meals move through this place. A couple seated at the bar recommended the Bloody Mary, so I gave it a try, nice and spicy, intensely red too, I like that. This was my first visit to the Little Goat, but my son had been here before and he ordered the Goat Almighty Burger last time as well as this time. A monster of a sandwich, quite photographic, it can be smashed down and turns out to be somewhat manageable considering its initial height. Doubt that I will ever be able to eat one of these, however my Crispy Creole Chicken Sandwich turned out to be quite a monster itself. This was a very good sandwich, a wonderful bun which was toasted superbly, loved the pickled jalapeno, one of the best chicken sandwiches I have ever had. One more recommendation, Tempura Mashed Potato, quite an experience, not sure how to describe it, try it. (FDV Approved - Food, 4.2; Design, 4.2; Value, 3.3)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZoRwzuzJGXF7lNy6nzoO_g/348s.jpg", "caption": "Tempura Mashed Potato! (keepsmilingphoto.com)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/OmrAx9FjxYLYFoXEYDJFQQ/168s.jpg", "caption": "Crispy Creole Chicken Sandwich!(keepsmilingphoto.com)"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kKlFNbS6khIT2w3aI9GX9g/168s.jpg", "caption": "Goat Almighty Burger!(keepsmilingphoto.com)"}]}}, {"review": {"des": "They squeezed us in on a Saturday night after spending an afternoon on the roof for goat-toberfest!  We ordered the braised beef sandwich (Los drowned) and fish tostadas. My oh my, we will be back tomorrow. So good, so good, so good!  Thanks to Justin (from NJ) and crew (you can tell when the restaurant peeps have good training and great attitudes plus the love in the food is generous - but I digress) for some great food and authentic diner ambiance.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/P-fvFrTCADb2ewop5iYfDg/168s.jpg", "caption": "Dinner for 2 beef and fish were fantabulios!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fUOnTC-RKQZBLOLzqz5XSQ/168s.jpg", "caption": "Capachino!"}]}}, {"review": {"des": "So delicious but not one healthy thing on the menu. If you're looking for amazing comfort food this is the place.", "pics": null}}, {"review": {"des": "We came here for breakfast, because their menu looked amazing- a lot of meat options as expected, but some other great breakfast like pancakes, fish tostadas and an entire vegan menu! The seats/dining tables were kinda tight, but the interior is lovely and has a diner feel to it. <br><br>Fish Tostadas ($14)-4/5 Three decent size pieces of fish tostadas perfect for 1 person or even to share if you're getting a lot of dishes. I really enjoyed this with the hot sauce. Everything was tasty- the tostadas and fish were crispy and this dish was loaded! <br><br>Hot Crab Dip ($12)-4.5/5 Crab dip in the morning?! Yesssss please!!! This delicious hot melty crab dip with simple ritz crackers was probably the best thing I had. The whole table loved it too!", "pics": null}}, {"review": {"des": "During a week visiting the Midwest, Little Goat provided me with my favorite meal.  Indeed, This Little Piggie Went to China may be the best thing I've eaten all year.  Little Goat gives you a low-key, informal, modern diner experience that's perfect whether you're dining as a couple or a large group of friends/family.  While some of the dishes step outside of the box, there are lots of classic, All-American dishes than even picky diners (or kids) will enjoy.<br><br>THIS LITTLE PIGGIE WENT TO CHINA<br>I adore southern food and Chinese food.  This Little Piggie is the perfect marriage of both cuisines.  While it's listed as a breakfast food this is a dish that can (and should) be enjoyed at any meal.  Heat, salt, and acid are all here.  There sauce is tangy and the gooseberries are sweet.  The eggs and biscuit add a rich, unctuousness.  This is a dish that you don't want to miss.  Words really can't describe the perfect combination of flavors that you get here. <br><br>GRILLED CHEESE<br>This isn't the traditional Cheddar or American grilled cheese your mom made you or that you can get at Denny's.  This is a full meal in a rich, delectable sandwich.  The bread is a hearty bacon gouda and the filling has a mix of goat cheese, cheddar, and guanciale (cured pork jowl) and jam.  It's a great mix of savory, salty, and sweet.<br><br>DRINKS<br>While the beer, wine, and cocktail lists aren't huge, Little Goat does offer a little of everything.  You can find a few local-ish beers (Goose Island, Bells), as well as some craft beer stalwarts (Allagash, Ballast Point) and even the Champagne of Beers (Miller High Life).", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5rxckotFRkDz9A-4Fvpluw/348s.jpg", "caption": "This Little Piggy Went To China"}]}}, {"review": {"des": "My family and I were in Chicago for a week to celebrate our daughters 9th birthday. We had eaten at Boka the night before we visited LGD, and I must say that our experience at the diner was just fantastic and such a welcome, and honest surprise. We are from Detroit/GP and don't have a shortage of restaurants presently, but nothing that matches , in my opinion the exactitude of simplistic perfection as this place does. <br>I'm unable to continue w out giving kudos to Justin our server. This young man was patient, kind, thoughtful and dutiful. As a matter of fact, when we are ready to purchase that darling townhouse on Halsted sp?, we will def give him a call.<br>We were so impressed that we cancelled our reservations at a storied Italian eatery the next evening to dine at LGD yet again. Upon arrival I was red in the face w embarrassment that I hadn't asked for Justin again, but the very capable Myshel was able to arrange he taking care of us again. We aren't timid when it comes to cocktail hour and ordered a few things to get the ball rolling. <br>Justin, after dropping cocktail and beers, returned W a sandwich that thankfully my wife turned her nose up at. My daughter Abbey and I dove straight in and were flabbergasted at the perfection of this pork cutlet Korean slaw concoction!!  The wifey couldn't stand our looks of amazement and continued to dive in and eat the other half on her own. Much to our dismay. <br>We met an Alex/Adam Schifrin upon our second visit and this young man was a wonderful ambassador for the brand. I implored him to contact me should his lovely boss ever look toward Detroit as a possible spot for a restaurant. If so, I'm in like Flynn!!", "pics": null}}, {"review": {"des": "I've been here a few times during dinner time but I came here later than normal past 9pm for dinner.  We easily got seated inside.  I wanted to try the crispy chicken sammie which wasn't available so I ordered the jap chae with a goat burger added on. <br><br>I ended up getting the wrong order so I had to wait for my order. I don't mind waiting for food but JP our waiter was joking around with us and nice which was a nice distraction for my loud stomach groans. <br><br>The jap chae was a different take on the original version and the glass noodle was more brown and seasoned. It was a bit more seasoned than my liking but it was delicious.  I'm glad I got the goat burger which was topped with a sunny side up egg. I would recommend the jap chae but I would add some protein. <br><br>With some of the wait JP treated us to a pretzel ice cream sundae amazingness. Having the mix of caramel,  crunchy pretzels was a perfect flavor/texture combo. I couldn't get enough and I'm glad I saved room for dessert.  Check out my picture! It was sooo good I would come by just to have it!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_VIRhqPeBNWMSzrRwWN-dg/348s.jpg", "caption": "Save room for dessert this caramel pretzel dessert is amazing!"}]}}, {"review": {"des": "This place is good--and I mean, really, really good, you should try nearly everything on the menu, this place is worth nearly any wait or expense--but the pupusa is a landmine in the middle of paradise. <br><br>When it came out it looked as appetizing as everything else. When I bit in, the chihuahua and blue cheese masa was devastatingly pungent and distinctly unpleasant, with zero chihuahua and only the bluest, reekiest blue cheese in it. I passed it around the table to see if I was crazy and my colleagues agreed that it was extremely overwhelming and ruined the dish.<br><br>In short: Get here! Eat here! Just not the pupusa.", "pics": null}}, {"review": {"des": "There are so many gluten free options here. They have a separate gluten free menu that you should ask your waiter for. They have in-house made gluten free bread! I got the Pulled Pork Sammie. Very flavorful but the pork was a little tough.", "pics": null}}, {"review": {"des": "Oh my goodness.  Please go and go hungry.  The staff is super nice and helpful with wavering decisions.  Get the fat Elvis and you will not be upset.  Yes...I ate the entire thing!!!  So so good and wonderfully balanced.<br>All three of us enjoyed something different but I do have to say that the fat Elvis was the best!!<br><br>You will have to wait likely so allow some time to enjoy the surroundings and chat with friends!!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/skbk3FHW9wA7u89ygQxjYg/348s.jpg", "caption": "Adorable goat!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PQN7By35SsO5h0OVydOYJw/168s.jpg", "caption": "What was left of the fat Elvis..."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/WDLQmQ3LkImcQHM-GSHr3Q/168s.jpg", "caption": "Fat Elvis - so yummy!!"}]}}, {"review": {"des": "I came here based on the many great Yelp reviews and am glad I did. Making a reservation on their website was easy and saved us from waiting for a table during the lunch rush. <br><br>I wasn't feeling that adventurous and ordered the Bull's Eye French Toast which was as good as it looked in the pictures. What's there not to like? It's fried chicken and strawberries over brioche. My only complaint was that they drowned the toast in maple syrup.<br><br>Definitely check this place out if you're looking for a good brunch place with great service.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/tHdBiW6PKpx-nq9vyH3DZw/348s.jpg", "caption": "Bull's Eye French Toast"}]}}, {"review": {"des": "I met a friend at Little Goat on a weekday morning and we had a great time. Considering the wait is typically a few hours, it was lovely to walk in and have the place mostly empty. <br><br>I ordered the Bull's Eye French Toast and it was the perfect combination of sweet and savory. I've really had never anything like it, and their menu was full of unique dishes that I'd love to come back for. <br><br>If you're in the West Loop neighborhood and can avoid the wait, I'd highly recommend Little Goat for a fun brunch experience.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/hw6fozY7USdDMhLLon20fw/348s.jpg", "caption": "Bull's Eye French Toast"}]}}, {"review": {"des": "Ambiance: Think classic brunch vibes! Beautifully decorated. <br><br>The food: Fun. I ordered a fusion paratha, which was a twist on a classic Indian dish. My friend ordered the French toast and it was equally delightful.<br><br>Watch out: The weekend wait can be upwards of 40 minutes. We got there around 11 which seemed like a little early then peak brunch hours. I would suggest the attached coffee bar and checking out the little merchandise wall while you wait. The parking in this area is valet or meter. The best bet is to find a meter.", "pics": null}}, {"review": {"des": "Great find! I loved everything I ate from the eggs to the pancakes. All four of us were very impressed with the fresh ingredients and taste.  I give this a major  up.", "pics": null}}, {"review": {"des": "Note: this review is really only for the service as the food was excellent. If you can get a reservation, go with a bunch of people so you can all try as much of the menu as possible. Seriously excellent. (To be expected since it's an Izard restaurant.)<br><br>Point blank, our server was very bad. It took her forever to greet our table, took her forever to get our drinks, our drinks came in all random orders, our food came out of order when we specifically asked for certain things to be appetizers, and some things that we ordered never showed up. All the while, the waitress walked around with the haste of a slug. It was very frustrating to be sitting there, waiting on service or food, to see her walk without any urgency. I say this having been a former server myself and having served during peak hours (similar to when we visited Little Goat).<br><br>Unfortunately, I can't recommend this place if you're on a time limit because it was just that slow.", "pics": null}}, {"review": {"des": "I wasn't super hungry when arriving at Little Goat Diner, yet somehow the food was so good it enticed me to eat still!<br><br>I was in a large group that shared several dishes including:<br><br>Nachos (delicious, though with fried and therefore greasy chips)<br>Spanish omelette (had chips that were more like chilaquiles than just chips)<br>Bibimbap breakfast bowl (the cauliflower rice was good even though it wasn't like a normal bibimbap)<br>Caesar salad (good with a unique, homemade house dressing) <br>Fish tostada (yummy and fresh)<br>Tempura mashed potatoes (amazing amazing amazing please get this)<br>Hash browns (very thin and crispy, with cheese. Yum)<br>Mac and cheese (probably my favorite item of the night)<br>Asparagus side (too much seaweed on certain bites, though good if you get a bite with the right proportions)<br>Broccoli side (delicious) <br><br>Overall it was a very pleasant experience! The restaurant vibe is casual but still nice. It is decorated well and the waiters were kind. We had made a reservation since we were a large group and even then, we had to wait a bit. It wasn't my favorite restaurant I've ever been to, but it was definitely delicious and a great place to visit.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wxM5eNWTCxZzshhtq8TTaw/168s.jpg", "caption": "Lil Caesar"}]}}, {"review": {"des": "We made a reservation so I'm not sure how long the regular wait would be. Looking at the menu I was a little apprehensive because the asian/ American diner fusion are so vastly different I didn't know if it was actually tasty or overhyped for its creativity/being the little sister of the Bib Gourmand rated restaurant The Girl & The Goat.  The Hot Crab Dip is popular so we got that as the appetizer, and the Shrimp and Pork Belly entree. Both were superb. We got these foods because we came for dinner but definitely would like to try their breakfast/other menu items- but based on my experience I think all of their food will be yummy despite how it might read on paper. Service was awesome too! Truly a 5 star experience.", "pics": null}}, {"review": {"des": "If you're looking for a must-have breakfast/brunch in Chicago, this is the place. Had a wonderful experience from the food, to the ambiance, to the service. I am partial to all of the Chicago \"goats\", but this place just drives my point home even further. <br><br>Will come back every time I'm in Chicago!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/810mv6xQgVY57msetPjm2g/348s.jpg", "caption": "Excited for breakfast!!"}]}}, {"review": {"des": "Little Goat Diner was quite underwhelming and not worth the hype. We went on a Friday morning -- it was busy but the wait wasn't long. Unfortunately, we waited almost 20 minutes to be noticed by a waitress (in a different section! Not even our own..). She apologized for the wait and moved us to a table in her own section. Not a great start, but ok.<br><br>The food however was what sealed the less-than-mediocre deal. My friend is dairy free & tried ordering the little piggy went to china. The biscuit has cheddar and there were no substitutions... seemed silly. Couldn't they just give her a different bread? They have a dairy free menu, but she wasn't excited about any of the options. Instead, she opted for eggs, toast, and bacon. They brought out the bread pre-buttered!! (That's not dairy free..).<br><br>I ordered the breakfast \"burrito\" with avocado and bean salad. It was not at all what I expected. Very soggy naan with an egg, tons of avocado, and a few beans sprinkled. It was very bland and had hardly any hot sauce. I don't normally complain about avocado because I love it! But... an avocado and bean salad should have more than 10 beans in my opinion. The ratio was just very off. <br><br>The boozy drinks were just ok. <br><br>Would not go back or recommend.", "pics": null}}, {"review": {"des": "This place is super good for breakfast. Finally came back and came with the team and ordered a bunch of delightful breakfast items. Everything was delish. My favorite- pigs came to China and Elvis waffle. Check out my pics. Trust!!!!", "pics": null}}, {"review": {"des": "Perks of eating alone = no wait! For the most part anyway. Decided to stop by here on a Sunday around noon and the place was definitely packed but I snagged up a counter spot no problem.<br><br>Ordered:<br>Piggy went to China ($14)<br>Pork belly fries ($7)<br><br>I usually don't like biscuits since they're normally dry but these biscuits were sooo crispy and delicious, especially with the oils and sauces they put with it.<br><br>The pork belly fries were more like smashed potato pieces with pork belly. definitely delicious.<br><br>Would rec'd (and with a reservation if you're not gonna be eating alone!)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/YbP9gFSSYdeTTv9jqWinKQ/348s.jpg", "caption": "Receipt"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1wRCTwsZ8KVJ9QE4cfaHJg/168s.jpg", "caption": "Pork Belly Fries $7"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pL7WlM5vq4dyvRFAwrD2YQ/168s.jpg", "caption": "The Sausage on the Piggy went to China"}]}}, {"review": {"des": "Little Goat is a neat and trendy restaurant in Chicago. My friends and I found ourselves checking it out after seeing the amazing reviews on Yelp, and doing some quick googling to see what the hype was all about. After all of this, we had really built the place up and had pretty high expectations. <br><br>When we arrived at the restaurant, it was close to peak brunch time, and we suffered the consequences! The place was packed and even the foyer was chock full of eager patrons. We were given an approximate wait time of 1 hour. After putting ourselves on the waitlist, we headed to Bombobar across the street and a nearby coffee shop to occupy ourselves in the meantime. (I will say that the automated waiting system that notifies you when your table is ready is fantastic.)<br><br>We actually ended up getting spots in the restaurant about 25 minutes early, which was appreciated. There's a lot of cool stuff on the menu, interesting combinations and some rather intricate items, so step outside your comfort zone and try something new!<br><br>Now for the not so great... Because it's so packed, Little Goat Diner has a large section of communal seating, and it's very tempting to take these seats as it decreases your wait time. However, we found that the general atmosphere of the restaurant is super loud, and the mechanics of sitting at a large communal table make it rather difficult to have a coherent conversation with the people in your party sitting across from you. Additionally, we found that though the food was interesting, and cool, the taste really wasn't that great. 4.5/5 for the hype and vibe, 3.5/5 for the food quality. <br><br>Overall, Little Goat Diner is certainly a cool place to eat, but in a big city like Chicago, I think it's worth it to look for other options.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BI52C300ZRvcALkue2nB5Q/348s.jpg", "caption": "Smoked Fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Gp7yNp5-mk7-A8ZMPnOsfA/168s.jpg", "caption": "Okonomiyaki"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vtSTN7jeC48RRs3A1uWUrA/168s.jpg", "caption": "This Little Piggy went to China"}]}}, {"review": {"des": "This place is delicious! Stopped by for lunch, and I was delighted! Big portions that we definitely could not finish at reasonable prices. <br><br>I had the chickpea salad with fried chicken I added. Fried chicken was delicious but not necessary. The salad has chickpeas as well as a softer falafel like ball as well. Delicious dressing and sauce  on the side if not enough. I added a biscuit($3) which looked big enough for two. Also had the sparkling rose($12) so good! <br><br>Additional recommendations:<br>Pancakes <br>Cake is the day <br><br>Only hiccup was that I booked through yelp. When I arrived they had no record of me booking on file. If you book through yelp you may want to call and confirm. <br><br>Also love that it's female led!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/efQRi0ozn1_dSF8D3QSJQA/168s.jpg", "caption": "Menu! Serving breakfast all day"}]}}]}