{"name": "lou-malnatis-pizzeria-chicago", "reviews": [{"review": {"des": "Best deep dish ever. Hands down. You've got to go with the Chicago classic of sausage & butter crust (even if you're not a huge sausage fan). I was never into sausage on pizza (or otherwise) until I tried it here!! <br><br>**Don't ever skimp out on the butter crust. Best $0.75 you'll ever spend.", "pics": null}}, {"review": {"des": "The winner between Giordano's and Lou Malnati's... Lou Malnati's!<br>***<br>Locals  <br>Locals actually go to the pizzerias every tourist goes to! This tells you something!<br>***<br>Travelers <br>If you come to Chicago, you have to get deep dish. That usually means Lou Malnati's or Giordano's!<br>***<br>My Recommendation <br>Giordano's was more cheesy and Lou Malnati's was more saucy. I prefer Lou Malnati's! You might want a bigger size than the personal pan we have or share a larger one!<br> <br>IG: @foodisseur", "pics": null}}, {"review": {"des": "hmm was a little disappointed but probably just personal preference...<br><br>As a new yorker visiting chicago, I was actually very excited to once again try deep dish.<br><br>my friend and I shared the MALNATI CHICAGO CLASSIC and the \"LOU\".<br><br>The Lou was just too soggy due to the too many veggies I think. The Chicago Classic was much better and enjoyable but I was still underwhelmed as the pizza crust was just not crispy enough.<br><br>I'm sure lots of chicago natives vote Lou's as there favorite for deep dish but mine fave is elsewhere...", "pics": null}}, {"review": {"des": "If it was based on the deep dish pizza alone, Lou Malnati's would get a 3 for me. Despite this place being the OG and most popular deep dish spot in Chicago, I just wasn't too fond of it. For two, we ordered The Lou in small ($18.25) and the Trio of Dips and Pizza Chips ($10.50). I'd definitely recommend an appetizer since the deep dish takes about 45 minutes.<br><br>The trio of dips and pizza chips was the absolute best decision ever. Get this, you won't regret it! (Actually, your stomach might regret it when you need to unbutton those pants) But seriously, this appetizer is what I'd give Lou Malnati's a 5 stars for! The crispy pizza chip were like a soft pita chip that held all the dips very well. They were all topped with its own herbs, spices, and chopped tomatoes too. But the real winners here are these dips: roasted garlic, artichoke, and giardiniera-topped hummus. Wow, each of them were so delicious and flavored with my favorite being the artichoke dip for sure. I was honestly satisfied just having this dip and chips already.<br><br>As for the deep dish pizza, the Lou was a combination of spinach mix, mushrooms, and sliced roma tomatoes covered with blend of mozzarella, romano, and cheddar cheese on garlic buttercrust. I think the veggie toppings were not exactly my favorite choice, especially with sliced tomatoes on top so I was already a bit put off. As a cheese lover, I found that the cheese was too excessive and stringy as well. I only had one slice and had to call it quits.<br><br>When it comes to deep dish pizza in Chicago, everyone has their own preference and favorites. Lou Malnati's has the most simple menu with a more cheesy factor in theirs over the rest of them. But for what it's worth, I'd totally come back for the trio of dips and pizza chips!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RMRh3VClaL6DNwf3Yi69Kw/348s.jpg", "caption": "The Lou Pizza (small)."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/6gyZgcVhC1R2hfqqGwXWPw/168s.jpg", "caption": "Trio of Dips and Pizza Chips."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/qfLgVE59_BhNEcPIJQgMEg/168s.jpg", "caption": "The Lou Deep Dish Pizza."}]}}, {"review": {"des": "THIS WAS THE BEST PIZZA EVER. I didn't know that Lou Malnati was a chain pizza restaurant. I thought it was going to be a pizza take-out. But no, it's a sit down.<br><br>The Malnati Chicago Class. Small. Made with Lou's lean sausage, some extra cheese and vint-ripened tomato sauce on butter crust. We ordered a size small and each of us had a quarter of a pizza. The pizza was so thick! One quarter of a deep dish pizza was enough to make all of us full! The crust was so thick and crispy and crunch. The pizza was full of cheese. There were large pieces of sausage in there. The tomatoes were really fresh! Our waitress told us that the way to eat deep dish pizza was to eat with a knife and a fork. And so we did!<br><br>Pros:<br>-best deep dish pizza<br>-fast service<br>-day with fork and knife<br>-chili red peppers and Parmesan cheese make it more bomb<br><br>Cons:<br>-None! Just so filling <br><br>Tip: even before it opens, call ahead of time about 45min before you come to pre order your pizza. It takes 45min to make it so you don't have to wait the extra time when you get there", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fLjOdz4owlL31lHwMod_Uw/348s.jpg", "caption": "Fried calamari"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mTFm8Q8joh4N18YIdVkKuA/168s.jpg", "caption": "The Malnati Chicago Class."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/1JlQa-PyzWp3S-XUa5yujw/168s.jpg", "caption": "The Malnati Chicago Class."}]}}, {"review": {"des": "Surprisingly good!! I say surprisingly because I've never liked Chicago pizza but I realize it's because I never had a legit one!!! I can now say I love Chicago pizza (if it's from Lou's). Super filling so come prepared! <br><br>The flaky crust is delicious, the cheese then goes on top of that, then the sausage patty (literally covers the full surface of pizza), and then the chunky sauce goes on top.  The cheese is so stretchy and goey. Yummmm <br><br>The wait can take a bit but easy to order a beer at the bar and wait around. Makes it go by faster.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OadmU5MXeO1-950zglB0jw/168s.jpg", "caption": "Omg!! The original deep dish pizza. So good!"}]}}, {"review": {"des": "Deep dish pizza really isn't for every pizza lover. I love pizza. But not Lou Malnati pizza. It was my first time having deep dish and I didn't understand the hype. The long line at the door. Or anything. <br><br>3 stars because the service is reaaaaally nice. Also, they let you order your food the same time they put your name down for a table. The pizza takes 40-50 minutes and that's how long the wait is for a table so it makes sense. <br><br>The curly fries were bomb. And the guy dressed as a dinosaur giving out the food was hilarious and the highlight of my dinner. <br><br>If I were a deep dish pizza lover I'm sure I'd like this place. But I'm not. So I don't. ‍", "pics": null}}, {"review": {"des": "Delicious deep dish Chicago pizza. A.MA.ZING.<br>I ordered the classic Malnati's pizza and added Pepperoni. Also ordered the fried calamari to enjoy as an appetizer while the pizza was being made. We were told it would take 40 mins for the pizza to come out and it really was 40 mins. Worth every minute though. The pizza was not that cheesy, had a huge full layer of sausage and then topped with delicious pepperoni slices made for heaven on a plate. The service was also very friendly and attentive. I would come back the next time I'm in Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JPC1zqgfF9su4_AXdcramQ/168s.jpg", "caption": "Malnati Chicago Classic + pepperoni"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Yj53cVDkbCym8PgtBYZs0w/168s.jpg", "caption": "Calamari (~$10)"}]}}, {"review": {"des": "Came in around 4 pm on a Sunday and was seated immediately with a party of two. We chose the small classic deep dish pizza. The waitress warned us it may take about 45 min to be ready and it did take the entire time! <br>The pizza was very good! The crust was amazingly crunchy and definitely the highlight of the pizza. There is a thick layer of cheese, along with sausage and pizza sauce. I wish that it could have been a little warmer so the cheese would have been more gooey and maybe a little more sauce. The small was actually the perfect amount for 2 and we were incredibly stuffed afterwards.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mSx9WdLPzYcGffyteU9A8g/348s.jpg", "caption": "Classic deep dish"}]}}, {"review": {"des": "Traveled from out of state, wanted to see what all the hype was about for their deep dish pizzas.  Here's my outsiders perspective:<br><br>Got \"The Lou Deep Dish Pizza\"<br>Spinach mix, mushrooms and sliced Roma tomatoes covered with blend of mozzarella, Romano and cheddar cheese on garlic butter crust.<br><br>It was loaded with all kinds of things that the ingredients start falling off from gravity as soon as you pick it up.  The breading it not super high, what makes it \"deep\" was the insane amount of cheese and toppings they put on top.  <br><br>We got the Large ($20.45) which is supposed to feed up to 4 people.  It came out with 8 to 9 slices and we were ALL full after ONE SLICE.  They pushed for us to get an appetizer since \"each pie takes an hour to make\" but decided to wait so we didn't spoil our appetite. We were STARVING by the time the pie came out, but believe me- one slice was MORE than enough. <br><br>Glad we didn't waste money on an appetizer.  But don't come if you're wanting to try a slice quickly, they WILL make you wait! And that 1 Hour+ wait can test your patience.  We went on a Saturday night at 10:30 PM and the place looked less than half full and the wait was still an hour, can't imagine waiting if the place was actually busy. <br><br>Parking was a beast.  Ended up parking in an open lot after driving around downtown for 30 minutes. All the parking in the area was about $15. Ridiculous, but night be cheaper than an uber going to and from downtown if you think about it. <br><br>I tried it once, and that was good enough.  Definitely not a flavor I would crave but appreciate the experience. It was pretty good though.", "pics": null}}, {"review": {"des": "Although I am not a huge fan of deep dish in the first place, I liked Lou Malnatis way more than Giordano's. The mozzarella sticks and deep dish veggie pizza were delicious. They had a good selection of craft beer. Just beware it is always VERY crowded with a long wait which can be slightly overwhelming.", "pics": null}}, {"review": {"des": "Hmm I know that deep dish pizza is a Chicago staple. And Lou Malnati's is as well, but I simply wasn't impressed. Tbh, I've had better deep dish pizza in SF - yeah, I said it. <br><br>The wait staff here was great. The appetizer came out in a timely manner. The waiter suggested their play on \"nacho\" app to keep us going bc the pizza would take 40+mins to make. AH. That's an absurdly long time. <br><br>In the end, the app was okay...and he didn't warn for how large it would be so we chowed down and were nearly full by the time the pizza came. Again, the waiter was great allowing us to go halfsies on putting meat on only one side since I'm the only non meat eater here. With the small veggie (and added half meat), it came out to two slices per person. The immediate slice was good - not great. And within minutes, the cheesiness was no longer that ooey gooey goodness that I was hoping would last throughout my first piece at the very least. <br><br>In the end, we each only ate one slice. Took the other two to go. They were really great about individually boxing our slices to-go too! <br><br>Personally, I probably wouldn't return. It's just not my thing. But the staff is great. The food takes a longgg time. And the pizza was okay. 3 stars.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/mpENk6t8NZfY-DM0nuUaww/168s.jpg", "caption": "Trio Dip Appetizer (very large)"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Tr6jYTELlvH_iGcsJnBiMg/168s.jpg", "caption": "Small - Lou's Deep Dish (half with sausage)"}]}}, {"review": {"des": "Packed like crazy even around 5pm. You can preorder ahead of time here so that by the time you get seated your pizza will be ready! <br><br>I tried their Lou Malnati's salad, cheesy bread, veggie deep dish and regular deep dish pizza. The salad was normal.., and the pizza was thinner than I expected in that the crust was still pretty tall but the toppings seemed less than other deep dish pizzas. I really enjoy the sausage that they put on the pizza. Absolutely delicious! And the customer service here was amazing. <br><br>In summary, normal pizza, phenomenal sausage, and great customer service.", "pics": null}}, {"review": {"des": "TIP #1: on weekends (fri-sun), go before noon to avoid any waiting (your food will still take the 30-45 mins tho)!<br><br>TIP #2: sign up for their email/newsletter and get a free app as a welcome!! Saves you around $10 and an app and a medium pizza should be plenty (and more) for three people! Oh you have two weeks to use it tho!!<br><br>Reviewing just the food, we ordered the trio of dips and pizza chips (app) and a medium half old, half new deep dish (Malnati's and Lou's). The trio dip was actually really good- pizza chips were coated in a tomato, buttery spread and the roasted garlic dip was delicious! The artichoke dip was way too buttery (?) or oily for me.<br><br>The deep dish itself was beautiful. The Malnati's is basically a thick layer of mozz cheese, an equally thick sausage layer, and tomato sauce. The sausage is flavorful and the tomato sauce was chunky! The Lou's is perfect if you like a more vegetarian option- lots of spinach at the base, then mushrooms, sliced tomatoes, mozz, and cheddar. I liked the amount of toppings in both BUT they were way too cheesy for me. It was my first time having deep dish so it might be typical, but I'd be wary if you also don't like cheese. Lastly, the crust had a good crunch! <br><br>LM's is a great place to try at least once, with nice servers, restaurant space, and tasty and original pizza, but I personally don't need deep dish anytime soon in my life (sorry!)", "pics": null}}, {"review": {"des": "OMG.. best Chicago deep dish pizza ever! I've tried a lot of deep dish in the Bay Area and I can see the imitation Chicago deep dish in the Bay Area can not compare to the actual Chicago pizza. Now let's describe this piece of heaven. <br><br>First is the crust. The crust isn't your regular chewy dough. It's a thin crispy buttery crust. They first layer it in really good mozzarella cheese than the sausage. Now the sausage isn't your typical little round balls of sausage that most pizza place use. It's a diff type of sausage. It's actually a whole giant pizza size patty sausage that they layer it on top of the cheese. So there's sausage with every bit you take. The sausage isn't salty like most sausage we use here.  It's so much better than that. <br><br>Next the last layer which is ripen whole tomatoes made into a nice chunky sauces. Most deep dish I've tried is usually tangy but this was perfect. Not sweet not too tangy. It's the perfect pizza sauce from heaven. Combine those four and you get the perfect best Chicago pizza ever! The bonus part is that I microwaved it the next day and it is still as good with the crust staying crispy. <br><br>So my final input is ...there is such things as a happy place.  I think I came pretty close in moving here for their pizza. Lol.", "pics": null}}, {"review": {"des": "This place has amazing Chicago style \"Deep Dish\" PIZZZAAAA!  <br><br>Being a native NYer that has newly relocated to Chicago, it seems like a casserole tbh, but wow, is it a delicious casserole!  How could it not be?!<br><br>These deep dish pizzas are created with LOVE.  I cannot get over the simply delicious FRESH tomato sauce that bursts \"fresh picked from the vine\" flavors over every tastebud in tandem with the Fresh Wisconsin  Mozz melted to pure perfection.  Our one & only tweak from the classic deep dish is to make the crust \"well done\" as we like crust a bit crispy, and the addition of FRESH Basil.  That's it!<br><br>This household enjoys Malnati's so much that my husband & I have gone so far as to dub Monday's - Malnati Monday; as we have had it weekly since moving to Chi-town.  That should say it all.<br><br>We have sat in-house once, as this place is a total mad house.  There is always a rather long wait (think hours) and while the wait staff attempts to be efficient, and helpful, it's pretty difficult in tandem with the volume they have.  As a result, we choose to order take out from the Malnati's app, as their delivery charge is $4.  Ooof.  Just know that if you do order take out, be sure to arrive 10-15 minutes after their pickup time, as its wrong 99% of the time & you end up waiting amidst the crazy chaos.<br><br>Pro tip:  Try the amazing LIMITED EDITION \"Italian Combo\" while they still have it!  It's lean sausage, Italian beef, topped with \"Chicago Style\" spicy hot giardiniera & tomato sauce.  It's a happy place :)<br><br>Overall: Go for it.  Try it at least once.  You'll never look back at your sad, unhappy tomatoes - from what used to be your go to deep dish pizzeria.", "pics": null}}, {"review": {"des": "Okay so I'm on a work trip in Chicago for three days with one mission- Deep. Dish. Pizza. <br><br>Needless to say I checked the box with Lou's. Expect to wait. People wait, once your seated things rock and roll. <br><br>Went on a Thursday around 6:30-7pm. Checked in at the host stand, put our name in for a table, told a 45 min wait. Went to the stand next to it and ordered our pizza in advance- we were advised that this is how they do it. This way the pizza has time to cook so you don't have to wait another 40 mins. It's timed with the table seating! Just pizza is preordered everything else is ordered through the waitress at the table. <br><br>Then we went to the bar to hang out and had a few beers. Thank god they have a bar. <br><br>30 mins later got a text that we were ready!<br><br>Seated, drinks, ordered a salad, then the pizzas arrive. For 3 people we got a medium classic and personal of the other go to one. PLENTY OF FOOD. One slice and we were full.<br><br>Crust was crispy and buttery and totally delish.<br><br>Great service, good food. Definitely worth the stop.", "pics": null}}, {"review": {"des": "This is one of my favorite pizza places in Chicago. We get it both delivered and eat on premise. Our clear favorite is the deep dish \"Lou\" with sausage added. <br><br>We added the Calamari last night and it was tender and tasty. Include a glass of Chianti and you have a perfect evening with family and friends.", "pics": null}}, {"review": {"des": "Yaaaaay Chicago deep dish!!! I was waiting for this and was not disappointed. My friend ranted and raved about it so we had to get some. We both ordered a personal size deep dish, I ordered the veggie pizza and he ordered the pepperoni ($32-ish). It was around 4:30pm when I placed the order online and the earliest pick up was 6:30pm. Sheesh! So we walked down from Springhill Suites at about 6:30pm. It was about a 10 minute walk, but I think we took the long way. <br><br>When we walked in it was chaos. People everywhere either waiting for tables or waiting for pizza. I couldn't even get a good look at the place but I did see that they had some outdoor seating in addition to tables inside. People dining in were being told it would be an hour wait just for pizza once they got a table. Wow! Glad we ordered ahead. <br><br>When we got back to the hotel, he was shocked that the personal size was so small and the crust wasn't really that deep. I wasn't surprised, although my pizza seemed a little more deep dish than his, maybe because I had more stuff on mine. It was so good, the sauce, the veggies, the cheese! I will say although I ate the crust, it didn't have any flavor to it. Maybe that's why they offer a butter crust option? Anyways, I will be back here for sure!!!", "pics": null}}, {"review": {"des": "Zaaaamazing deep dish pizZA here! We walked in around 7:00pm on a Thursday, and the entrance was extremely congested. People had no where else to stand, but to crowd by the tables by the front. Lively atmosphere, but not romantic or intimate at all.<br><br>We were seated at 7:40pm, which we were happy about because it only became more crowded with people waiting for tables. Bar seating was scarce. Our waiter came by with waters, introduced herself, and explained the menu. Appetizers, Minestrone soup, salads, deep dish pizza, and thin crust pizza. We took no time to decide. The menu was easy to decipher. <br><br>For an appetizer, we chose the Spinach Stuffed Bread. It was enough for three people, but anymore and we would have ordered an additional appetizer. Marinara sauce came with, which added some bold tomato and herbie flavor. The bread was thick and the cheese stuffed inside was thicker. All three of us agreed that this appetizer was definitely. very. appetizing.<br><br>We ordered the medium \"classic\" deep dish, which had sausage. The medium feeds three people, but we could have ordered the small for the three of us. We ended up leaving with pizzza leftover, which no complaints!  The deep dish itself was so filling, cheesy, and full of luscious sausage chunks. The sauce itself wasn't too acidic or tomato tasting. The crust was my favorite part- it almost tasted like a pastry. Not sweet, but buttery and soft. Not greasy at all! We all ate one piece and called it quits; amateurs, I know. <br><br>Our server was so friendly. And if I stopped right there, I'd rate this review a four star. The circulation of this restaurant is horrible. Our waters were only filled once during the beginning and once during the end. It took awhile for our server to give us our check and even longer to give it back. I watched our server take our check, serve a different table food, then another table their drinks, then finally returned with our check. The table next to us sat down before us and waited longer than us to get their check. It's busy, I get that. But for a popular restaurant, there should be more of a flow.<br><br>The food is great. I wouldn't eat it on the regular because it's so heavy. But, it's a great representation of deep dish, if you've never had it. The service is two star- I've had better. The atmosphere is four star- so lively and fun, but overly crowded. I do wish there was more space in this restaurant or a bigger entrance to wait in.", "pics": null}}, {"review": {"des": "Be prepared for a long wait...but it's worth it. If you're gluten free or keto, note that there is an option to get your favorite pizza toppings on a lean sausage crust (comes with red sauce and mozzarella). It is more filling that you might think--my husband and I shared a medium and had plenty of leftovers, would definitely order a small next time.", "pics": null}}, {"review": {"des": "I got to try three pizza places while visiting Chicago, and Lou Malnati's probably has my favorite sauce. The sauce is slightly sweet with a hint of garlic. We ordered sausage with the pizza and the way they flatten the sausage, you got sausage in every bite. I love that every bite is consistent with the last. <br><br>Even though it's a chain, it didn't feel as commercialized as another competing chain in the area. I'm a fan!", "pics": null}}, {"review": {"des": "PIZZA TIIIIIME!!! This was my first visit to Chicago so I'm no expert but this was the best Chicago style pizza I've ever had.<br><br>They've got their service down to a science to expedite your order and I appreciate that.  It's take about an hour for them to bake up the hottest pies north of the river.  So to minimize wait time they have you place your order while you're waiting for a table.  It was a 15-20 min wait for a table on Friday evening, not too bad. Once seated we we're served drianks ans appetizers/salad.  Shortly after our pizza came out. It was seamless.  You can tell they've been doing this for awhile, expertly executed. <br><br>First up was the Malnati salad.  It was much more satisfying than your typical pizzeria salad.  There was these crispy bits of salami, mushrooms, diced tomatoes and a light vinaigrette dressing. <br><br>We went with Stuffed spinach bread for our appetizer.  Even though  it took up space and left less room for pizza, this is a must order item.  The crust was covered in garlic butter and a sprinkle of Parmesan and the inside was loaded with gooey cheeses. <br><br>THE PIZZA<br>Malnati Chicago classic was  made with sausage, some extra cheese and vine-ripened tomato sauce on Buttercrust.    I was expecting sausage crumbles but here was actually a layer of sausage. Very tasty and not too greasy surprisingly. <br><br>\"The Lou\" add pepperoni was bursting with flavors from the Spinach mix, mushrooms and sliced roma tomatoes covered with blend of mozzarella, romano and cheddar cheese on garlic Buttercrust PLUS I added those pepperonis.  This one was my favorite of the two.  Added just a bit of roughage in to break up the brick of cheese I was eating. <br><br>I must say that Chicago style pizza is not my favorite style but they executed it well and for that they must be commended.  Great work guys.  Your pizza and service is awesome!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Xc9B6zKRh9fnkF_VY5Uvew/348s.jpg", "caption": "Stuffed spinach bread with a delightful crispy garlic crust served with warm marinara"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/iRV_webjV3l2_bZ5iUWeSQ/168s.jpg", "caption": "\"The Lou\" deep dish add pepperoni."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/H2wFzxEatLTFkhMN9TLa-w/168s.jpg", "caption": "\"The Lou\" add pepperoni and \"Chicago Classic\""}]}}, {"review": {"des": "Never been a fan of deep dish pizza. That's because I've never eaten here. This has all of the qualities one loves of the thin crust pizza. The buttery crisp crust, the quality sausage and the fresh vibrant texture of the sauce each of which stand out individually on their own with deliciousness. Combine them all like they do here? Winner!", "pics": null}}, {"review": {"des": "Okay, so I've had Lou's before, not at this location last time I was in Chicago like 4 years ago. This location seemed to be super popular and got real busy around lunch time. You go in and out your name down. The wait was about 25 minutes, on a Sunday, for 3 people. You can then actually put in your order as well before you get a table which was nice. Once your table is ready they text you. Overall the logistics worked well.<br><br>Once we got seated we ordered the Lou without mushrooms. When we got our pizza it was covered in mushrooms and it was barely luke-warm. I think it would have been better if it was hot but the cheese wasn't even melty like a pizza should be. I was definitely disappointed as I had been looking forward to this pizza for sometime. Not sure if it was the location, how busy it was or the pizza itself...", "pics": null}}, {"review": {"des": "My favorite. The first time I had it, I went into the restaurant and ordered and waited the typical 45 minutes or so. Totally worth it.<br><br>However, being the impatient person that I am, I appreciate the fact that they offer delivery of personal sizes with customizations so I can eat this alone in the comfort of my hotel room.<br><br>I have had Pequod's and found it comparable. The number of locations and convenience of Lou Malnati's is why it gets 5 stars and is my go-to when I visit Chicago.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/vp22Pl_saGKAOwETpo7q1g/348s.jpg", "caption": "Pizza next to me at the hotel"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WKx4ntbAi7Inl68RulS7aQ/168s.jpg", "caption": "More pizza selfies"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QFJlNe_pAGgeEu-hEytikw/168s.jpg", "caption": "So good"}]}}, {"review": {"des": "I came here twice while I was in town, the second time because I got a personal pizza previously and it wasn't quite what I was hoping for. I think the deep dish here is good. But nothing really to write home about. It's a nice place to have a dinner with family or friends though. I do remember that their sauce is very wine-y which is hit or miss.", "pics": null}}, {"review": {"des": "Lou Malnati's! Say that 3 times fast! Alright, that deep dish sausage is where it's at! There was no wait to sit down, but just know that it takes about 40 minutes to cook that deep dish! We ordered a small deep dish and a couple of beers and an Arnold Palmer. I've made it a mission to try as many local beers as possible...although I don't remember what I had... I think it was a gose. But we're not thinking about that - let's get to it - the pizza was filling and very flavorful. Deep Dish Pizza is definitely its own animal and great enough to stand on its own as a meal - a legit italian meal with all of the glory that is comprised of the crust that contains the sausage, cheese, mushrooms and sauce. I must say that the sauce was very good. <br><br>I can't help but feel that when I return to Chicago, I will be back here to have more to enjoy only to compare it again with the other place I went to...", "pics": null}}, {"review": {"des": "The best pizza in Chicagoland. No else compares. Being the best place that makes Chicago pizza, that would make this place the best in the world, being in Chicagoland. Skip the rest of the items, and go straight for the Chicago Classic. And if you're daring, try The Lou, and add it with the Malnati Salad. You'll want to look up copycat recipes for the Malnati Salad like I did soon after. <br><br>My family and I have been going to Lou's for almost 20 years now. It's insane how the taste has been the same all this long. I can't imagine going anywhere else for deep dish.", "pics": null}}, {"review": {"des": "Visiting Chicago and decided a must is the deep dish pizza. I got the malnati special. It looked a bit saucy but tasted delicious. The best crust I ever had. Got the hot wings too. They were good too.", "pics": null}}, {"review": {"des": "First deep dish in Chicago-<br><br>Tip of the day: Go to the bar, find some seats, and order the deep dish at the bar! It'll save you that 1 hour wait! <br><br>We did and didn't have to wait in that ridiculous wait right smack in the middle of lunch. We even got some beers in us while waiting for the deep dish to come out- which usually takes about another 45 minutes. So if you waited in that line, then ordered you'll be looking at 1.5-2 hours before eating...<br><br>They have personal deep dish and some lunch specials. We both got personals just because I wanted my own and my own toppings. I got a pepperoni deep dish (no butter crust) and my BF got a sausage, olives with a butter crust and a side of those pickled peppers. We split half and switched it so we can try both. I just thought the deep dish was ok. The tomato sauce was too sour- like it wasn't cooked down enough, and cheese was pounded on (not completely melted- so you get big chunks) and not enough pepperoni. Few slices... Also the crust was super hard. Was not too big on their deep dish. Or maybe we ordered the wrong size and it was made differently? <br><br>Place is iconic for deep dish though since you have to try when in Chicago. We tried another Chicago deep dish place (Peqoud's) and that blew our minds! But still come here to compare! And it's like one of the godfathers of traditional deep dish. We don't regret coming here and enjoyed the atmosphere!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XVsspW_S5z3qXCDat8tN7w/348s.jpg", "caption": "Deep dish personal"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4SqIqicdDx4CfL2sIXGwLw/168s.jpg", "caption": "Pizzas"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/12p9uDp1xbVENCvU9eM_7A/168s.jpg", "caption": "Personal pizza"}]}}, {"review": {"des": "Oh the agony...<br><br>What a wait!  <br>With a line down the block and maybe an hour wait until you're seated, you're going to get HANGRY.  So plan accordingly because you're also going to have to wait another 45 mins to an hour after you order because it takes some time to bake the pizza too.<br><br>With all that said, listen...you're in Chicago so you got to try some deep dish pizza and if you love pizza as much as I do, you'll wait and wait....and then wait some more....until someday and someway you'll finally be seated.  Idk if its the best ever, but its pretty good.  <br><br>It comes out fresh of course, its fully loaded with all the toppings and ingredients, and it has a BUTTER crust....yummm.  So it is definitely going to fill you up.  Its different of course than your standard pizza and kind of hard to describe.  The crust is crumbly?  <br><br>But anyway, this pizza is thick!  I've never had pizza with a fork and knife but thats what people do here lol.  Definitely recommend it for the pizza lover in you. <br><br>Buon appetito!", "pics": null}}, {"review": {"des": "Came here around 11am on a Saturday in case there would be a wait.  Restaurant was mostly open but filled up by the time we left. Got the calamari as an appetizer and it was amazing! Pizza was really good - nice crunch on the crust and the sauce was well-balanced.  Enjoyed the Lou (vegetable pizza) more than the classic (sausage); the Lou has cheddar which I thought enhanced the flavor whereas the sausage wasn't as much as a favorite.", "pics": null}}, {"review": {"des": "The best Chicago deep dish style pizza I've ever had!! We ordered the signature Deep dish Pizza Large good for 3-4 people as they advertised. But i think even a 5 people would still feel full ordering the large one. We opt for a to go as our hotel is close.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/p2U88m0sIOHT0tjNC-K7Sw/348s.jpg", "caption": "Pizza sizes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/VbdphtRt3Ssd0fXc7lZG5A/168s.jpg", "caption": "Bar"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1O_Vziqm79KeXal708tVJA/168s.jpg", "caption": "Slice of their signature deep dish pizza"}]}}, {"review": {"des": "We arrived for an early dinner on a Sunday night and by the time we left, the crowd outside was bigger than the crowd inside. It takes 45 minutes to bake so I highly recommend ordering while waiting for a table so there is less wait once you are finally seated. We did order a Malnati's salad and all the \"stuff in it\" made for a very tasty bowl of roughage. <br><br>Prompt and friendly service, plan your time accordingly if you're dining in. In this tourist's opinion between Malnati's and Giordano's, Malnati's wins. The crust is more flavorful and I think has a better texture - and less dry. Don't get me wrong, that stuffed pizza is good but if I had to choose between the two - BUTTERY CRUST #ftw", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AGqegYJSec4cQmbGACXa9Q/348s.jpg", "caption": "Malnati Salad - soooo good"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L3vfLrkkjaAhS7-S6tQ9YA/168s.jpg", "caption": "There are more people waiting outside than eating inside. 6:30ish on a Sunday"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/itIzskoizgD3BoKs6RU6nw/168s.jpg", "caption": "Deep dish"}]}}, {"review": {"des": "Everything was very good. <br>Long wait time, but efficient and friendly service all around.<br>Pizzas lived up to our expectations but didn't blow us away.<br>Would recommend, but now having tried it, wouldn't necessarily make it a priority to come back and might try some of the other pizza places next time in Chi-town.", "pics": null}}, {"review": {"des": "I was looking so forward to deep-dish pizza on my visit to Chicago and wish I was leaving a better review.  Unfortunately, I just can't, but I will note that this review is for this particular Lou Malnati's location.  Maybe others are much better.<br><br>My main issue is that we waited almost an hour during non-prime hours (3pm) only to receive a pizza that was cold.  Why were we waiting so long and starving when our pizza had clearly been sitting out and cooling off for quite a while? With all the cheese in this pizza, there was simply no way to really enjoy it at the temperature where the cheese has formed back into a solid hunk.  <br><br>There were definitely service issues in this location as one waiter tried to drop off food that wasn't ours, and then our bill at the end reflected chicken wings (an order for only $9.99) instead of our pizza and drinks.  We were tempted to just pay the bill we received after the cold food and bad service, but moral values won out and we called the waitress's attention to it.  <br><br>As we were visiting from out of state, we wouldn't be back either way, but I do find it amusing that I can get WAY better deep-dish pizza in Berkeley, CA than at this Lou Malnati's.", "pics": null}}, {"review": {"des": "My girl and I decided to try out Lou Malnati's Pizzeria first since it was a 6 min walk from our hotel. We were seated in 3 minutes. I decided on the small Classic Malnati's and my girl chose the personal size \"Lou\" with a side salad.<br>The order was placed at 2:50pm and the pies arrived at 3:40pm<br><br>First bite was ok but as I dug in it got better and better. I'm a thin crust pizza kinda guy but I enjoyed eating this with a knife and a fork. The pizza tasted very fresh and not oily. The crust was buttery and perfect! It was interesting seeing a huge sausage patty surrounding the pizza instead of the traditional sausage balls I'm accustomed too. <br><br>Overall a great experience for my first classic deep dish Chicago pizza. Just plan on waiting at least one hour for the pies.", "pics": null}}, {"review": {"des": "I've been to Lou's twice now and both times have been great.<br><br>I recommend this business to family and friends.<br><br>If I'm in Chicago and looking for some authentic deep dish this is generally where I end up. The pizza is really good, it's conveniently located downtown and there are several locations too!<br><br>I've had deep dish at 3 different places that were all recommended by different people I know who grew up in Chicago. If my experience at these different places taught me anything, it's that Lou's serves some legit pizza.<br>Something I feel I should mention is that these pizzas are a lot of food. So far I have never been able to finish one in a single sitting. I'm okay with that because it's just more for later!<br><br>I have ended up here every time I have been to Chicago and will keep coming back!", "pics": null}}, {"review": {"des": "Stopped by yesterday around 530 for a quick bite. Surprisingly there was no wait time. Out server was super awesome. He kept checking on us and made jokes here and there. I asked for two oranges in my blue moon and that was the running joke for the night. It made dinner just a little more interesting. <br><br>We ordered mozzarella sticks to start with. We've had these beige so we know what they taste like. Unfortunately this time they were slightly over done and burnt. One of the pieces didn't have any cheese in it.<br><br>We shared a medium thin crust pizza. It came out about 25 mi it's after we ordered it which is much better than the usual 40 minutes it takes. The pizza was really good. There was more cheese this time than usual but I wasn't complaining I love cheese. <br><br>Overall good food and service!", "pics": null}}, {"review": {"des": "I am from the northeast. I prefer NY style pizza, above all others. This did not change after visiting this place, but it was indeed delicious deep dish pizza. I ordered the single serving \"Lou\" which is made with several mixed veggies, including mushroom, spinach, and topped with tomatoes.   I was still a bit hungry after the single serving pie. Overall, I recommend it and would go back if I was in the area.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/g9WifjzI4zTct4w624hDIQ/348s.jpg", "caption": "The \"Lou\" (don't mind the excessive crushed red pepper)"}]}}, {"review": {"des": "A zillion years ago, I was a server.  And I still have bad flashbacks of parents feigning obliviousness as they let their angelic little moppets rip up sugar and cracker packets on the table. Or of desperately trying to be perky when I woke up feeling like I hated the world.  This is all to say that I have a huge amount of empathy when it comes to wait service issues.  But what we encountered here, definitely pushed that tolerance to the limit:<br><br>Long story short, hubby, kid and I knew going in we'd need to wait around 45 minutes for our pizza.  But then an hour went by.  Then 15 more minutes, and still, no food.  We finally flagged down our server who mumbled something about the kitchen being backed up.  Another 20 minutes or so and we'd pretty much had it.  Hubby insisted we speak to a manager who finally got to the bottom of things.  Our server apparently had forgotten to put in our order.  Then when she finally remembered, she dropped our finished pies on the floor. She neglected to share any of this and kept trying fake us out.<br><br>In the end, it took TWO HOURS for our order to arrive.  The manager comped our meal, offering us an app and dessert, too.  We took her up on the former.  We were hangry by then!  <br><br>In spite of the torturous wait, I cannot deny that I dug the pizza.  We got one with cheese and jalapenos, plus the Chicago Classic with Sausage.  The latter, in particular, was delicious.  For the three of us, we shared two smalls and still had leftovers.<br><br>Bottom line:  Ultimately, the manager redeemed the situation and the deep dish was good.  So four stars it is.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/j0_87kB8pnYlnBmwIfVoow/348s.jpg", "caption": "My bf is so Deep. He's a real Dish, too!"}]}}, {"review": {"des": "Loooooong wait, huge crowd, totes worth it! I love Lou's since the first time I had Chicago pizza I fell in love. It an actual pie. Two slices and you're out! Don't worry about how many people are standing outside waiting patiently, they have a good system you order your pizza while you wait for your table. All in all will go again in a heartbeat!!", "pics": null}}, {"review": {"des": "Not a fan of deep dish but I love Pequad's. The crust here isn't as good, neither the thin or their deep dish... <br><br>It's popular and famous...every friend who visits from out of town wants to go here...we just meet them after they eat their pizza now..haha..", "pics": null}}, {"review": {"des": "When in Chicago, do as the Chicagoans do and that means deep dish pizza! Lou's is a staple of Chicago and there are a bunch of locations throughout Chicago. If you're planning to come here, expect to spend quite a bit of time here because each pizza is made to order and takes anywhere from 45-60 minutes. If there's a long wait, you can place your order while waiting for a table so your pizza will come out as soon as you are seated.<br><br>We had a mishap when we went here. The runner delivering our pizza didn't cut it properly and when he was trying to serve us slices, it fell flat on the table. Luckily, the manager, Matt, came by and took care of us. He was apologetic and got us another pizza within minutes. We were apprehensive because we didn't want to wait another 45 minutes for a replacement pizza but he said he stole another pizza on the assembly line. It wasn't the exact same as our order but it was close enough.<br><br>Anyhow, the pizza was great! Don't be one of those people that eats deep dish pizza with your hands or you'll look like a total fool! We got the Malnati Chicago Classic and it was fantastic. The way the cheese just melts over the pizza is terrific. The Buttercrust was phenomenal and crisp! I didn't care too much for the sausage. They just stick a giant sausage patty over the pizza which doesn't really sit well with me. <br><br>Aside from the serving blunder, Lou's always lives up to expectations.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/oezcir3Z3qFBt-7zCzVoaA/348s.jpg", "caption": "The Malnati Chicago Classic Pizza"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/pi-Oj79qEY8LdFDw3ZVBeA/168s.jpg", "caption": "The \"Lou\""}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LerAsFI9kk5cIOjUSd3LDw/168s.jpg", "caption": "The Malnati Chicago Classic Pizza with olives"}]}}, {"review": {"des": "I just love this pizza!  This was my first visit to this location and it did not disappoint!  Our waiter Anthony was great, forewarned us that pizza can take up to an hour to be made.<br>We started with the house salad and had the Lou for dinner.  It is always cooked so perfectly, with fresh toppings, hit the spot!  A must eat when in the city!  Wish we had one back in Detroit!", "pics": null}}, {"review": {"des": "When you are in Chicago you have to try deep dish pizza right? And no, not just any kind of deep dish pizza, it has to be Lou Malnati's deep dish pizza. <br><br>Waited an hour and a half to get a table and another 45mins to get our food (the food are made to order). Was it worth it? Yes! I ordered deep dish cheese pizza with sausage, pepperoni and jalapeño toppings. The crust was to die for! Crispy and buttery. Also ordered sangria to pair with my pizza.<br><br>Our server, which I forgot the name already (lol) was very nice. She kept coming back to our table to give us an update on our order and made sure we had everything we needed.<br><br>Definitely recommend Lou Malnati!", "pics": null}}, {"review": {"des": "Not bad.  I got the personal sized pizza.  It wasn't too big.  Fairly tasty.  It took 40 minutes, which might be understandable for a huge deep dish, but I felt like this was a bit on the small side to take so long.  If you're into deep dish, everyone raves this is the best pizza in Chicago.", "pics": null}}, {"review": {"des": "We ate their classic Deep Dish pizza with sausage and added pepperoni (it was very meaty).<br><br>It was great, and great tasting. The sauce had zest to it and the meat had good flavor.<br><br>The service was fast. We got seated right away. Sean, our server, was very attentive and just right. Our pizza came quicker than we thought it'd be so that was another bonus.<br><br>We'd definitely come back again.", "pics": null}}, {"review": {"des": "I really enjoyed lou malnatis pizza!! This is only my 3rd week living in chicago and im glad i was told about this place. Although ive tried the infamous Giordanos deep dish pizza as well, I like to have options so im happy about this restaurant. <br><br>My group got there right before the lunch rush so we got in right away. We ordered one extra large thin crust pizza, half cheese and half peppers. I will say that i didnt expect a thin crust pizza to take an hour to cook, but its okay. <br><br>When we got the pizza, i grabbed a cheese slice and it was deliciousssssss. I love how much sauce and cheese there was on the slice. And i overall just liked the pizza a lot. The only reason for 4 stars and not 5 is because im not crazy about the crust. Im a huge bread/crust gal so i love when theres a fluffy crust on my pizza. This crust was more flakey? It wasnr bad but i definitely do prefer a more bread-y crust. Ill definitely be back.", "pics": null}}, {"review": {"des": "First pizza experience in Chicago. Early dinner got our party of five in minutes. On the way out there was a hefty line. <br><br>We ordered a deep dish and cheese sticks to tide us over. Don't be in a hurry, deep dish took about 40 minutes...but worth the wait. Best. Pizza. Never had deep dish and here you are. So delicious. The sauce is on top and big tomato chunks, a layer of sausage, cheese and buttery crust. Large was 7 slices of amazing. <br><br>Great hostess and wait staff. <br><br>Can't wait to have a bite of cold pizza in the morning.", "pics": null}}, {"review": {"des": "This was my first time ever having Chicago's famous deep dish pizza and although it's a must-try for anyone in town, especially the famous Lou Malnati's, I don't think it's stunning given its price and wait time. This might be an unpopular opinion but Deep Dish Pizza wasn't really anything special in taste and fulfillment. It's just unique.<br><br>When I came with one other person, we split a small size (serves 2) with half of their Classic and half \"The Lou.\" We enjoyed the food and thought it was definitely good pizza, but for the size and $20 in addition to waiting 45 minutes for the pizza to come out, it probably isn't always the best option. I strongly suggest it for the experience but am not sure I would come back again.<br>On a positive note, their Calamari was great. They came in nicely sized pieces not like some restaurants that come back small and crumbly and they had a nice amount of squid in each piece as opposed to just breading.<br><br>No problems with service and the environment (wasn't especially busy) but I think the hype for deep dish in Chicago creates higher expectations for when you actually eat it.", "pics": null}}, {"review": {"des": "It was my first time trying deep dish pizza and the best experience ever! You have to come early and check in to have a place in line for a table. You can also order ahead of time so when your table is seated you only have to wait 20 minutes for your pizza. We had the half The Lou (veggie) and half the Chicago Classic (sausage). It came out so hot and fresh. The crust is amazing. I also love that the crust doesn't get soggy with all those toppings! Definitely have to come here for pizza whenever you're in Chicago! Service was great. The environment def feels like a small family owned pizza spot! I would recommend 10/10. Thanks for the wonderful experience Lou Malnati's!", "pics": null}}, {"review": {"des": "If you didn't try a deep dish pizza while in chicago, we're you really there?<br><br>I have to say the deep dish pizza (Malanatis sausage special) was very tasty but definitely hearty. I also got the Lou's special thin crust pizza with spinach mushroom and spinach and it was delicious. Both pizza was butter crust which was very tasty, that's coming a lot from a girl that hates crust... on anything. <br><br>The calamari was amazing because I finished the whole entire plate.. okay I shared it. I wasn't that selfish. <br><br>Stop by and give their pizza a try when you visit Chicago.", "pics": null}}, {"review": {"des": "Worth the wait! It was about two hours from the time we put our names down to when we got our pizza, but every bite made up for it. The place was absolutely packed, so I was thankful that we could pre-order our pizza and simply get a text when our table was ready. That actually gave us time to do more sightseeing along the river while we waited, which was nice! <br><br>The \"Chicago Classic\" is the best deep dish I've ever had. From now on, Lou Malnati's is a Chicago-must-have every time I'm here.", "pics": null}}, {"review": {"des": "The price is good. <br>We ordered dinner to our hotel room since it was too windy to go out. There service was amazing. Lovely. <br>The tiramisu is a MUST. so delicious. Ceaser salad delicious. <br>The deep dish was delicious too. I wosh they had the option of whole wheat bread as a crust as well. <br>Highly recommended.", "pics": null}}, {"review": {"des": "Best pizza ever.. I definitely recommend! Keep in mind This is coming from a fatboy .", "pics": null}}, {"review": {"des": "This has to be hands down one of my favorite food experiences. When I ordered the cheese bread, I was not expecting cheese, spinach, and tons of yumminess to ooze out. It was beautiful! The Chicago-style pizza was also delicious; it was much better than anything I've had back home in Texas. Service was great, and our waitress was helpful. The ambiance was casual. I would definitely return.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/o1KurSoBYsvjq8TsCwHgEw/348s.jpg", "caption": "Spinach cheese bread"}]}}, {"review": {"des": "So.  I nust revise my initial review.  Please note we visited this locale 1 year later and found EVERYTHING to be exquisite.  The gluten free pizza was excellent, as were the wings and tiramisu.   Huge portion, btw, of tiramisu.    Pizza was piping hot and so gosh darn tasty, I recommend it to all regardless of allergies.  Nice job !", "pics": null}}, {"review": {"des": "Having friends from Chicago they always insisted that I check out Lou Malnati's as it was their favorite deep dish pizza place.  Plus having been  to Giordano's before it was time to finally settle the deep dish champion argument.<br><br>Giordano's vs. Lou's is a pretty sensitive topic as friends from Chicago are pretty adamant on either Giordano's or Lou's being better and it is split pretty evenly.  <br><br>We arrived at Lou's and although there was a wait to be seated, they let us order our pizzas right away as they take some time to cook.  We just had some drinks at the bar and when our table was finally ready our food came pretty quickly.  <br><br>We started with the calamari which was pretty good but the stars of the show were definitely the pizza.  We were a party of 3 and ordered 3 medium pizzas which was pretty much enough for like 10 people.  I had the Malnati Chicago classic but i added some pepperoni, mushrooms, and hot giardiniera.  All I can say is WOW so freaking amazing.<br><br>Although it is a deep dish pizza, it is definitely not as thick as Giordano's which has an extra layer of dough on top.  Giordano's is more of a stuffed pizza vs. Lou's which is more traditional.  I prefer Lou's as I don't need to be eating another layer of carbs.  Lou's crust is soooo buttery awesome as well.  <br><br>I let my friends take home the plethora of leftovers and they had pizza for days.  I was very jealous as I could have eaten Lou's for a week straight.  <br><br>Overall Lou's did not disappoint and for me wins the deep dish crown.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Fp5LGo1s6lCkO-y01rxL6g/348s.jpg", "caption": "Malnati slice"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kz5qhronERq3e2mPr4Dwlg/168s.jpg", "caption": "The Malnati Chicago Classic Pizza with pepperoni, mushrooms, & hot giardiniera"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Akj-aOpsYUsGjKCd9SUJbQ/168s.jpg", "caption": "Cheese Deep Dish Pizza"}]}}, {"review": {"des": "Definitely start with the calamari. I smelled it while waiting and was t disappointed. The pizza however wasn't as good as my last visit. <br><br>Let me be very clear, our server was fantastic. Three of four pizzas came out and she was so apologetic. However this wasn't The Chicago pizza that I was expecting nor the Chicago style pizza that I had heard it was. And to be clear, the pizza wasn't bad. It was just not as good as other Chicago style pizza is that I've had while visiting the Windy City.", "pics": null}}, {"review": {"des": "Everyone recommends Lou Malnati's if you want authentic deep dish pizza that Chicago is known for. We got here just before the dinner rush so we did not experience the long lines. It takes 45 minutes for your pizza to cook, regardless if you get thin crust or deep dish. We started with the calamari which was good, but the pizza was a little underwhelming. The deep dish is so bready and filling it's hard to eat a slice without feeling sick. Service was also not the greatest. I would however give it another try next time I'm in town due to all the rave reviews, think we just got them on an off night.", "pics": null}}, {"review": {"des": "This is my 4th visit to Chicago and I have eaten a deep dish pizza every time. Quite frankly, I was never impressed but that was in the days when I asked the hotel staff for recommendations instead of using Yelp.<br><br>We were in a time crunch to make our 7PM jazz performance. Our choice was wait 55 minutes for a table or get a take out pizza in 40 minutes. We got the small Malnati Chicago Classic $16.25 to go. Waited at the bar and scarfed our pizza as we walked the 4 blocks to the jazz venue. I'll just say that this was an awesome pizza and it changed my opinion about Chicago pizza. Crust, meat, cheese, tomatoes... it all worked well together. I still like thin crust pizza better but if you are in Chicago, you must eat here. Check it out.<br><br>Listed in Drive Across America: <a href=\"https://www.yelp.com/collection/4_4-FCUBHEQBq43u7DXRig\">yelp.com/collection/4_4-…</a>", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cxskVRzxCWsS5VRGk6p_7Q/168s.jpg", "caption": "Menu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/efvK8GIofrjbQZK0o5OD2w/168s.jpg", "caption": "Small Malnati Classic $16.25"}]}}, {"review": {"des": "I came here during lunch time on Friday. I apparently came at the right time because there was no wait, but when I left there was a wait. <br>I ordered the lunch special which was a personal deep dish (sausage) pizza and a side salad for total $11.10. I thought it was plenty of food- I couldn't even finish it. My first thought was that the pizza is very small, but don't let your eyes deceive you- remember that it is deep dish and there is some body to that pizza.  <br>I find that this restaurant's sauce is a sweeter tomato sauce than to the other comparable \"popular\" restaurants. I liked the flavor. I'm also no expert since I've tried a handful of deep dish pizza places - just my opinion. <br>This sauce is also thicker with a chunkier tomato in/on the pizza. <br>Personally, I thought the crust was rather tough for my liking. Maybe my pizza my didn't meet my expectation since it was a personal size and I couldn't get the full \"deep dish\" experience. I just couldn't get anything larger since it was just me.<br>The service was really pleasant I will add.", "pics": null}}, {"review": {"des": "Sadly this just didn't hit the spot. I heard that this was a good place to go to get a vegan version of the famous Chicago deep dish pizza so we gave it a shot. <br><br>Before even getting to the food, we had one dirty fork and one dirty butterknife at our table. Additionally, there was a little black spec in my water. Cleanliness was an issue here.<br><br>According to their website, their regular crust is vegan, but not the buttercrust. We ordered the veggie without any cheese with their regular crust. I wasn't impressed. I've had vegetarian versions with real cheese and vegan versions with vegan cheese in the Bay Area that I liked much better. Maybe they just don't know how to make this version well. <br><br>I'd heard so much about Lou Malnati's online but maybe this location isn't as great as the others. I don't recommend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4ZyZNeK9kcHHmnbIeQdc8w/348s.jpg", "caption": "Cheeseless Veggie Pizza with Regular Crust (Vegan)"}]}}, {"review": {"des": "For me this is the best Chicago Deep Dish Za, it's pretty much the same as it was 20 years ago!  They have a great online ordering system & you don't have to talk to ANYONE to place your order which I love.  I always get the butter crust and their hot giardiniera baked INTO THE PIZZA is a must!  Delivery is usually prompt and DO NOT get the pizza cut or it will be soggy.  I always order from the Lincoln Park location, don't order from the North Center location.  Don't forget to tip! Talk later", "pics": null}}, {"review": {"des": "Still my favorite deep dish in Chicago Amazing flavor and so so good  The Loy Malnottis salad is my favorites with the fried pieces of salami really makes it work Pizza butter crust is the way to go and I usually try and call ahead so the wait isn't that long", "pics": null}}, {"review": {"des": "Deep dish pizza with butter crust... Yes Please! Lou Malnati's is a Chicago deep dish pizza chain that bakes their pizzas fresh on order. Lines are long and the spot is touristy with ton of people flocking over to grab lunch or dinner. Classic Malnati with cheese, sausage and a butter crust is the way to go. Follow thier recommendations on sizing, the pizza is very heavy and one slice will easily fill you up. It's a bit on the pricey side but worth the cost especially if you're visiting chicago.<br><br>Protip: call before hand and order or ask how long the wait will be.", "pics": null}}, {"review": {"des": "I was in town for the weekend and everyone I talked to kept telling me to get pizza from Lou Malnati's so that is what I did. <br><br>My boyfriend and I ended up ordering online and picking up which was the smartest thing we could have done. The line was about an hour and 15 minutes wait on a Sunday at 7PM. I had never seen so many people willing to wait so long for pizza. We were able to walk right in and pick up our pie, no wait. <br><br>I was not disappointed. The pizza was great and one piece filled me up so we had plenty of leftovers which justified the high price. Now I can say I have been to Lou Malnati's and that's really all that matters.", "pics": null}}, {"review": {"des": "Deep dish pizza is a classic Chicago experience.  If you are visiting Chicago, this is the place to go for deep dish.  Be prepared for a long line as the place was full when I went there on a Friday night and my guest and I were 33rd in line when we got there.  The line moves quickly, but 33rd means you are waiting.  You have the option to pre order your pizza.  Since deep dish takes 30+ minutes to cook, this is a good idea so you aren't waiting once you get a table.  The restaurant is very good with their timing so they get the pizza cooking before you are seated but isn't done until you are seated so it comes out quickly and piping hot.", "pics": null}}, {"review": {"des": "I'm very picky about my pizza. This was the best pizza I have ever had. I don't think it's like traditional pizzas like a giordanos, but that is why I loved it so much. <br><br>The cheese is good mozzarella that actually strings. Then the layer of sausage which is so good. The sauce is excellent. The best part is the crust it's buttery and so amazing.", "pics": null}}, {"review": {"des": "This was the first time eating here. Been to Chicago a few times now. Want to try all the different Pizzeria in town. We are here on Friday night and the wait was not bad at all. We were unaware of how crazy it can get here. But we got a table for two in about 20 minutes. <br><br>Pizza was really good. I can't complaint about my visit.  Services was great. Our server Philip really took the time to talk to us and explain everything.  <br><br>Long story short, I would came back again.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/UK3-9Sikyc77sAdNXp5K6g/348s.jpg", "caption": "First time here! Let's see what it is all about!!"}]}}, {"review": {"des": "If I could leave a two worded review, it would be 'butter crust'.<br><br>Lou Malnati's is my favorite Chicago deep dish pizza! And the butter crust is mainly why I love this pizza. When you are eating such a heavy and hearty pizza, the soft, buttery crust compliments it so well. I love to order the deep dish pizza with sausage and giadinera which gives the pizza a nice spicy flavor. <br><br>I have tried their thin crust pizzas which were good but I prefer other restaurants thin crust. If you are a thin crust pizza lover, I would suggest other pizza spots in the city. <br><br>There has always been about a 30 minute wait every time I come to this location but the wait is worth the deliciousness about to come your way!", "pics": null}}, {"review": {"des": "This was my first time trying the deep dish pizza at this establishment, I went on a recommendation of a family member.  The staff are great and very attentive to any needs.  The dining room gets a bit crowded, the distance between tables is a bit short which made it a bit of a maze to get to the restroom.  <br>The ambience is that of a typical pizza restaurant, laid back and can be a bit noisy at times.  <br>The pizza is very good, the consistency of the sauce is a bit chunky so I recommend asking for additional sauce on your deep dish.  I tried both cheese and meat pizza here and preferred the meat pizza, the meat complimented the chunky consistency of the sauce better at this restaurant.", "pics": null}}, {"review": {"des": "When we arrived, the place was packed with people standing around the entrance, waiting to be seated. When we signed in to get a table, they told us we can preorder our pizza. We ordered the Malnati chicago classic, which is the deep dish with sausage and cheese. We waited 50 min to get a table. So when we got our table, we thought that since we preordered our pizza 45 min ago, it would be ready. But we waited another 45 min while sitting at the table before the pizza came. At first i was excited to finally try the famous chicago deep dish pizza. I love cheese. I was just hungry so first few bites, okay. After a couple bites, it's like chewy cheese on hard crust. The atmosphere is interesting inside the restaurant. Sports jerseys of famous players were framed on the walls.<br>I was unimpressed with the experience overall, but I am glad i finally tried the pizza in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/zD0D6WWOzEHRhFMyO5GcTA/348s.jpg", "caption": "Takeout box"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DY1x87fSomNrnjCGDcJnew/168s.jpg", "caption": "Jerseys on the wall"}]}}, {"review": {"des": "Visiting Chicago from New York and chose this as the destination to try deep dish pizza. The spinach stuffed bread appetizer was really, really good. The pizza, although good for what it was, to me, was underwhelming. Also - you have to wait 45 minutes for the deep dish, just as an FYI if you are in a rush! The service here was top notch.<br><br>Sorry Chicago, NY pizza is in a league of it's own!", "pics": null}}, {"review": {"des": "Deep dish pizza is a must when you are in Chicago, and Lou Malnati's is hands-down my favorite! My family used to go more often in the suburbs but the long wait time at the city locations make deep dish pizza primarily a \"when out-of-town friends are visiting\" treat. And because visitors usually come on weekends, we found ourselves in an hour-long wait on a Friday evening. It's not too bad since we anticipated this, but it's hard watching and smelling the yummy pizza pass you by.<br><br>As agonizing as it is, the food is always worth it! We ordered a large Malnati Classic deep dish (sausage and tomato sauce on their Buttercrust), a medium thin crust pizza with mushrooms, and a family-size Malnati salad (lettuce, tomatoes, black olives, mushrooms, salami bits, and gorgonzola cheese with vinaigrette and romano cheese) for our group of five. There was plenty to go around with a few slices of each pizza leftover. <br><br>Our server was extremely friendly but a tad bit absent throughout our dinner. We were able to pre-order our pizzas when we first arrived but I'm not sure it really minimized the wait time after we were seated. <br><br>Lou Malnati's is still my favorite deep dish pizza place but I would recommend planning your meal at an off-time to avoid the lunch/dinner rush.", "pics": null}}, {"review": {"des": "It's ok, as good as pizzeria uno in my opinion. Bar is  small and not good if you're looking for that, service is not what I would expect. Asked for a recommendation from bar tender several minutes later another patron asked the same bartender for a recommendation and got a totally different response. Food isn't bad like just not what I'd expect with so many yelp reviews. Writing this review cause I'm sitting at bar with an empty glass for the second time and not being offered another drink or given a check. <br><br>I value the service and really appreciate the time taken by the management to reach out an remedy my experience. Although I couldn't take them up on it they demonstrated they want every dining experience to be a great one. Next time I'm in Chicago I'm heading back to this location, thanks guys!!!", "pics": null}}, {"review": {"des": "Amazing!!<br>Pro tip though - don't get a personal pizza since it just doesn't taste the same as the small or larger.<br>Went with my boyfriend around lunchtime on a sunday. Only waited about 15 mins for a table which seemed pretty good.<br>We shared a small with half classic and half the Lou and added pepperoni for more protein (right brah?)<br>The Lou has mushrooms, spinach and garlic which gave it a lot of flavor. The classic was tomato-y with tasty sausage baked in. The cheese was melty and gooey (obviously delicious!). The crust was buttery and tasted like the best carbs i've had in a while! I wanted to try the chocolate chip cookie pizza but we were too stuffed (we had a stan's donut appetizer right before). Next time chicago!<br>All and all, I'd say Lou's delivered! Seemed to be the one all of our uber drivers recommended as well.<br>For the pie and 2 sodas it was only 28$ which seemed like a great deal as well. Will be my go to for deep dish in chicago!", "pics": null}}, {"review": {"des": "When I come to Chicago I always stop in at Lou Malnatis for the classic deep dish pizza. It's great every time! You just can't beat Chicago deep dish pizza here. Highly recommend.", "pics": null}}]}