{"name": "pequods-pizzeria-chicago", "reviews": [{"review": {"des": "Carmelized crust and delicious deep dish pizza, need I say more? Yes, ok well here it goes. <br><br>They don't take reservations but the wait is well worth every bite. Coming here at off-peak times can be a huge time saver, plus the pizza does take at least 40 minutes to cook, so also keep that in mind. <br><br>The restaurant itself isn't the fanciest but don't let that fool you, it's a must try pizza and everyone from Chicago knows Pequods.", "pics": null}}, {"review": {"des": "We visited Chicago so of course we had to get some Chicago deep dish. The pizza we had was fresh and delicious but damn it took nearly an hour for them to come out. I ordered a personal size while hubby ordered a medium. A personal size was definitely more than enough for one person as it was very thick. You can pick whatever toppings you want but they do charge i believe $1.99 per topping. i wished our waitress had told us that before we went crazy with our toppings! <br><br>They have a good variety of tap beer on the menu that kept us entertained while we waited for our pizzas. Service was efficient. The place is like your typical bar restaurants, dark and loud. Overall, a good experience but nothing beats a NY slice IMO!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/arYMebQl2rPcxVYfu0Yy5A/168s.jpg", "caption": "Medium veggie pizza. good for 2 to 3 people"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ITsav0nijPFJe8CCc-FI5A/168s.jpg", "caption": "Personal pizza with onion, mushrooms and pepperoni"}]}}, {"review": {"des": "I love Pequod's. This is the spot when people are in town. It's conveniently close-ish and I love the vibe. It's like a bar...that serves awesome pizza. They don't take reservations, but they do have \"priority seating\" if you call/go online 24 hours in advance. I never know what time I'm going so I just do the walk-in method. It's not too bad and if you have a small group (2-3 people) the bar seating is first come first serve. They also offer a discount at their partner bar (Whale's Tale) while you wait (basically right next door).<br><br>The staff is nice. They're always on their game, but at a place that's busy...they have to be. Their menu is simple and just about everything I've had here is delicious.<br><br>The food:<br>Chicken wings - simple bar buffalo wings, but yet...so good (recommended)<br>Mozzarella sticks - simple, crunchy perfection of delicious cheese. Simple presentation, but who really cares - cheese sticks with crunch<br>Onion Rings - nice and deliciously crunchy, you get a decent (a lot) amount<br>French Fries - not going to lie, but these are actually pretty good and great for snacking on while you wait for your pizza<br>Pan Pizza - always delicious with a cook time of 40-45 min (which surprisingly goes by pretty fast when you're in good company). Get toppings per your own preferences. And OMG, the caramelized cheese on the crust is one of the reasons why people come here. I also like their sauce.<br><br>TLDR: oh yes, please go here. Definitely one of 3-5 places to check out deep dish pizza in Chicago. It's, so far, my top favorite place (I also like the area...some cool things nearby).", "pics": null}}, {"review": {"des": "This style deep dish is the thick crust pan style pizza, even though it wasn't the super cheesy topped off with sauce on top that I assumed all Chicago deep dish was this is still some really good pizza.<br><br>The restaurant itself is kind of a dive sports bar, lots of seating & lots of tv, a good variety of beers & appetizers to go with the pizza selection.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RHrSMq4PKCabFWvzxyO03Q/168s.jpg", "caption": "Thick crust style pan deep dish."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/fLKmN10eCTHdvdU5JfzCBQ/168s.jpg", "caption": "Fried appetizer sampler. Mozzarella sticks, zucchini, & mushrooms."}]}}, {"review": {"des": "Finally got to try Pequod's, service was a 3 and the pizza was a 5. To my taste, it was way better  than pizza's from usual Chicago chains. I went there on a  Friday around 2pm and was super happy to not have to wait hours to get a table. <br><br>Regarding the restaurant, it looks like a dark dive bar, nothing fancy. We didn't get explanation for the menu (it would have been appreciated). Basically you get to choose between 3 regular pizzas and then you can add as many toppings as you want (for an additional charge). I like they have a caramelized crust. You're going for a deep dish, so get your table before you're starving because it takes a long time to cook haha! as delicious warmed up in the oven the next day! I got a salad to wait, it was okay, it comes with a plastic cup of red vinegar and another one of olive oil, not the best one though. As far of the pizza, the ingredients were fresh, the dough was good and we got some to go! (We were so hungry we forgot to take a pic of it) I'll go back but probably to take out.", "pics": null}}, {"review": {"des": "Let me preface this by saying that I just don't like deep dish pizza. I'm a NY pizza guy and after trying a few pizza places in Chicago, I have confirmed that I am not a big fan. <br><br>I had higher hopes for Pequod since many sites talked about it being better because of the carmelized crust. Not really. You couldn't tell much of a difference from the crust.<br><br>The overall pizza was fine but it's something that you could only have one piece and then you're left feeling heavy. Also, it's hard to tell distinct differences between pizzas when it's deep dish other than the sauce.<br><br>This place is fine but probably not somewhere I would seek out the next time I'm in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n1P0qnulc6GkkLWFCDhOvg/348s.jpg", "caption": "\"Small\" pizza with mushrooms, peppers, mushrooms and pepperoni. Barely any peppers."}]}}, {"review": {"des": "First time having deep dish pizza!<br><br>Wonderful place -- didn't have to wait too long and the service was so nice! Gave us a great recommendation for pizza and was so friendly!<br><br>We got one of the custom deep dish ones and shared among three people. We got the smallest size and we still couldn't finish it. Would definitely say its a great bargain for the price and would warn you to not underestimate their food. We also shared some wings, which I loved as well.<br><br>Definitely recommend!", "pics": null}}, {"review": {"des": "I tried lou malnatis while in chicago and I preferred pequods<br>Lou malnatis fell short for me<br><br>but pequods was great<br>it was only about a 10minute wait<br>but a 40minute wait for the pizza to come out<br><br>the sauce was so good!! <br>and the caramelized/burnt cheese crust was great<br><br>got a large <br>and i only ended up being able to finish one slice<br><br>took home the leftovers but the pizza still tasted great after", "pics": null}}, {"review": {"des": "As deep dish pizza's go this one is one of the ones you have to try. Situated outside of downtown chicago it has more of a bar atmosphere than a pizza joint. Service was great as they explained everything and catered towards the table. <br><br>The toppings are what make this place stand out. The tomato sauce and all the fresh toppings you can choose from. The sausage is top notch. Spicey italian with great flavor. The pizza crust has more of a biscuit like flavor and texture so it's definitely unique to the area. Very filling even for the small size pan which can easily be shared with others.<br><br>Give it a try.", "pics": null}}, {"review": {"des": "Pequod's does not have any pre-made signature pizza toppings like the other popular deep dish spots; instead, all of their pizzas are customizable. With this said, they do not allow pre-ordering your pizza while waiting for your table (probably to ensure you don't skip town, but why would you?!) When my friend and I arrived at 6:30pm on a Saturday, the placed was completely packed. There was a 90 minute wait for us, but luckily we found two stools at the bar instead.<br><br>Since we knew how heavy the pizza was about to be, we started off with a house salad with italian dressing ($4.80). After over an hour later, our small size pan pizza ($11.75) finally arrived. We also added italian beef (+$2.75) and mushrooms (+$1.85) inside too. The pizza was nicely done and that first slice was delicious. All of the ingredients were stuffed into the cheese and marinera sauce being held together in a crunchy crust. As much as I wanted to finish both of my slices, I only got through my second slice halfway. <br><br>The special part about Pequod's is its customization (you can even do half and half on the pizza to make everyone in the party happy). But because of this, they also take much longer. Thankfully I was not too hungry or else my patience would have truly been tested here. Although Pequod's is a bit further outside of Chicago, it's still worth the trek over here --but I'd definitely recommend coming here at odd hours to shorten the wait time.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gXe7kr6eurPx1xbzgza_sQ/168s.jpg", "caption": "Small Pan Crust with Italian Beef and Mushrooms."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1NxqbKhcBv8z9rpYxwF1VQ/168s.jpg", "caption": "Slice of Pan Crust with Italian Beef and Mushrooms."}]}}, {"review": {"des": "Does Pequod's really need a 5,064th review? Probably not, but I still think the world should know about their delicious pizza. Let's start with that crust. I know everyone talks about their carmelized crust, but they must put crack in it because it's so good. I've had a variety of toppings and even their thin crust and was very pleased. <br><br>The restaurant itself isn't fancy, but that's not what you go to Pequod's for. Longer wait time if you go during peak hours, but the restaurant has two floors so that helps.", "pics": null}}, {"review": {"des": "During a weeklong work trip in Chicago, I knew my co-worker and I had to eat deep dish at one point during the week. I mentioned to our client that we were thinking of Lou Malnati's, and he basically persuaded us to go to Pequod's instead. In his words, \"Lou Malnati's is good; Pequod's is great.\"<br><br>We arrived around 8PM on a Tuesday, and the place was packed! We got a pager, sat outside to look at the menu, and our pager buzzed within a few minutes. Since it was just us 2, we decided on a small pan pizza with bell peppers and Canadian bacon as toppings (bell peppers were extra topping; Canadian bacon was half extra). Honestly I loved the fact that they offered half toppings because sometimes two people just can't get along! But in this case, my co-worker was vegetarian but I knew I needed some meat.<br><br>I know there's nothing like Chicago deep dish, and this experience reiterated that. I did feel like the crust was a little thick, but it didn't really change what I thought about the pizza. The crust was AMAZING!! I looked forward to that extra crunch with every slice I ate (I only ate 2).<br><br>We had zero regrets changing our plans from Lou Malnati's to Pequod's. The World Series was on, and it honestly felt like a place where the locals go. I would absolutely come here again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/erHpu9an6kXkBcTdDjcjAQ/348s.jpg", "caption": "Small pan pizza with bell peppers and half topping of Canadian bacon"}]}}, {"review": {"des": "Awesome deep dish pizza, atmosphere and if possible even better service!  <br><br>Called ahead and although they do not take reservations will take priority seating.  Good news there, it cut our wait from 60 to 30 minutes.  Plenty of room next door at the Whale Tail for a drink before dinner.  Beeper so we knew when table was ready.  <br><br>True Chicago style deep dish with a crisp bottom crust.  Delicious!  Staff was running but didn't miss a beat on low drinks and rapid refills.  <br><br>Appreciated the management sign on graffiti on the walls but only added to the ambiance of a unique location!", "pics": null}}, {"review": {"des": "To my knowledge there are pretty much three iconic Chicago foods, Italian beef, a Chicago hot dog and deep dish pizza.  Of the three, the pizza was the one I had the least interest in trying while we were in town vacationing.  I've had them in various forms before, at an Uno's franchise in NC, Lou Malnati's delivered frozen to cook at home.  You could argue that those are not \"original\" in one way or another but whatever...  I've always been underwhelmed.<br><br>Still, when in Chicago it seemed somehow wrong not to get deep dish one day so after a Cub's comeback win at Wrigley we went to Pequod's which was my choice after much Yelp research and a couple sightings on Food Network.  The draw to me was the ring of caramelized cheese around the top of the crust.  What an awesome choice it was and not just because of the delicious cheesy ring.  The entire pizza was outstanding. <br>The crust (thick but not too thick, crispy but not greasy) sausage and pepperoni (tasty and plenty of it) and sauce (just pure tomato goodness) made for a really, really good meal.  The ability to get personal sized pizzas made it easy for me to get the meat fest and my wife to get just cheese so no need to even compromise!<br><br>I guess you can call me a convert and Pequod's gets all the credit.  Oh yeah, we had some buffalo wings before the pizza and they were good as well.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/IlpHjFw5QKtWIDf23zZ5Ng/168s.jpg", "caption": "Not sure why you would pick deep dish without the cheesy crust that Pequod's delivers."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sBLRhcZHrUYDResPtY5f5Q/168s.jpg", "caption": "Sausage and pepperoni had a blowout on one side. No matter... Deliciousness"}]}}, {"review": {"des": "My faaave deep dish in chicago with an N of two. <br><br>The crust is super buttery and less soggy more crispy than other deep dish I've tried. Pizza pie was my favorite. <br><br>Pro tip, you can order take out and eat at the BYOP (bring your own pizza) bar and library across the street.  <br><br>If you're traveling to chicago and can only try one deep dish spot, this is it!!", "pics": null}}, {"review": {"des": "The last time I was in Chicago and had deep-dish pizza, I got food poisoning (thanks, Lou Malnati's!  Never again!)  <br><br>But, my cousin really wanted to try some Chicago-style pizza while we were in town for the Chicago Marathon, so I acquiesced on the conditions that 1) we only ate the pizza AFTER the marathon and 2) we ate anywhere BUT Lou Malnati's.<br><br>After doing some research, we settled on Pequod's and took a taxi over to Chicago's North Side to stuff our faces after finishing the race.  It was about 2 PM when we showed up and this place was PACKED!  Fortunately, we were able to grab a table for two immediately.  As an FYI: Pequod's bakes their pizzas from scratch, and since it's a pan pizza, it takes a bit longer to cook (about 40 minutes), so if you're HANGRY, it's better to call in your order ahead of time by phone.<br><br>To stave off the runger, we ordered a sampler of their Appetizer Combo, which featured fried mushrooms, jalapeno poppers, mozzarella sticks, and fried zucchini bites.  I'm not gonna lie, this was pretty unremarkable and not worth writing about, but we were starving and needed something to tide us over til the pizza arrived.<br><br>When our pizza pie finally got delivered, I could not WAIT to dig in!  Technically, pan pizza is different than deep-dish, but Pequod's pizza is still an experience you can really only find in Chicago.  It features a thick crust with slightly burnt edges (\"caramelized,\" as the restaurant calls it) and layers of cheese and sauce, with your choice of toppings piled on (we chose sausage, pepperoni, mushrooms, and peppers).<br><br>While my first experience with deep dish at Lou Malnati's left me unimpressed, I really enjoyed the pan pizza at Pequod's.  The crust was thick without being too doughy, and sturdy enough to hold up to all the sauce and cheese without becoming soggy.  The caramelized burnt edges added a nice crunchy texture.  The ingredients tasted fresh and they did NOT skimp on the amount of toppings!  The sauce tasted very tomatoey (in a good way) and not canned.<br><br>Also, this pizza is FILLING.  Two hungry dudes who had just run 26.2 miles couldn't even finish all six slices of their medium sized pizza.  So come hungry, and bring plenty of friends!<br><br>OVERALL: 4/5.  Skip the appetizers and go straight for their famous pan pizza.  It's rich, delicious, and worth every single calorie and clogged artery.  I'm sure both NYC and Chicago-style purists can agree that the pizza at Pequod's is darn good!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fTLvXfQTeL-M1hDRvbFSLQ/348s.jpg", "caption": "Medium pan pizza - sausage, pepperoni, mushrooms, and peppers"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/quwvGPXnVy6OYUA-NGCLyg/168s.jpg", "caption": "Medium pan pizza - sausage, pepperoni, mushrooms, and peppers"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ktvixpFx8Mf2FiUFNegI2A/168s.jpg", "caption": "Medium pan pizza - sausage, pepperoni, mushrooms, and peppers"}]}}, {"review": {"des": "Ordered Pequod's for delivery to our hotel after a long day of traveling. They estimated 2 hours for delivery but it actually came in 1.5 hours which was nice. <br><br>The pizza was just okay for me. I think I would like to try the thin crust next time. If I were a fan of deep dish, this would be great. They definitely don't skimp on the toppings which is nic", "pics": null}}, {"review": {"des": "Detroit style pizza disguised as Chicago style pizza lol. Pizza is really good thought. Definitely five stars for sure. <br><br>I called in my pizza and it still took every bit of one hour so be prepared to wait or call it in like I did. <br><br>Price: They have an amazing lunch special for 5-6 bucks that comes with a drink. I mean that is such a steal! Really good quality pizza for less that ten dollars. It's very filling as well. I was completely full of the person loan pizza special. <br><br>Food: they call it Chicago style pizza but this reminds me a lot of Detroit style pizza. When I think of Chicago pizza I think of Lou malnatis or Giordano's. Pequod's is a fusion of Chicago meets Detroit. The caramelized crust is something Detroit is know for. I don't think any other Chicago pizza place does their crust like this. I personally love it! Also the bread is very thick with just a little bit of cheese and sauce on top. Check mark  Detroit style pizza. The sauce is a little on the tangy side. Still really good. Glad I was able to get it.  Reminded me a lot of via 313 out of Austin Texas (via 313 is from Detroit) <br><br>As of right star pizza in Houston Texas makes the best deep fish Chicago pizza I've ever had. The owners are from Chicago. Look them up. Also Windy City pizza in antascacita Texas is number 2. Owner is from Chicago. If you are ever in Houston, try those two out.", "pics": null}}, {"review": {"des": "Came here as part of a Chicago pizza tour, was not disappointed. <br><br>This is one of the 3 main styles of \"Chicago-style\" pizza (in order of thickness, thick to slim): Deep Dish, Pan, Tavern.<br><br>The pizza here is pan.<br><br>It's thick, but it's not \"wedding cake\" thick like some of the deep dish can be.<br><br>The main star of this pizza was the sausage.  It was perfectly spiced.  It made you think \"what's in this?\" in a good way.<br><br>Service was excellent and beer selection was above average.  Ambiance was like that of a normal, divey bar that has been around for a long time, which I liked.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/9OgNFFrlBT8AenRiefZ1qA/348s.jpg", "caption": "pizza tour!"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/B_LuuERjAAF88hauJLi3cw/168s.jpg", "caption": "great pan pizza"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lSRHUCtWSyeTGxvVjce66Q/168s.jpg", "caption": "Store front"}]}}, {"review": {"des": "When in Chicago, one MUST have deep dish. It just ain't right if you leave the city without tucking into their specialty.<br><br>Since I've already had Lou Malnati's, I really wanted to try something different this time around. Some quick googling told me Pequod's was THE place for deep dish so off we went. <br><br>The four of us showed up around lunchtime on a Saturday and were promptly seated. The space is like a no-frills divey bar filled with tchotchkes and old, worn booths. Staff was super friendly and really made us feel welcome.<br><br>We ended up waiting about 45mins for a large pizza stuffed with pepperoni, sausage, olives, mushrooms and bell peppers. This baby was FILLING and the caramelized crust was amazing and so freakin' crispy! It was everything deep dish should be; gooey, hearty, and packed with fillings. Each of us ended up eating a slice and we took two to go. <br><br>TL;DR Fantastic pizza. Just go.", "pics": null}}, {"review": {"des": "Excellent pizza is completely irrelevant when the server lies to your table's face. <br>One star reviews are automatic from me when a server blames the kitchen, or lies. In this case, it was both. We walked in when the host stand said 45 minutes for a pizza- we waited 80, and were given no apologies or anything from our server. We asked repeatedly when our pizza might be up, and were met with just shrugs and no empathy or apologies. She just told us that the wait time was over an hour for our pizzas. I didn't bother debating because there's really no point. <br>Around the 60 minute mark, she began avoiding our table entirely. We asked for our checks before our pizza even came, because we had to be somewhere after dinner. At least she accommodated that.", "pics": null}}, {"review": {"des": "Met up with my husband for a quick lunch date. We ordered the lunch special of the personal pizza and pop for $5! Can't beat that deal. It was my first time here and I am a fan. I love the burnt cheese on the edges! Prob cut and burnt my mouth since I have zero patience once my pizza gets to the table. <br><br>We also ordered the jalapeño poppers which were basic but always good. Will def be back whenever I am in the area!", "pics": null}}, {"review": {"des": "As a visitor to Chicago, Pequods was a good pizza to \"try once, but not again\". It's a bit off the beaten path, especially if you're staying in the central downtown areas (Mag Mile, River North). <br><br>I arrived there soon after they opened for lunch on a Saturday, and boy did the place fill up quickly. I opted for their pan pizza, of course, with meatball on one half and sausage on the other. It takes 45 minutes between ordering and receiving the pizza. <br><br>I agree with the reviewer who said that Pequods is more Detroit-style than Chicago-style. IMO, it's a different type of pizza. It's good, and the caramelized crust is delicious, but I found the rest of the pizza to be underwhelming.", "pics": null}}, {"review": {"des": "When visiting Chicago, we visited quite a few Chicago pizza joints and Pequod's was by far our favorite. Pequod's is where the locals go is what we were told, which seemed very true once walking in. It's like your neighborhood sports bar. <br><br>The pizza here is a pan pizza and not so much a stuffed pizza like some other places. It's got a thick crust with caramelized cheese on the edges, a very delightful sauce, and fresh toppings.  I absolutely loved every bite of this pizza and wish my hometown had something similar. <br><br>If you're a local, I'm sure you already know about Pequod's. If you're a tourist, make sure you make Pequod's your first pizza stop.", "pics": null}}, {"review": {"des": "Pequod's is one of my favorite pizzas in Chicago. The caramelized crust is one of a kind and has become a staple of our city. <br><br>You know the food is good when delivery on a normal evening takes 1.5-2.5 hours. So best advice is to plan ahead and order early!! <br><br>Spinach and garlic pizza is phenomenal, btw! But we recently tried mushroom and garlic and it was ridiculously good as well. <br><br>Yum!", "pics": null}}, {"review": {"des": "I came here with a few friends with the goal of finally trying out some of Chicago's deep-dish pizza. This place serves pan pizza but based on the way service explained it, this pretty much still counts.<br><br>This place has a bar and a lot of appetizer options in addition to the pizza. Pan pizza takes a long time to make, but if you get an appetizer and a few drinks, the time will fly by. The fries are delicious and from what I've seen, the appetizers come in awesome portion sizes, so it's definitely worth your buck.<br><br>The pan pizza coming felt like an early Christmas gift. There is a LOT of pizza and the service helped us by cutting and plating it for us. We got a couple of vegetable toppings on one half and regular cheese on the other half. It turned out to be absolutely delicious and filling. Definitely worth a try and absolutely worth it.<br><br>Considering that each slice of pan pizza is basically 2 pizza slices equivalent of food, the price is amazing if you split it among a few people. This place is also open pretty late, so this could make for good pregame or post-game food, depending on how you go about your night.<br><br>Overall, fantastic experience. Definitely check this place out if you're in the area.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7mfdluTysEk0Y2p-lI9R0g/348s.jpg", "caption": "Pan Pizza: Half Cheese, Half Spinach & Mushroom"}]}}, {"review": {"des": "Pequod's has some of the best pizza in Chicago, hands down and the taste almost makes up for the mayhem awaiting inside. The location is on the corner of a very busy intersection with hard to find paid parking and a long walk from the El. <br><br>I've waited anywhere from 30-1 hour for seating on evenings even if I make priority seating requests over 24 hours in advance. Usually that's fine especially because there's a bar next door where you can kill time. But if you find yourself waiting that long you're probably setting yourself for below par service. On my last visit, I waited for 10 minutes after being served my appetizer before our table was served water.<br><br>As for the pizza, I go pretty basic, I like a good pan pepperoni pizza. I'm not a big fan of the way they chop their veggies, example: green peppers are chopped long ways into slices. I've had a supreme pan pizza and it was so was very watery at the top. The secret is in their crust for pan pizza. It really is a must try.", "pics": null}}, {"review": {"des": "Pequod's was the first stop on our epic Chicago Pizza Tour, where we were introduced to our first #pizzastyle: pan pizza. And oh, was it delicious. We were each served a huge, thick slice of their pepperoni and sausage pie, with its hearty layer of house-made red sauce, gooey melted cheese, and topped with amazing meat. Especially the sausage. Omg, that sausage. It was so good I'm seriously considering booking the next flight back to O'Hare. <br><br>The restaurant had set aside a special seating area just for our group, which was a nice perk of being on the tour cuz this place was hopping. We also got some drinks, and I chose a local beer. Which was sort of a mistake, considering the size of the pizza. The beer was good but I was only able to drink about half of it due to the yummy pizza filling my tummy.  The service was also super friendly, they didn't seem annoyed by us as some restaurants can when you go on one of these food tours.  They were also very efficient, as we were served right away and were able to eat and drink and be out of there in about 30 minutes so we could be off to our next stop. I will definitely return here on my next trip, whenever that may be!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/HAD-HJwDnEAnIQ-WTZTGJw/168s.jpg", "caption": "Yes they have beer."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/xv-eT4lDnPCDH_kH-oFfZA/168s.jpg", "caption": "Eagerly awaiting our pizza."}]}}, {"review": {"des": "Today for toppings we had Italian Beef Sausage mushrooms spinach basil green olives. It's Fine and the caramelized crust is there. But it's only the edge of your pizza the crust itself is just Ok.  <br><br>I prefer Pequod's with the extra sauce that's makes it distinctive for me. Otherwise this pizza is just average", "pics": null}}, {"review": {"des": "I thought it was very good, but I wouldn't call it my favorite person in Chicago. On the two occasions I've had it, I was a bit underwhelmed as surprisingly the pizza didn't have much flavor outside the amazing burnt crust. Overall a very good place that was not very large. Have to try it as many regard as one of Chicago's best.", "pics": null}}, {"review": {"des": "My friend from out of town and I went to Pequod's for lunch. She wanted to get an authentic Chicago deep dish and I have never been to Pequod's, only hearing great things. <br><br>We got the lunch special that is a mini deep dish pizza, and they were incredible. I love the caramelized crust and it sets Pequod's apart. <br><br>Pequod's is an institution for Chicago styled pizza and although in my opinion it's not top dog, I will<br>never turn down the opportunity to eat there.", "pics": null}}, {"review": {"des": "Damn good pizza!  All you need to order is a large deep dish sausage and you are good!  The carmelized crust is outstanding!  If you don't like this pizza, stay home with your frozen pizzas and thin crust appetizers!<br><br>Get here early, it's packed every night from 6 to 9.<br><br>Service is good, it's also a Nebraska Cornhusker bar which is a shame.", "pics": null}}, {"review": {"des": "I may not be from a place that is known for any famous pizza and I am normally a NY style fan...but Pequod's turned me into a deep dish fan as well...BUT as long as it's from here! <br><br>Peqoud's was our 2nd deep dish place and it blew our minds away. We went on an off time (around 2-3pm) on a Sunday but there was still a little wait (about 15-20 minutes) so we wanted to save time and instead grabbed 2 empty seats at the bar since we know we also have to wait another 45 minutes for the pizza to be cooked. <br><br>We ordered a small pepperoni and sausage deep dish to share. The crust is covered in melted cooked cheese- which gave the crust a great crunch. The small deep dish was enough for 2 of us. They loaded and I mean loaded the pizza with pepperoni and sausage! And the best thing, it was probably high quality meats because it was not greasy at all. The sausage was probably the best I had on a pizza. The tomato sauce wasn't too sweet or sour, it was the right cooked down tangy flavor. Also, the crust was not hard as a rock, instead was the right softness and hardness. We enjoyed every last bite...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2uCueJiUQrmLzG4jGn1uTA/348s.jpg", "caption": "Pepperoni and sausage deep dish"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h6pbgRSe12ZnCAr_KQsaqQ/168s.jpg", "caption": "Deep dish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y8L079Nl5Fc7lLnOWDf0mA/168s.jpg", "caption": "Inside"}]}}, {"review": {"des": "Pequod's was my first ever deep dish and it was sooo good! I went here on my first trip to Chicago with a group of girls and we deliberated over which pizza place to try. Pequod's won and I'm glad they did! <br><br>We stopped in around 4pm on a Saturday and they were busy but not slammed. We were able to get a table right away. Note that you will still wait 45 minutes for your pizza. It takes some time for them to caramelize the crust and this is what sets Pequod's apart. We ordered two pies for 5 people and we still had leftovers. Deep dish is filling but we also had late dinner reservations so we didn't want to eat too much. I ate the veggie deep dish and it was so good! The crust was hearty and delicious and the cheese was everything. I would like to try a couple of other deep dish spots for the sake of comparison but I can't imagine it getting much better. <br><br>The service was good and the atmosphere is lively but laid back. I am not sure what part of town we were in because we took a Lyft and I wasn't paying attention. I think this is the only location, though. I would definitely recommend!", "pics": null}}, {"review": {"des": "I've been so excited to try this place for years.  I've been on the hunt for a similar go to for deep dish! <br><br>We got here after a walking tour ended and were seated quickly!  The tables and chairs are old and my chair was even taped up.  It looks very aged. I'm so glad we got there early because when we left there was a 45 minute wait.<br><br>We quickly knew what we wanted (Sausage and pepperoni pizza), and I ordered a beer and my husband ordered a diet drink. <br><br>The pizza came out about 35 minutes later, which was what we anticipated.  I was very excited for the cheese pull when she served us our slices but there was barely one.  Note: next time I'll order extra cheese.  However, there were a lot of toppings and I still really loved this pizza it just wasn't like the videos I've seen before. <br><br>One thing to note, when the bill came it \"suggested\" tips on the iPad; however, it was based on the subtotal plus tax rather than the sub-total... I have to say that was a bit shady to me, as sales tax is over 10% in Chicago and is not supposed to be included as part of tipping and I bet most customers don't even pay attention to this. There is an option to change your tip to a different percentage or dollar amount, but you have to notice what is happening.  I hope this gets changed. <br><br>I'd like to give them another try when we visit the city again.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WjoXcM2aUzKakB3bXRXbbA/348s.jpg", "caption": "mainly dough and toppings"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/f0hI6WkHHeuToakOs10fvg/168s.jpg", "caption": "my slice"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/CF661kmuFgRJvGWZVeozRA/168s.jpg", "caption": "Small Sausage and pepperoni pizza"}]}}, {"review": {"des": "Okay I'M SAYING IT. This is the best deep dish in Chicago.<br><br>We got the pepperoni and sausage medium, and it was everything I would ever want it to be. The crust, the sauce to cheese ratio, the amount of pepperoni on each slice... I'm still dreaming about it.<br><br>I called in the order ahead of time, and they wouldn't put it in the oven until we were seated - which confused me. Why would I bother calling in ahead of time when I can just order at the table for the same amount of time? Don't see why that is an option. We still waited 30 min for the pizza. <br><br>It is so out of my way, but I will definitely be back.", "pics": null}}, {"review": {"des": "For most of my life, I considered Pequods to be the best pizza in Chicago.  <br><br>Recently I had a pie from there for take out.  It was my first time having Pequods in almost a decade.  It's out of the way for me and the wait time is serious.  But I was in the area and craving deep dish.  I usually only eat thin crust these days.  I like Detroit style too.<br><br>To my shock, I found I don't like this pizza anymore.  It is 90% bread.  There is almost no cheese or sauce.  The best thing about the pizza was the toppings.  The mushrooms were particularly succulent.<br><br>The burnt crust is still nice, but I can get that at Jets or Fat Chris's now, and Detroit style is preferable to pan.<br><br>I think pan pizza is gross now.  I thought Pequods was deep dish all these years.  Oops.  I tried.  I was excited to eat it.  But after the first few bites I knew I was eating just a pile of bread.  It's not balanced.  Lesson learned.<br><br>I got take out on a Monday night.  I stood in an absolutely jam packed, claustrophobic area not meant for standing, with several others picking up and frantic servers competing for space.  Very, very annoying.  <br><br>I'm sad to not like this pizza anymore.  I'd say if you love bread more than sauce or cheese, and generally go for pan style, you'll love it.  It's not for me though.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Mn7NUYBG12NltXD59g_Kpg/348s.jpg", "caption": "Mushroom and spinach. Looks amazing, but it's mostly bread.  Way too much bread.  Yummy fresh mushrooms though"}]}}, {"review": {"des": "Maybe it's because I haven't had deep dish in a while, but Pequod's was really not all that everyone else had hyped it up to be...I went to Pequod's when a friend from out of town was visiting Chicago (usually the only times I eat deep dish these days is when someone is visiting). I was incredibly excited because I had heard so many great things about Pequod's-- that it was better than all the other deep dish restaurants. <br><br>I felt like the vibe of the place was...unique. The restaurant is actually quite large, has a lot of different nooks and crannies, with multiple screens projecting various channels at the same time. We were placed in the very back, and it actually felt quite dark where we were. But maybe that's the vibe Pequod's is going for-- I won't hold it against them.<br><br>As for the pizza itself, we ordered ahead of time and waited about 25-30 minutes for the pizza to come out (which is not the longest I've waited). I will hand it to them -- I really enjoyed the pizza crusts. Cheesy, crispy/slightly burnt (a good thing!), but not too overwhelming at the same time. As for the rest of the pizza however, I thought it was pretty average. Maybe I'm more of a cheese person, but I thought the pizza was very dough-y and lacked a solid amount of sauce + cheese. We added pepperoni and basil to our pizza, which was ok.<br><br>Overall, I felt like this place didn't live up to the hype (or perhaps the issue was that there was too much hype to begin with?). Maybe it's just not for me, though.", "pics": null}}, {"review": {"des": "I wish I could give a 5 for food and 2 for customer service....<br><br>The hostess station was a HOT MESS when we got there around 7:30 pm on Saturday.  We expected to have a wait, but not a 2.5 hour one!  That just seems like poor management and overall time management!  It made it extremely frustrating to listen to the hostess tell guest after guest 2-2.5 hour wait when I was looking at 3 empty tables within sight of the entrance!  Lucky, we were able to grab 2 seats at the bar and order right from there.  The bartender was working like crazy to not only serve her guests by run the bar for the entire place.  It was quite disappointing to see 2 staff members standing on their phone the ENTIRE time we sat at the bar....how is there a 2.5 hour wait but not all hands on deck?<br><br>The pizza was a great and we'd go back for more!  CAREFUL....don't over order.  The small was plenty for 2 people!", "pics": null}}, {"review": {"des": "Pequod's.  Strange name, delicious pizza.<br><br>I'm not certain why the whale on the menu is wearing thong underwear on its head, but I do know that the pizza is fantastic.<br><br>The atmosphere is that of a college pizza/sports bar.  A majority of it's patrons seem to be college students.  I felt like an old geezer, and I'm only 40. <br><br>This place is extremely busy, and the line was out the door...on a Sunday afternoon.  Thankfully our pizza tour was able to walk right in, as they were expecting us.  I felt bad for the people waiting outside in the sun!<br><br>Their deep dish has a lighter, airy crust, but very thick.  When you add the cheese and sauce, you get a very unique type of pizza.<br><br>Oh, and do yourself a favor - EAT ALL OF THE CRUST.  It looks burnt, but that's the best part -  \"carmelized crust.\"  It's a layer of cheese that melts together with the crust.  A tiny piece of heaven right there!<br><br>I probably won't ever be in this neighborhood again, but if I am, I'll definitely drop in!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1BUTFBLw7XbNwIOHVAEsQw/348s.jpg", "caption": "Carmelized crust.  Eat It."}]}}, {"review": {"des": "By far the best pizza in Chicago! A month ago I met a guy in an Uber we shared in San Diego and directed me to Pequod's staying this is where Chicagoans frequent and boy I'm glad I met him. This was the best pizza I've tried in my 4 visits to Chicago and will only eat pizza there from now on. <br><br>Decor-it's an old brick building with two floors of dining and a bar on both floors. The walls have a mix of Chicago sports paraphanelia and Chicago history. Tight seating area upstairs and down, and a very small bar upstairs. <br><br>Service-I sat at the bar, so really can't comment on service, but bar tender was decent and brought me what I asked. <br><br>Food-Pizza is Phenomenal!!!! Perfectly seasoned with a blend of spices like oregano and garlic. The crust was crisped to perfection and topped with tons of cheese, sausage, and pepperoni's. Garlic cheese bread was also perfection! Simply put this place rocks and is amazing. Beware there are long lines, but that is testament of how good food is. <br><br>Can't wait to go back!!!", "pics": null}}, {"review": {"des": "I have been wanting to come here for 4 YEARS. Don't be dumb like me and wait that long. <br><br>My husband and I went in for dinner earlier in the week before a movie at Webster Place. Since it was  a weekday, there was no wait. But I know for sure there is usually a long wait for a  table at high traffic times. <br><br>We ordered onion rings and a medium sausage pizza. I thought to myself, maybe the hype isn't real. OH IT REAL. The crust of the pizza is so good, it's worth it. For sure try this if you haven't already.  The onion rings we perfect, I like that it's served wit bbq sauce.  I can't wait to go back. <br><br>The service is quick and the prices are fair.", "pics": null}}, {"review": {"des": "Bam!  Quality Chicago style deep dish pizza!  Although I ordered it to go and had to wait 25 minutes until I got to my hotel, it was still delicious and the crust was crispy.  I got the pepperoni and sausage pizza.  The ingredients were fresh and plentiful.  Careful what size you order as this pizza is satisfying and filling.  This is a must stop by place if you are in Chicago.  Don't miss the opportunity to have the best Chicago style deep dish in the country.  Even if you don't like deep dish, give this one a try.  You will be", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/BlmaEldq5q-Ssnxm-YMuwg/348s.jpg", "caption": "Pequod's"}]}}, {"review": {"des": "Well worth the wait!  Even with the plethora of tables upstairs and downstairs, be prepared to wait awhile.  However, the service is excellent and the deep dish is in a class of its own.  The burnt cheese up the back of the crust just makes this the best place for Chicago pie, hands down.", "pics": null}}, {"review": {"des": "I am a lover of thin crust!!!<br><br>Having said that, never ever eat thin crust here..it's sad..and a pathetic excuse for pizza BUT...<br><br>The deep dish here is SO yummy. I love the sausage here even though I usually avoid sausages (colon cancer and all, blah blah). <br><br>Simply put, this place is an exception for me. I eat a deep dish pizza with sausage here!! Totes breaking away from my usual preferences. <br><br>Try it yourself. You might surprise yourself too!", "pics": null}}, {"review": {"des": "If Lou Malnati's crust got combined with Pequod's topping, it would make the best deep dish pizza. Our group of four waited about an hour to be seated during peak dinner time. <br><br>Your group should place your pizza order soon after being seated, because the large pizza takes 45 minutes to cook. We ordered the large pizza, added pepperoni, jalapeño, garlic, and meatball. <br><br>The service was not great. Our waitress rarely came around to check in on us. We had to flag her down and ask for things like a beer or soda refills multiple times. We ended up canceling our pitcher of beer due to the long wait. The second story was not well ventilated and got uncomfortably warm during dinner. <br><br>Although the toppings were very generous, I did not love the crust at Pequod's. It was too cakey, thick, and dry in my opinion. That combined with the service and long wait made this experience fall short of my expectations.", "pics": null}}, {"review": {"des": "I visited the Morton Grove location 8 years ago and I absolutely loved it.  I still enjoyed the pizza at this newer Chicago location, but it didn't taste quite as amazing at the one I had at the Morton Grove location.  The crust seemed more burnt than the caramelized crust I remember.  Maybe it's because the Morton Grove location is the original, and the oven used has the special flavor from years of baking pizza. <br><br>One tip if you plan to eat lunch on a weekday - call in your order.  Then text them when you are 15 minutes away.  They will reserve your seat and your pizza will come out in about 15-20 minutes after you are seated.", "pics": null}}, {"review": {"des": "What a disappointment it's all crust. This is supposed to have extra cheese on it where is the extra cheese? Actually where are the ingredients? You really have gone downhill, serving this is an embarrassment.", "pics": null}}, {"review": {"des": "Easily the best deep dish in Chicago!<br><br>I don't have much more to add to this page but I will recommend getting extra sauce and extra cheese....it really makes a difference!", "pics": null}}, {"review": {"des": "I cannot tell you how disappointing my experience at Pequod's was.  Based on all the reviews as well as how many times it's on food shows, I had high expectations.  <br><br>My husband had been before and kept telling me it wasn't that great, but of course, I needed to try for myself.  The first time, he got deep dish and I was sure that was the reason for his negativity.  We don't like deep dish.<br><br>So we got thin crust of sausage and garlic.  30 minutes later the pizza comes out and it's covered in cheese and sauce.  The cheese was a little too overpowering and the sauce was very tomato based.  But what I didn't like that much was the skimpiness of sausage (the last 5 pizza slices didn't have any on it), and the crust just wasn't that great.  While the crust was extremely thin on the bottom, it was very doughy on the side.  <br><br>I also thought the crust would have that caramelized / burntness that the deep dish does.  It didn't.   So we left most of the crust and the last 4-5 slices.  We didn't even feel it was worth the effort to box it up.  That disappointing!<br><br>On the plus side - we had the Pequod's Salad (romaine, pepperoni, peppers, cucumbers, mozzarella cheese, etc) and Italian Dressing.  This was excellent.  The lg salad was great to split between us and the dressing was so much better than your usual Italian as it was full of spices.<br><br>Our server was also very good.  Attentive on the drinks and everything.<br><br>We later found out as we were leaving that they have an extra thin crust where there is less side crust.  I don't remember it on the menu, but even still, we will not be back to try it.", "pics": null}}, {"review": {"des": "I can see why this place has such a huge cult following. Great deep dish pizzas that have a slight char on the outside, descent priced drinks and a relaxing and chaotic atmosphere. The wait was like 45 minutes to get a table but luckily I was allowed to squeeze into the bar and skipped all the wait. Still, call ahead if you can or just don't come starving. It's worth the wait if you have to.", "pics": null}}, {"review": {"des": "Not big fan. Pizza sauce has a more acidy taste to it. Didn't really like the crust much either. I know that people have about this place but I have had better in Chicago. Then again that's the beauty of Chicago. You get so many different variations of Chicago style pizza that there's definitely a pizza for everyone. I enjoy Chicago's Pizza, Giordano's, Loumanatis. So you know where I'm coming from.", "pics": null}}, {"review": {"des": "I honestly expected so much more from a place that is this hyped up. Would definitely prefer any other deep dish place (Gino's East, Lou's and Giordano's) over Pequod's.<br><br>Where to even begin? First off, the service is terrible. We called at 4:00PM on a Sunday for pickup was told it would take 50 minutes to prepare the food. We arrived at 5:20 due to bad traffic. I went inside and paid and was told my name would be called when the food was ready. I expected the food to come out right away since it had been 80 minutes since I called but nope, it took 10 minutes to just get part of our order (the soup and salad). Then we waited another 10 minutes to get the two large pizzas that we ordered, but we were still missing our cheesy garlic bread. The lady bringing us our food seem to have no idea about what we ordered. After waiting another 5 minutes for our garlic bread, they forgot the marinara sauce (which costs extra $0.65 btw). So basically we had to wait almost two hours after we ordered to receive our entire order.<br><br>Now the food. We ordered two large pizzas, one with pep, bacon, peppers and mushrooms, and one with sausage, pineapple and spinach. They completely neglected to put pineapple on one pizza and put pepperoni instead. Also, each topping is $3, making each pizza around $30-$32. The pizza was basically an inch thick bread with toppings and lacked sauce. They also put an obnoxious amount of pepperoni on the pizza, some areas were 4 slices thick, making the pizza taste extremely heavy and salty. The crust was also black, burnt, and hard to chew.<br><br>The pequods salad ($10) is probably one of the worst salads I've ever had. The menu didn't list any of the ingredients in the salad so I didn't know what to expect. The salad contained old wilted lettuce, and had pepperoni and sliced cheese on top, making it basically a pizza except with crappy lettuce as the base instead of bread. The tomatoes were borderline rotten, they were bitter and brown inside. I also ordered a vinaigrette dressing, but received two sauce containers of olive oil and two sauce containers of balsamic vinegar; did they expect me to make my own dressing? Usually vinaigrette comes premixed with seasoning. The cheesy garlic bread was basically baguette sliced in half with a sliced of cheese on top. By the time we got home, the bread was cold and hard and had to be warmed up again. <br><br>TLDR; pretty much every aspect of our experience was extremely disappointing. No idea why people tolerate their service and food", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/1QbGFG0mLh_zY2Q4jrPixA/348s.jpg", "caption": "The Pequod 's Salad"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/p8R4a30dS5Jq9kIoqZ2Yrw/168s.jpg", "caption": "Wilted/rotting lettuce"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wPH6R-eujepwqG1gJPT3Bw/168s.jpg", "caption": "\"Vinaigrette\" Salad dressing"}]}}, {"review": {"des": "First off, we were hyped up a lot before coming here! We were told that this was essentially the best pizza in Chicago. So off the bat we had really high standards of this place. <br>We walked in, and there was a sigh that said the wait time was about 40 mins for pizza AFTER we were seated. <br>At this point we decided to just put in a to go order since they said that would only take 40-45 minutes. <br><br>I personally think it was overrated. I mean it wasn't bad pizza but it definitely wasn't the best pizza in Chicago. Actually I am not sure if I would call it pizza, it was more like pizza bread. <br><br>We got a pan pizza, half cheese and half sausage. It looked more like a deep dish pizza when it came out of the box. It was a think and crispy crust (actually the crust was kind of charred/ burned). <br><br>Super tasty, but again, tasted like good pizza bread, not pizza. <br><br>I am willing to try a thin crust and dine in next time but not sure I will ever wait 2+ hours to eat here!", "pics": null}}, {"review": {"des": "My sister used to live in Chicago, and being from NY, she was super excited to experience their pizza.  I don't remember the name of the place she took us to for deep dish, but none of us liked it --- the sauce, the crust, the cheese... none of it.  I want to say it was Giordano's, but I'm not 100% sure.<br><br>Fast forward to now, I returned to Chicago for a festival and was willing to give pizza another chance.  I tried Lou Malnati's, and while I liked the sauce and cheese, I was not a fan of the crust at all.  But then after the festival I decided to seek this place out... and everything changed.  First of all, there was a mob outside of the restaurant waiting to be seated.  Since I was by myself, I was happy to squeeze through, go inside and find a seat at the bar.  As I passed by the hostess's podium, I saw a sign that said pizzas ordered at the time would take 60 minutes.  That's a nice thing to know, instead of being shocked as you wait for your food.<br><br>Anyways, I found a seat at the bar and ordered a glass of wine as I waited for pizza.  I believe it did take about an hour, and when it came... it was pipin' hot in a pan.  The person who brought it to me cut me a slice and put it on a plate.  I had to wait for it to cool down before I could pick it up.  As a matter of fact, it was still a tad loose so I knifed & forked it.  I asked for pepperoni and green peppers, but I did not expect it to be huge chunks of peppers nor for there to be loads and loads of pepperoni.  That combined with their rather sweet sauce and perfectly caramelized and textured crust was....<br><br>AWESOME!!!<br><br>Chicago pizza has been redeemed for me and it's all thanks to Pequod's.   I would gladly come back.  Be warned: do NOT come with a big party.  I get the feeling you'd be waiting a long time if you did.  If you do though, just be prepared.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/IKmEQpu9ugeYhjVVWWUmPg/348s.jpg", "caption": "Pepperoni and green peppers"}]}}, {"review": {"des": "First visit on a Friday night and this place is packed!  <br><br>A friend arrived around 6:30 to put our names in, we were seated an hour later, with pizza(s)* arriving a bit less than an hour after that.  Issue with a super burnt crust first pizza (which I'm told is rare as others in my group have been multiple times attest), but service was quick and accommodating for our surprise +2 guests and high chair, and discounted our total bill for the problem.<br><br>*Second pizza was delayed as they messed up the order, so was brought out later.  We crunched through the first burnt pizza (we think they left it on too long to wait for the second originally and that caused the burntness).<br><br>And of course - the main thing to review: the pizza is amazing and totally worth the raves. The second was done to perfection, and even the first burnt one was delicious when creating the top off the crust bottom.  My friends were disappointed, but I don't care much for the bread anyways ao or was not a big deal to me. In any case, the way Pequad's does toppings is excellent. <br><br>Overall:  <br>Service 5<br>Atmosphere 4.5<br>Food 4.5<br><br>Highly recommend ordering carry out, since the wait takes a while (2 hours before food, unless you order appetizer) and the place can be a bit claustrophobic for some with the crowds.", "pics": null}}, {"review": {"des": "This place was a BIG disappointment. We arrived on a friday night and they estimated the wait to be 1hr 40 min.. okay if this place had that many reviews than it must be worth it. So we waited about 2 hours before we got seated. We ordered the appetizer sampler that came out fairly quick. It had jalapeno poppers, (i thought it was too salty) fried zuccinni (not bad), and fried mushroom (ehh) <br>My friend got the iltalian beef with cheese and peppers, i thought it was good, thats why i gave this place 2 stars instead of 1. The beef was moist and juicy and the sandwich had a lot of good flavor.<br>They estimated the wait for our food to be another hour.. we waited around 45 minutes for our food to finally come.<br>My boyfriend an i got the medium pizza with sausage. I was so disappointment, the pizza didnt taste good at all to me. i didnt even finish half of a slice. I think ive had better pizza at Blaze pizza or even dominos. <br>The crust had a weird taste and texture to it, like the crust was really crumbly and just wasnt good. This is the longest ive ever waited for at a resturant and i really wish i didnt.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PIxf6xksJyfRf9qtro5ZSQ/348s.jpg", "caption": "Appetizer sampler"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/7rCLBrA1aNK6WA-3j-zKkA/168s.jpg", "caption": "Italian beef with cheese and peppers"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/0qL4Md9ou-atl1Tm1EQ-wA/168s.jpg", "caption": "Medium pizza"}]}}, {"review": {"des": "I love Pequod's, and always recommend it to visitors looking for good deep dish. It's my second favorite deep dish in the city (after Art of Pizza), but hands down has my favorite crust. The caramelized cheese is delicious, and worth coming for on its own. I especially like the spinach pies here. <br><br>As a note, you can call ahead for preferred seating. If you have a large group, they'll guarantee a table.", "pics": null}}, {"review": {"des": "A deep dish pizza unlike anything I've eaten before.<br><br>Recommend by a couple of local Chicago friends, we decided to stop in. Upon entering, there's a written sign showing you the expected wait for your pizza. When we walked in it showed an estimated 40 minute wait. <br><br>Our party was 5 & the server recommended a large pizza but to be honest a medium would've been sufficient.<br><br>I can't compare their deep dish to any pizza, I've eaten before. It tasted more similar to a gourmet lasagna & it was excellent. <br><br>The crust was the highlight and the toppings (pepperoni, sausage) were excellent as well. Overall it was very good but not great. A unique tasting pizza.", "pics": null}}, {"review": {"des": "After doing a search on Yelp for the best pizza in Chicago, we knew we had to give Pequod's a try. Staying downtown, the walk was too far, so we took a Lyft (which was a quick ride). <br><br>We arrived around 6pm on a Wednesday and were seated immediately. Upon entry, it seemed a bit crowded, so I was pleased when we were led upstairs to a much more open space. We were directed to a high-top table and our server quickly welcomed us. <br><br>Now, this place is all about the pizza, so I will get to the point. It was interesting that the pie was not a traditional Chicago-style pizza, but a deep dish pizza, so the main difference was the crust. That fact threw me a bit at first, but the pizza was tremendously satisfying. The pepperoni was thick and spicy, the sauce flavorful, and the cheese perfectly melted and rich. We ordered a small. It had four pieces, but they were substantial, so between the two of us, we ate three and took one to go. <br><br>Our server was super friendly and attentive (not too much attention, not too little attention, but the attention was just right). <br><br>If you are visiting Chicago, I recommend venturing out of downtown proper to taste the deliciousness of Pequod's.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/35eh9wtV7ls4n6M1l86j0Q/168s.jpg", "caption": "Slice of a small deep dish with pepperoni and basil."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ZnqWGjfkboPm2XVYJxR1ng/168s.jpg", "caption": "Half of a small deep dish with pepperoni and basil"}]}}, {"review": {"des": "I love Pequods. It's good. But when it's delivered, the crust gets soggy, and really there's nothing you can do about it. Or can you?? Keep it simple with the deep dish. Sausage & mushroom is my go to for toppings. Also, don't forget to order some onion rings while you wait.", "pics": null}}, {"review": {"des": "Ever since I've been to Burt's place in Skokie I've lovers pequods the place is bustling as busy sometimes a wait but worth it. I love sausage mushroom onion a little well done yum", "pics": null}}, {"review": {"des": "Best deep dish in town. I tried Lou Malnati's last time I was in Chicago and was underwhelmed. This time I tried Giordanos and Pequods. While both were better, I have to give Pequod's the edge for having a better balance of sauce to cheese.", "pics": null}}, {"review": {"des": "After a full day of being at the United Center for my first time in Chicago, and obstinately not eating much, I obviously had to get myself some deep dish pizza. Pequod's was highly recommended to me, and I got there past midnight on a Friday night.<br><br>Since I was there at a relatively odd hour, getting a spot was a breeze. The ambience is similar neighborhood friendly dive bar but with the aroma of pizzas instead of beer. To my dismay though, the only pizzas served here were pan pizzas - the horror!<br><br>On clarifying with the waitress though, it seems like the main difference between a deep dish and their pan pizzas is the fact that Pequod's makes them in a skillet, resulting in their (famous) blackened edges. I ended up going with a simple if slightly oddball combo of olives and jalepenos.<br><br>It had all the hallmarks of a deep dish pizza: 40min to make; a fork and knife needed to eat it and being absolutely stuffed after about 2 slices. It was absolutely delicious! The ingredients tasted so fresh, and the balance of cheese:toppings:crust seemed perfect; with nothing overwhelming the pizza. <br><br>I love my Brooklyn style pizza, but Pequod's is right up there with the best I've ever had and I can't wait for another trip to Chicago to have it!", "pics": null}}, {"review": {"des": "I've been to Chicago twice. Over the course of those two trips, I have had Lou Malnati's, Giodarno's, and Pequod's on this most recent trip. I will rank them accordingly: <br><br>1) Giodarno's<br>2) Pequod's<br>3) Malnati's <br><br>On to Pequod's deep dish. We walked in right when it opened, so there wasn't a wait and got seated fairly quickly. We ordered and customized toppings (peppers, onions, and sausage). <br><br>Pequod's is well known for their caramelized crust so I was very excited to try that. When the pizza, came it smelled delicious and looked so good. <br><br>Flavors were very good, but I honestly was not a fan of the caramelized crust on some parts. It was kind of burned, so it added this unpleasant taste when eating it. <br><br>We also ordered fried mushrooms as apps, also good, but could skip especially if you get deep dish. <br><br>Worth checking out if you're in the area, but it's kinda tough because it's not super convenient to get to.", "pics": null}}, {"review": {"des": "Came by here looking for the unique deep dish. The place is mobbed with locals. Service was fast and attentive. The deep dish was tasty, love the way they do the crust here with crunch.", "pics": null}}, {"review": {"des": "We had a horrible experience we ended up walking out.  my pizza was burnt we ordered two pizzas only got one and the one we did get was burnt the appetizers were subpar the waitress was clearly irritated because of the crowds of people.  The manager,  Joel didn't even offer an apology. <br><br>Said our pizza would be replaced but we are the ones that had to ask 25 minutes later where pizzas were then we finally just got up and walked out!  I wouldn't recommend this place to anyone.  In total we wasted 3 hours and ended up getting pizza at Lou Malinati's.", "pics": null}}, {"review": {"des": "So before my trip to Chicago I was doing A LOT of research. I've been to the Chi a lot now. But I never really cared about who was the best deep dish in town. I was only interested in experiencing it and the Chi Town lifestyle, if you know what I mean. So this time I wanted to know who had the best in town. During my research this place kept on popping up. I've already tried a lot of the other top rated places so wanted to go here. Food Network also rated it the second best pizza in the Nation! So I had to give it a try.<br><br>When I went I ordered a large pep and sausage pan (deep dish) w/ extra cheese. It came out in the normal deep dish cast iron pan. And you could tell just by looking at it what time of experience I was in for. It looked so good. When I finally started eating it I fell in love. No joke, it's that good. All the flavors go so well together. The sauce was perfect and everything came together. I love the darkened caramelized cheese ring around the edges. You won't really get that anywhere else and it's kind of a Peqouds \"thing\". This was my first deep dish with thick crust. But it was so good. It was cooked perfect. The pizza was steaming hot and I still couldn't even let it sit a second before taking more bites. I will say this I by far my favorite Deep Dish. Giordano's what? Lou Malnati's who?... never heard of em..... This is my go to spot in my favorite city now. No game or gimmicks, you gotta go if you never been. This pizza is LIT.<br><br>The place is very small. And I heard that it normally has lines around the corner. So I made sure to get here early before opening to get a spot. I'd suggest that for anyone that comes from out of town. The inside looks like a plain regular bar or pub. Which makes it even better. They don't have that corporate feel that the other places have. Their menu is basic, like super basic. And that just adds to the whole ambiance of this place. No flashing likes and smoke and mirrors. They are about their pizza, and that's what on show here.<br><br>The service was nice. Nothing too great. Just average. But that's fine. As long as it is not negative. Everything was on time and quick. We had our drinks refilled when we needed them and everything. <br><br>Overall this place has set the standard for Chicago deep dish for me. I was giving other pizza places high ratings. But not I gotta re think the whole thing. This place is a 10/10 and everything else falls under it. That's just #Facts. This is definitely my new go to when in the Windy City. I'd recommend this to anybody that. Tourist or not.  Wish I could give it 6 stars honestly.", "pics": null}}, {"review": {"des": "4.5 stars. Yum! Tried Pequod's after it was recommended to us by a few people. Arrived at 11:15am on a Sunday morning and there were maybe 4 people in the place - wanted to be sure we got there early to get a seat. We had done the priority seating on their website the day before, but turns out we didn't need it. <br><br>Since there was plenty of room, we decided to sit at the bar. We ordered a small pizza (this for my husband and I) with sausage, garlic onions, tomatoes, and extra cheese and sauce (as recommended by fellow Yelpers). I'm definitely glad we got the extra cheese - I'm not sure I'd get the extra sauce if I had to do it again (I'd also definitely forego the tomatoes, definitely unnecessary, especially with the extra sauce). The crust - ooooh, that crust. Just as good as everyone says. The roasted garlic was amazing, the cheese nice and gooey. Overall...it was like pizza lasagna - and I mean that very positively. Really delicious, and filling. The small was perfect for the two of us (we're from out of town, so no place to store leftovers). The bartender was honest and said it takes about 40 minutes per pizza, so we split a cesar salad...if I had to do it all over again I wouldn't have ordered that, I would have just waited. <br><br>Why not 5 stars? It's a bit expensive (I mean, it's pizza...and I wish there'd been a few more pieces of sausage). And there weren't very many beers on tap. I know their focus is pizza, but a few more beers (and local beers) would have been nice to see.", "pics": null}}, {"review": {"des": "Best deep dish pizza I've ever had. Crust was buttery, sauce was perfect and the cheese was piled high. The wait time to get seated was not bad at all. The cooking time for the pizza was about 1 hour if not longer which is why I'm not giving them 5 stars. <br>They need to figure out a better system to get the food out quicker. An hour is just way too long.", "pics": null}}, {"review": {"des": "So a disclaimer before you read this review: I'm from the east coast and really enjoy NY style thin crust pizza. <br><br>The place was packed for a Wednesday but there was a Cubs game in the afternoon and a lot of Dodgers fans were in town looking to try deep dish. The wait took about 20 minutes since it was only 2 of us but the pizza took over an hour. Therefore, I would definitely recommend ordering an appetizer so you're not starving when the food comes out. We got garlic bread that was fairly average - nothing to write home about. <br><br>Next, we go a medium sized pizza for 2 people and had leftovers so the size was not a problem. We ordered sausages and peppers and came out looking great. Maybe I am just not a fan but the inside of the pizza had a lot of bread and not the cheese and sauce I was expecting or envisioning. <br><br>I will say the crust is unique as it is completely made of cheese and reminds me of the burnt edges of lasagna so that was the best part in my opinion. We had leftovers that we ate the next dya and quite frankly, that tasted better than the fresh slice. Overall a good experience and environment but still like NY style pizza better.", "pics": null}}, {"review": {"des": "If you can't decide where to get deep dish pizza in Chicago, give this place a try. It's not the Chicago deep dish I remember having as a kid, but it's pretty damn good. The crust is thick and a little bread-y, the toppings are fresh and not over cooked. I got a small to share with one person and it was just the right amount of food. It takes about 40 minutes for them to cook the pizza but we seemed to have only waited 20. <br><br>If you're driving, there's plenty of street parking nearby. I got here around 12:30pm on a Saturday and didn't have to wait for a table. Although I do have to dock some points for the state of the table. Which had to be propped up so our pizza didn't meet an untimely demise. <br><br>Great place to catch a game too, there's plenty of TVs for you to catch your favourite sports teams.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/aIV82SPS2KIvVAMqXQYBiA/348s.jpg", "caption": "You can get half toppings so you can try an assortment of toppings for less"}]}}, {"review": {"des": "This was our first stop on an incredible Pizza Tour of Chicago that we took on a work trip recently. I have seriously been dreaming about this pizza ever since.<br>The place feels kind of divey, but they are doing some transcendental magic in the kitchen. Our tour guide explained that they add mozzarella in the cast iron pan to help create their incredible caramelized, crunchy, unforgettable crust. I am such a sucker for burnty cheese, and their toppings are as incredibly well-made as their signature crest. Be sure to order the Italian sausage.<br>I really intended to save more room for the last stop, a deep dish spot that I expected to like the best, but Pequod's was truly the stand out of the tour. After finishing my own piece, I scavenged off of some of my coworkers plates who hadn't had room to finish their whole piece. Even our gluten-free gal was picking the cheesy edge off of other people's pieces so that she could participate vicariously in this incredible pizza.<br>I so highly recommend this spot and guarantee I'll be back again and again!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/YguGB7kFe-111MpUOiC7Hg/348s.jpg", "caption": "Entrance sign"}]}}, {"review": {"des": "Tourist alert:  Do not eat here!  Go to UNO's or Geno's East.  Please!!  <br><br>That way we won't have to wait as long for a table and this fantastic pizza when we go back (and back).  Friendly staff kept our drinks filled while we snacked on cheese sticks (just OK) waiting the announced 55 min wait for the pies. <br><br>They came a bit early and we loved them!  Especially the deep dish.  We found the thin crust to be a bit thick for our liking, but learning for next time.  Generous amounts of toppings!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KH8zWbBN8hgY3Jn6JE-FxA/348s.jpg", "caption": "Deep dish in front... \"thin\" crust behind."}]}}, {"review": {"des": "We were sitting quietly in a booth on the second story of Pequod's near midnight. Princess Carewee was to my left, configuring her camera after a full day of adventure. Across from us is our mercurial friend, Kent24, fully wrapped in Giants attire. We were quiet. Battered from a long day of eating, drinking, baseball, and more eating, we had to travel by foot to this popular Pizza place. There was little energy left for idle conversations.<br><br>By contrast, the restaurant was loud and lively, even at this late hour. The walls were illuminated with neon lights of commercial beer logos and Chicago sports team. Against the dim lighting, the décor reminds one more of a sports bar than a pizzeria. But maybe the two are the same here in the Midwest. <br><br>The menu was a single laminated piece of literature. It dutifully reminded us that Pequod was famous for its caramelized crust, or its \"darkened edge\". Between the three of us, we had no idea how this would taste, but were in firm agreement that it must be awesome. The menu also listed out all the toppings that we can choose from. The usual suspects were all present: Spinach, Sausage, Mushroom, Extra Ch---<br><br>\"Extra Cheese.\" I broke our silence with a wide-eyed whisper. <br><br>Kent24 was not having it. Still feeling the effects of our hearty dinner not so many hours ago, the proposition of adding another layer of fat to an already heavy fourth-meal must have sounded ludicrous. But the thing you have to know about Kent24 is that it's never a 'hard no.' As a matter of fact, the 'No' is merely an invitation to strengthen the proposal of your idea - to describe the insanity, to explain the improbability, and to illustrate the grandeur of its effects. Kent24's 'No' is merely the demand that you verbalize the \"Lit-Ness\" that is your idea and immortalize the awesomeness in words.<br><br>\"Fine, get the extra cheese.\" Kent24 conceded, inevitably I may add.<br><br>Thus, I would not be doing our gluttonous gluttony justice if I do not chronicle our pizza experience to you as I have imagined it to Kent24 just moments before our glory.<br><br>The server arrived at our table with a circular pan. Sitting within the pan were the dear and familiar colors of a midnight pizza. The crimson red of the classic pepperoni and the radiant green of the bell peppers clashed violently against a wobbly backdrop of golden mozzarella. Fiery red tomato sauces burst through pockets of the melted surface and splattered on any and all nearby darkened sausages and olives. All the colors glistened under a thin layer of oil, accentuating this visual spectacle. Enclosed within the pan was chaos and beauty, and it was announcing its presence ever so loudly with its violent aroma. <br><br>My heart began racing. I knew Kent24's was too. After juggling our phones with our trembling hands, we had the cameras in position to capture this moment. Finally, a LITsperience worthy to share on our social media outlets, guaranteed to extract those coveted little hearts from our followers.<br><br>The server, standing by us this whole time, motioned politely for us to wait. He wore a slight smirk on his face and his brown eyes exude the type of confidence that we had only seen in a meme... he did not speak, but we heard him loud and clear.<br><br>\"This isn't even my final form.\"<br><br>The metal slicer clanged against the pan and in one swift motion, raised a slice of the pie into the night sky. The sight was majestic --- no, it was divine. In its ascent, small pieces of sausages separated from its body and fell gloriously from the skies. The streams of mozzarella stretched with the crust and into the gates of heaven. Each golden strand looked as if it were a celestial ray of light breaking through the clouds and onto Earth, blessing the taste buds of devout eaters.  <br><br>In truth, neither Kent24 nor I finished more than one slice of that pizza. As its appearance suggests, it was as heavy as it was filling. We were punished for our greed and gluttony as we had no microwave in our lodgings and had to watch more than half of our deep dish go to waste. But it was worth it. Pequod's Deep Dish was the most amazing piece of pizza I have ever witnessed and I will sin a hundred times to eat that forbidden pie again. <br><br>We left Pequod's with our bellies full of pizza and a night full of memories. The decision to go with extra cheese - against the better judgment of our appetite, diet, and/or health - was the right decision. Years from now, Kent24 and I will be throwing back some Coors Light (Kent went to Colorado ONCE) and we will remember this night in Chicago. We will reminisce about Wrigley, we will laugh about the LC, and we will talk about how we once saw a slice of deep dish pizza soared into the cosmos. LITness is forever.<br><br>SIDE STORY<br>As many of you may know, Princess Carewee is a plant based homie. Pequod was able to accommodate her with a no-cheese deep dish. The crust was egg-free - we asked. It looked earthly compared to our pie, but she loved it. So yeah, vegan friendly!", "pics": null}}, {"review": {"des": "When in Chicago, we had to try deep dish.  After reading reviews on Yelp and other websites and talking with a few people - we decided to try deep dish here for spot that we served a less touristy deep dish than you'd get near the Loop. <br><br>The place is sort off the beaten path and the L train and is an old school dive bar with dark lightening so wasn't sure what to expect. We were seated right away and saw the sign to expect a 40 minute wait for pizza but it was sort of an odd time (5pm on a Monday) as we were expecting a much longer wait. We ordered some beers and mozzarella sticks and settled in to await the pizza. Not a ton of other options besides pizza and bar food FYI. <br><br>Yes, it met the hype! The crust was doughy with a nice sweet tomato sauce and not a ton of cheese, it was thick and delicious especially the caramelized crust. I was stuffed after eating my first slice of small pizza but had to eat the second slice.  With so many reviews, I guess the secret is out where to grab food Chicago deep dish!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/U1o5ZUNrGxEkkAuygBKNZA/348s.jpg", "caption": "Deep dish pizza"}]}}, {"review": {"des": "A+ Always good both locations! Go there and you will be hooked for life!", "pics": null}}, {"review": {"des": "I came here on a Friday at 1pm and the place was relatively empty. We were seated immediately. The restaurant was spacious enough to have luggages. <br><br>They allow you to call and order your pizza ahead of time because it takes about 45 mins to make. You can also \"reserve\" your spot on a waiting list a day before you plan on coming. See their website for details. <br><br>We started with jalapeno poppers which were good. Tasted like typical bar food. For pizza, I got the lunch special personal pan (available mon-fri until 3pm) with half mushrooms and half meatballs. The pizza came piping hot. <br><br>To be completely honest it was just okay. Contrary to what other yelpers say, mine came with more than enough cheese but VERY little sauce. The pizza was majority dough which I wouldn't mind if it wasn't so bland. The meatballs were flavorful but too salty. The sauce was nice. I loved the burnt cheese on the sides. The bottom of the pizza was rock hard. <br><br>Free soda refills was a plus. Service needs improvement. They seemed understaffed. This was my first time trying deep dish. I'm from NYC and I think I prefer thin slices. Or maybe I just haven't had good deep dish.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EtEes7VUwMaJRMriXqJ9Qw/348s.jpg", "caption": "Side condiments"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/-39MXJbcgoQcCN_ctcJ6MA/168s.jpg", "caption": "Personal deep dish pan with half mushroom half meatballs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8sqYwOBTEquKmDYrQm1Nyg/168s.jpg", "caption": "Jalapeno Poppers"}]}}, {"review": {"des": "We got here right as it opened so we didn't have to wait long. We were quickly seated in a booth and the server brought over waters right after. We opted for the classic cheese pizza. It took awhile to make but all deep dish pizzas take long. <br><br>The pizza itself was okay at best. The sauce was very basic and the layer of cheese was not as thick as I had hoped for. We did enjoy the caramelized crispy crust but that was about it. <br><br>We've heard such good things about this place but we're very underwhelmed. We might try it again in s few months.", "pics": null}}, {"review": {"des": "Being my first time in Chicago I HAD to get a deep dish pizza. This place came highly recommended by virtually every Uber driver, so that is how I ended up here. <br><br>Upon entering the establishment the hostess was extremely friendly and conversational, especially when she found out we were from out of town and having deep dish pizza for the first time. However, I cannot say the same for our server. Perhaps she was just having an \"off day\", but I found her to be quite rude and unfriendly. She acted like she would rather be doing anything else than to be waiting on us.<br><br>To start out we ordered the mozz sticks, as we were informed it was one of their best sellers next to the garlic knots, and I can say they did not disappoint. <br><br>Now being that I was in town on business, and leftovers would be less than convenient, I opted for the personal sized pizza. In hindsight not sure it was the best way to experience deep dish because it is not served in a pan and was quite messy as such. This particular place touts their unique caramelized crust and I have to say it did not disappoint. I ordered mine with meatball, onions and black olives. The meatballs were very tasty but the onions were not cooked enough to my liking. I also prefer more cheese on my pizza, I had a hard time finding the cheese to be honest. <br><br>All in all I can't say I'm a fan of the deep dish, though I have nothing to compare it to. However I'll stick with my thin crust pizza, less carbs anyhow", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Wbr9sw_fpWoFZG85EwWKUw/168s.jpg", "caption": "Personal deep dish pizza with meatball, onions and black olives"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cg0i7e38ULds_lSlkLYjAg/168s.jpg", "caption": "Mozzarella Sticks"}]}}]}