{"name": "portillos-hot-dogs-chicago-4", "reviews": [{"review": {"des": "I was in Chicago for 3 days and I came here 3 times, haha!!<br><br>My bf is from Chicago and one of his first stops is always Portillos. It did not disappoint!!<br><br>Had to try the Chicago dog and it was good, but the  Polish dog with chili and cheese is where it's at. Just trust me.<br><br>Let's be honest the star of the show is the Italian Beef, easy dipped with American cheese and hot peppers. Ooooh mama, yeah I ate 3. :D I haven't had any sandwich in California that's a direct match to that delishisness. Lol.<br><br>This location is huge and I was loving all the decor. You can sit up or downstairs. It's super clean and fast too! There have to be at least 30 people working there at any given time from the register to cooking to sending out orders. <br><br>To be fair, I didn't get the chance to try a beef from anywhere else in Chicago while I was visiting, I'm just glad my first experience(s) was super tasty.<br><br>P.S. don't miss out on the cheese fries! Better yet, just get a side of cheese sauce and pour that sh*t on your Italian beef. You're welcome.", "pics": null}}, {"review": {"des": "My boyfriend and I came here for late night eats around 2am. There was still a good size line and a little bit of a wait. For a popular place, I'm not surprised we had to wait.  That was no big deal so we ordered beers to drink as we sat around. Aaaah, alas our order of hot dogs arrived. We devoured them and felt like we were in heaven.  The next night we were our late again and decided to order hot dogs and chicken tenders. Everything hit the spot. <br>As for the establishment, the place was tidy and clean both visits. The employees were very pleasant. <br>Definitely worth revisiting over and over again!", "pics": null}}, {"review": {"des": "I don't understand what the big hype is. This place gave me the worst stomach ache ever and I wouldn't complain if the food was worth it, but it wasn't. <br><br>We had the hotdog, the chicken strips and cheese fries. Maybe we ordered the wrong thing and after a couple of drinks that night, we may have just ordered the first thing that we saw on the menu but it's been two days and I am still hurting. <br><br>I guess to each their own but definitely not going here again if ever in Chicago.", "pics": null}}, {"review": {"des": "\"And we HAVE to go to Portillo's!\" <br><br>I was visiting my friend in Chicago and she kept insisting that I couldn't leave this city without trying this classic chain. When I asked her what's good there she exclaimed, \"everything!\"<br><br>This place is a casual fast food chain with several options such as hot dogs, sandwiches, burgers, salads, pasta and the like. For newcomers, when you first walk into Portillo's you will be in awe--this place does not look like other fast chains you know. It is decorated in neon lights, large signs, and random memorabilia, capturing the true spirit of American life. All of the food is separated into stations and you order food like you would at a food court. <br><br>After some yelp research, I decided on getting the hotdog and fries. My friend was right, this hot dog was good! It tasted very fresh and had a nice snap to it, not like other pork hot dogs I'm used to. It came Chicago style with a pickle, tomato, some peppers and mustard. I was also able to try some of my friend's vodka pasta and it was very good! It was also HUGE and she ended up having to take the rest home. <br><br>Overall, yes, if you're in Chicago, you need to go to Portillo's.", "pics": null}}, {"review": {"des": "I hate to be that lame tourist who rushes to Portillo's to try a hot dog just so they can brag on yelp, but........ *grabs mic* \"is thing on?\"<br><br>After a long day of traveling we found ourselves here to see why Chicago dogs are so famous. First of all, as a DC girl (I mean DMV before the DC people go crazy) I could not comprehend some of the toppings they had on their dogs. Pickles? Tomatoes? Jalapeño? Stop the madness! <br>Then of course I took my first bite and had to accept that Chicago knows a thing or two about good hot dogs. I was so surprised that the flavors came together from toppings I would never imagine on a hot dog. <br><br>I also appreciate that these hot dogs were all beef! Since I do not eat pork, I never usually get to enjoy hot dogs. It was great to be able to partake. <br><br>Two thumbs up for this place. You did this eager tourist proud!<br><br>Side note: Be prepared for a super long wait for your food. We waited 25 minutes before receiving our order. People were getting upset but I anticipated the wait.", "pics": null}}, {"review": {"des": "*Insert tourist review here*<br><br>I'm a Buffalo native.  We live and die by Sahlen's hot dogs.  They're so good, our out of town relatives stock up on cases of them to freeze and use throughout the year.  We eat our foot long hot dogs with ketchup, mustard, dill relish, and chopped onion.  That's it!  We also typically toast the buns.  That being said, I've heard good things about Chicago hot dogs, so we had to give this place a try. <br><br>I ordered a traditional Portillo's hot dog.  It was a very small hot dog (about half the size of a Sahlen's) and it came on a soggy, seeded bun.  The toppings included tomato, onion (I think?), and a dill pickle.  Interesting. <br><br>I like the idea of toppings here.  I like the real use of tomatoes instead of ketchup.  However, I wasn't a fan of the soggy bun and thought the dog itself was tasteless.  The fries were pretty good.<br><br>I'm open to a Chicago style dog.. but I don't think Portillo's really nails it like the locals claim.  I need some more flavor and a heartier dog!", "pics": null}}, {"review": {"des": "Just to put into context how amazing this place is: I'm a vegetarian and I ate three hot dogs from this place. I had one regular hot dog, one chili cheese dog and one jumbo hot dog. I dragged my boyfriend back here twice more after our first visit because I was dreaming of these hot dogs. They taste very fresh and not processed like pork hot dogs. The sesame bun is a game changer and the peppers and pickle just top it off. Absolutely amazing. And the fries are good, too. It is a must-try in Chicago! <br><br>My boyfriend and I also split a chocolate malt/milkshake, which had actual brownies at the bottom. Again, delicious. When my boyfriend was tired of eating hot dogs, he got chicken parm and some kind of panini. He really liked them and said they were also delicious.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5QY72mpUuRw93FXHkmHK9A/168s.jpg", "caption": "Chili cheese dog"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/D-K4mC7SpqbCh6TuwbzmDA/168s.jpg", "caption": "Regular hotdog"}]}}, {"review": {"des": "So it's tough to give a place that is a chain, that exists in California, and is a bit of a tourist trap more than 3 stars.<br><br>That said, it IS a Chicago institution and if you can only go to one hot dog spot to experience a Chicago dog, this is where you can get a quintessential Chicago dog. It's not the best but I love Chicago-style hot dogs so this place was great to visit. It's also a visually fun spot with a bunch of types of food and you probably need to also get the Italian beef and chocolate cake shake for the true gluttonous experience. Also, as a fan of crinkle cut fries, I enjoyed having that as a side (although I'd prefer for it to be crispier).<br><br>The hot dog is everything you'd expect from a Chicago dog: tomato, peppers, relish (which was mild - something I appreciated as someone who doesn't love relish). The hot dog itself was just okay. It would have been nice if it had more flavor but it was good enough to hold up to everything else.<br><br>The Italian beef was fine but not a ton of flavor and I had it because you're told you had to have it. But I think most people can skip it and maybe go to Philadelphia and get a Philly cheese steak which is far superior.<br><br>The chocolate cake shake was RICH. Basically they took a chocolate cake and blended it into a shake. It was good but you can't have one by yourself or else you'll feel sick.<br><br>Finally, we had a beer because...why not? The beers here are HUGE so just an FYI.<br><br>All in all, love the decor and experience, it was a good enough Chicago dog and I'm glad I came.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WGM4vlH4e6QXUwRQE1pJ8w/348s.jpg", "caption": "their Chicago dog"}]}}, {"review": {"des": "This place is a must if you live in Chicago or are just visiting. This place is definitely for your \"cheat da\"y if you are on any sort of diet. <br><br>My favorites are the char-dog and hotdogs. They do have a drive thru which is appreciated since it can be a challenge to find street parking depending on the time of day. <br><br>The inside is massive and a little touristy. I like to go in when I can to order just to watch all the food being made and marvel at the efficiency. They are always busy but you never are wait too long. <br><br>I'm super boring so I order the char-dog with just ketchup. The last time I think they accidentally made a Chicago style hot dog at first.  Instead of throwing it away, they just threw it in the bag anyways so my partner got to try the dog to without me having to share mine *score* Their hotdogs are definitely one of the best I've ever had. The fries are crispy and always hot. I've heard their chocolate cake is amazing but I've never tried it myself. I've had their shakes and I don't think they are anything special. <br><br>If you are anywhere near this place next time you are in town, you gotta go!", "pics": null}}, {"review": {"des": "Good ambiance and fun beer hall type of place. Ordering and getting order can be hectic but the food is good. We shared a beef sandwich, really messy but pretty good. We ordered it not dipped but it was dripping.<br><br>Beer is super cheap, at least from my standards. A giant chalice for $5.50", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/C3XJsJn0C0H_pl0VKT-0MQ/348s.jpg", "caption": "Chocolate cake shake and beef dog"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RAZEYnQQgkR9EEbsgfHDag/168s.jpg", "caption": "Beef dog"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/wXTztgYqjkQDsGkdz8S2Wg/168s.jpg", "caption": "Beer chalice"}]}}, {"review": {"des": "I'm sorry Chicagoans, this was a big let down for me and a huge bummer! People love it here and I'm not quite sure why. Maybe the burger is good, who knows. But I came here for the hot dog and I was disappointed.<br><br>The place is big with menu items other then the hot dog to choose from. After placing your order, you wait for your number to be called. I just got a chicago dog and ended up waiting close to half an hour. I also got a strawberry shake and for some reason it wasn't ready by the time I picked up my hot dog. Which isn't a huge deal, but there wasn't synchronization. Like no one behind the line communicated so that everything can be ready at once. It isn't like drinks take that long. Honestly, it just seems like there was a lot of goofing around behind the line. Maybe that's why orders take so long. I'm not saying don't have fun at work. Just don't be goofing around if you know you got a packed house. <br><br>For my Chicago dog, it was a sad soggy hot dog. I could barely pick it up to take a bite before it all fell apart. And I know why it was soggy! The dogs are sitting in a big water bath to be kept warm. Yum right? And the guys behind the line just takes the dogs directly from the pool and just slaps it onto the bun without really shaking the excess water off. I was admiring the assembly line from the window they have by the registers when I saw the horror. <br><br>I won't be back and I definitely wouldn't recommend this place. At least not for hot dogs. You can make a better one at home.", "pics": null}}, {"review": {"des": "The second time I've been here and second time must be a charm.  This place has amazing atmosphere.  There is a whole old-timey Chicago city theme going on.  There is a second story that lets you look down on the whole place and it is extremely comfortable.  <br><br>I tried the Italian sausage and was pretty satisfied.  My colleague tried the chili dog and although tasty, regretted it very much that night.<br><br>So moral of the story, if you're going to get the chili dog - be prepared.", "pics": null}}, {"review": {"des": "Hiii Portillos! Coming from the Bay area I assumed Portillos would be the Chicago version of our In-N-Out, good quality fast food, but instead of burgers they specialize in hotdogs. I was way wrong!<br><br> It's a Disneyland of American foods. There is ONE order line for all the food items, from there you go to your designated counter station until they call your order number. <br><br>We got in at 7pm on a busy Monday night. Pasta was done in 10 minutes, beer was instantaneous, but the dogs took HALF AN HOUR making Portillos a not so fast food joint.<br><br>Note: alcohol line is a separate line(order and pick up).<br><br>FOOD/DRINKS:<br>1.) Pesto Chicken and Mushroom Pasta- 5 stars- very well seasoned and comes with bread. This would easily cost you $17 at Olive garden. Our cost? $10.50.. Winning! It was actually a creamy pesto sauce which made me love it more. Yum!<br><br>2.) Hacker Pschor(?) beer- $5.58. This is a light beer with a slightly tart/acidic end note making it great to cut all the delicious fatty foods.<br><br>3.) Jumbo dog- 4 stars. Go jumbo, bc you need the extra meat to fill all that bread! Came with Xmas green colored relish, onions, 2 chilis, mustard, and a quartered pickle. It was good but not as good as the chili dog or pasta. Sorry Portillos. P.s. I would have liked my pickle crunchier.<br><br>4.) Chili dog- 4.5 stars, the dog and bun were good but ordinary. The chili was wonderful and tasted homemade. Meat sauce was delish but the whole beans in the sauce made all the differences, giving this meaty chili sauce great texture and consistency.<br><br>Would definitely recommend and return to this establishment!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kxcDpkHwh-o4Mugpfm-Nlg/348s.jpg", "caption": "Hii chili cheese dog, see you again soon ;)"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/p-jNmInpT-LMNiDZntLJFw/168s.jpg", "caption": "Salad/pasta/sandwich station"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/5aUdJkCIeURs6z5GctlaDA/168s.jpg", "caption": "Outside view, it's across the street from the TWO STORY McDonald's"}]}}, {"review": {"des": "Portillo's was our first stop in Chicago. It was ten minutes walking distance from our hotel which was very convenient. Inside the building are a few other eateries besides Portillo's. The line to order was maybe 5-7 minutes long so that wasn't too bad. However the wait to pick up food was very long. It took about 20-25 minutes for us to get our food. <br><br>+ Portillo's Beef Hot Dog - 10/10 - my boyfriend and brother ordered this. I had a bite and it was pretty good.  <br><br>+ Big Beef Sandwich with Hot Peppers - 9/10 - this was pretty good. The sandwich was huge and could easily feed two people. I wish the bread had been a little crunchier pre-dip but it was pretty good. <br><br>+ Fries - 7/10 - these are your standard frozen crinkle cut fries. They definitely could've used a little salt but they were fine.   <br><br>+ Vanilla Shake - 9/10 - this was a freebie we got for taking the survey at the bottom of the receipt. It was pretty good. I'm definitely glad I took the survey!<br><br>Overall the experience was good. If the service would've been a little faster, it would've been great.", "pics": null}}, {"review": {"des": "I try not to eat too much fast food, but I can't seem to stay away from Portillos. This is one of the busier locations but is worth the wait. The burgers, hot dogs and fries are amazing. But don't forget the cake shake! It has bits of their amazing chocolate cake in the shake. <br><br>The chopped salad is one of my go-to salads. Not many fast food restaurants have me salivating over a salad! They even serve alcohol. In the summer they have a small outdoor patio and the efficient drive through I've ever seen.", "pics": null}}, {"review": {"des": "I'm not a hot dogs girl but let me just say: PORTILLO'S IS BOMB!! I literally came here 3x out of a 5-day trip. That's how good it was!! Trust me, and I'm from Texas. I  even cried on Halloween weekend because Portillo's wasn't open past midnight to satisfy my drunk munchies. I even considered buying one to take home on the plane.<br><br>Get the Combo Beef & Char-Grilled Italian Sausage! For only ~$5, think of a melty beef steak sauced with gravy flopped over a juicy sausage! You can get the gravy dipped or drizzled in the sandwich. The first bite of beef steak was reminiscent of Philly Cheesesteaks and there's enough much meat to feed two people. If you're making it a meal, get it with fries+cheese dip and a strawberry shake. You won't regret it!<br><br>There's always a line, but it moves fast. One line for ordering and one for pickup. Vibes are fast-food casual diner style with open seating. Please do yourself a favor and experience a true Chicago Portillo's!!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cx_Vrmh7iiaJ3Y6ykgVJhg/348s.jpg", "caption": "Combo Beef and Chargrilled Italian Sausage!! So good!"}]}}, {"review": {"des": "Never having a Chicago style hotdog I was skeptical on having my first from a chain restaurant. Portillo's exceeded my expectations. This restaurant may be a chain but it certainly does not taste like it. <br><br>We ordered two Chicago style dogs and onion rings. The hotdog itself was absolutely delicious and the onion rings were perfectly crispy. <br>Happy with my choice for my first Chicago hotdog sad I didn't order another.", "pics": null}}, {"review": {"des": "3.5/5<br><br>In Chicago, one must have three staples: deep dish pizza, Chicago hot dog, and italian beef. I had deep dish pizza several times (love it) and a Chicago hot dog once (not a fan, sorry), but haven't really had italian beef aside from Luke's. In my recent trip back to Chicago, I decided to give Portillo's a try.<br><br>This branch isn't really a dine-in restaurant, but more of a food court style with lots of seating. Trying to act like I'm a natural in this, I memorized exactly what a local told me to order:<br>\"Italian beef, dipped\".<br><br>Sure enough, the sandwich was dipped good. Gravy everywhere on my sandwich (followed by my hands). The beef, gravy, and sandwich were all very good but...it wasn't hot at all. Lukewarm at best. I wonder since the place was extremely busy, they left my food sitting for a bit too long since it did take a while.<br><br>Service was fast and it was a well oiled machine. However they were far from friendly. Probably shouldn't be surprised considering efficiency is key here.<br><br>I ended up finding a better place for Italian beef the next day for what its worth.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sBggZi_XICcgH8q-3qZFwA/348s.jpg", "caption": "Italian beef, dipped"}]}}, {"review": {"des": "This is a must on the tourist to do list, get a beef sandwich extra gravy or else the dipped one makes it too soggy!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FyJOwzpRIBcDMV_P7x__4Q/348s.jpg", "caption": "Black fridays are for hotdogs"}]}}, {"review": {"des": "I have to agree with other yelpers that these Hot Dogs won't really blow you away. I get it, Portillo's has a cool atmosphere, it's cheap ($3 for a beef hot dog), and I do believe you rather come here for the \"experience\" than the actual food. <br><br>Stepping into the place, it was buzzing and there were 3 long lines of people waiting to order. The line moved very quickly and ordering went smoothly as well. I wasn't sure how big the Hot dogs were so I ordered one of the Portillo's Beef hot dogs, fries and a coke. <br><br>The hot dog itself was soggy and quite sad looking and it starting falling apart when I tried to pick it up. Overall, okay taste. But I have to admit, I liked the fries better than the hot dog.<br><br>I would definitely tell people to at least try it once, even if you're only here for the buzzing and fun atmosphere.", "pics": null}}, {"review": {"des": "The place has solid hot dogs but I really liked the fries they had.  The fries are pretty crunchy.  We came right when it opened, so it wasn't as packed and we got our food right away.  The bathroom is in the upstairs area!", "pics": null}}, {"review": {"des": "Coming to Chicago, I knew I needed to get the famous Chicago Dog. I stopped by Portillo's and was not at all disappointed. Ordering line is toward the right and you wait for your number to be called to pickup your order to the left. Don't forget to grab a tray if you plan on dining in because there aren't plates provided!<br><br>And don't even think about putting ketchup on that beautiful Chicago Dog, it is a masterpiece just as is: I loved the poppy seed bun, the sweet (and so spicy) peppers, and that pickle wedge!? Scrumptious! I liked how the dog was not too pricey (almost $4) so you can also have money (and room) for their famous Italian beef or their also famous chocolate cake shake. Heck, GET BOTH! <br><br>The Italian Beef was delicious (and yes... a bit soggy) and the shake was out of this world! It's basically a slice of their house made chocolate cake at the bottom of the cup with pieces of cake and ice cream mixed in. The straws provided are regular soda straws and that shake is thick, so the hardest part is waiting for the shake to melt a little so you can drink it... It's all part of the experience!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/K46tXe4dsx9sAPkm4Sfd3A/168s.jpg", "caption": "The famous clock face"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/lOl0iJ5YNs3HMiXcwtTgbQ/168s.jpg", "caption": "The decor!"}]}}, {"review": {"des": "As a visitor to Chicago, I'm no expert on Italian Beef sandwiches, or just \"beef\" as they call them here. So I forgot that while a Philly cheesesteak by default includes peppers and onions, and usually cheese, a beef does not. So order added toppings if you want them. I got mine fully dipped, or sopping dripping wet with au jus gravy. Messy but delicious.<br><br>We encountered an employee named \"Mama T\" who seemed to serve an ambassadorial role in the dining room here, helping amateurs with their orders, giving away slices of cake, and just generally adding lots of cheer to the experience. She can sing a soulful Happy Birthday like I had never heard before. What an asset this lady is to Portillo's!!<br><br>I had a cold Fat Tire draft in a frosty glass, and Mama T unexpectedly added some onion rings to my bag. Crispy and yummy. Fries were good, Chicago hot dog looked standard and good. <br><br>Chocolate cake is famous and deservedly so. The frosting is very sweet and tastes like raspberries. Next time I'll try the Chocolate Cake Shake.<br><br>Ask for Mama T if she doesn't find you first.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0z58fOyilGYUz_avkyfNpA/348s.jpg", "caption": "Onion rings, fries."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5_hHIVUfPoyKW1pS3bRsSA/168s.jpg", "caption": "Chicago Hot Dog"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/gebI-ljFIOOiaOCbiF1lfQ/168s.jpg", "caption": "Italian Beef with cheese, peppers, etc."}]}}, {"review": {"des": "Me and my gf were visiting Chicago for the weekend, and were told Portillo's was a must visit for Chicago food. Upon entering this location, I was a a little confused. It looked like an open food court with multiple counters to order from. It seems as though you line up towards the back right, but even then it splits up into 3 cashiers in front with a random cashier to your right. There also seems to be a drink vendor to the left and a dessert vendor to the right.  Honestly it's unnecessarily complicated. <br><br>Eventually we got our food. And it was delicious!  Before arriving me and my gf had plans to each order something different, and we'd go half and half. I got the Italian beef and she got the Polish hot dog. I found myself wanting the Italian beef all to myself. Luckily she was happy with eating all (minus a bite I tried) of her Polish hot dog.  We also got the cheese fries and vanilla custard, also delicious. <br><br>I can definitely see why this place came highly recommended. The only fault I see is the unnecessarily complicated ordering queue. Would definitely come back here again though.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tKfVJHzgIznP7HiXZZRa1A/348s.jpg", "caption": "Vanilla custard"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/UKYH7KnPoy6gouA54t8OCA/168s.jpg", "caption": "Polish hot dog"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CCyWvC1cPs3o_tH1QxBTQg/168s.jpg", "caption": "Italian beef"}]}}, {"review": {"des": "This is a must hit spot every single time I come to Chicago. It's so good and you get so much food for the price you pay. I always get the Italian beef with spicy peppers and fries with cheese fries. <br><br>Still never tried the chocolate cake because I feel too fat after finishing my meal, but it sounds delicious. <br><br>Definitely try this place!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UQRfR6CKgvXu5GYmyMzKFA/348s.jpg", "caption": "Italian beef add spicy peppers"}]}}, {"review": {"des": "What a fun place to have dinner out with the family. I went here as a must stop joint with my boyfriend's family for their family reunion and it was so memorable. The decor is wacky, the service is super friendly, and the food is stick to your ribs type comfort food.<br><br>We got the italian beef dipped which means the sandwich is quickly immersed in hot au jus and ordered cheese fries and a chocolate shake on the side.<br><br>We made the mistake of ordering our sandwiches without any peppers or cheese which made the sandwiches taste pretty bare. The beef itself was thinly sliced and tender and the cheese fries were almost identical to the ones you would order at a Shake Shack. Thick salty cheese - how could you go wrong!<br><br>The shake was delicious and the perfect addition to all of salt I was consuming that night. Along other things this place had tons of options, hotdogs like the name implies, pasta, you name it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/9yvAchLl2Bjwd50oo_mOig/348s.jpg", "caption": "Italian beef sandwich with cheese fries and a shake"}]}}, {"review": {"des": "We wanted get some trashy Chicago food and was in a pickle between Portillo's and Al's Beef. We ended up at Portillo's because they also had the famous Chicago dog. <br><br>The place was pretty cool, and big- plenty of seating. Upstairs as well. The line went fast, but it took about 10-15minutes to actually get our food. It was so packed around lunch time for Monday. Looks like tourists and locals. <br><br>We got the Italian beef sandwich and the Chicago dog. I love how the beef sandwich is wholly submerged in the au jus. It was simple yet good. The hot dog was alright, the sausage itself was a little sweeter than the normal hot dog, but the toppings are awesome. It was pretty thin and small... After we left we felt like we could have gotten another order!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VMA-8LHyRR3oCtsei0NssA/348s.jpg", "caption": "Inside"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XSlCThmJx1_AZTb0c2NMAg/168s.jpg", "caption": "Chicago dog"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Kx3_ZPl3rH8Z4uEZ9Rm5uQ/168s.jpg", "caption": "Beef sandwich"}]}}, {"review": {"des": "Must try their Italian beef and Chicago dog. Between the two, I liked the Italian beef more, but it's worth trying their hot dog style. The big beef is the same as the Italian beef but bigger. Definitely sharing size unless you're hangry haha. <br><br>They serve beer and drinks but you order that from the left side near where you pick up your food. <br><br>There is usually a long line but it normally splits. So look for that because some people don't know that there are two lines and it makes it look really long. The wait goes by quickly though! Definitely worth the wait! Ended up coming here two days in a row during our trip to Chicago.", "pics": null}}, {"review": {"des": "Ok. So as a Chicagoan, I can say this is as 'Chicago' as it gets. <br><br>The hot dogs are great with a boat load of toppings - relish, onion, pickle, tomato, and mustard; remember, no ketchup! :) I also like the crinkle cut fries that are the perfect amount of crispy and saltness. <br><br>Personally, I think the Italian Beef is so-so, not worth the hype. You can also add sweet peppers which is my go-to anytime I have Italian Beef, Portillo's or otherwise. The beef is thinly sliced, but drrryyy. I would recommend getting the 'dipped' option because of that fact. <br><br>The queue to order is a bit confusing. You line up in a single area but the cashier stations are split at the corner while the pick-up area is at the other corner, so you have to wait for your number to be shouted. So if it's a busy day, it can get quite hectic. The atmosphere I would say can best be described as indoor food vendor with open seating.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Arfyg3TGT1Hl2gz3Pt4c4g/348s.jpg", "caption": "Indoor vendor/food court atmosphere."}]}}, {"review": {"des": "OMG first timer for a Chicago hot dog and first timer for Portillios<br>prepare for a long wait i ordered two Chicago hot dogs and we waited about 30 mins<br>i was shocked by how good the hot dogs were and how much i loved them i was only in town for a day but this place has been bookmarked for weeks<br>my Bf and i were torn if we should hit it up one more time before our flight but couldn't risk missing the flight with the wait<br>my only complain would be the ordering system but everything else was 5 stars", "pics": null}}, {"review": {"des": "With 4,500+ reviews as I'm writing this and I'm sure more by the time you're reading this, not sure there's anything new to say about this Portillos.<br><br>Pretty conveniently located and (key for the weekend drunchies) open very late. This Portillos manages to be an overwhelming hectic mess, not to mention packed, at any hour of day and time of week. The layout is massive and decorated with an old school kitsch. <br><br>The ordering system is a little confusing. You line up in one cashier line that is in the back right from where you walk in. After, you collect your receipt and pick up your food on the respective stations - there's a bar, hot dog / other station, and a pasta / salad station. The numbering system is not consistent or numerical order so you must just listen for your number. Pickup station especially for hot dogs / etc tends to be absolutely mobbed.<br><br>My favorite is the Chicago hot dog here, which comes piled with toppings and comes with some snap. The Maxwell street polish is also delicious with some really flavorful grilled onions.<br><br>Yes, they do actually have ketchup (only in little packets) if you ask.", "pics": null}}, {"review": {"des": "This place has the lunch hour tactics down! My friends and I were in and out with no problems whatsoever. Prices are higher due to the location, but you can never go wrong with Portillo's. I usually get the ribs or hot dogs which are great!", "pics": null}}, {"review": {"des": "Every major US city has legendary food institutions that can be separated into two very distinct groups - they either a) will always coast by on their name alone, but have clearly seen better days or b) are as popular as they are because the food is just that good.<br><br>Portillo's most definitely falls in the latter category.  The Chicago style dog is absolutely perfect.  The chocolate cake shake is essential and must be experienced in life at least once.  And what an impressively well-oiled machine this whole operation is!  For the number of people in line at any given time, they churn out the food extremely quickly but without it feeling rushed or glossed over.  <br><br>A must on any tour of Chicago for a reason.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AXuxLPgMMmwLFqy085df7g/168s.jpg", "caption": "chocolate cake shake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/M_ZiWvPrSIliZTw53mcHpw/168s.jpg", "caption": "Chicago style dog"}]}}, {"review": {"des": "This place is garage and stay away! Look at my bun for my char Italian sausage. Yuck! Just nasty and unprofessional. Ordering my food was great but getting my order was a complete nightmare. They called my order and I had to ask for my milkshakes, which was fine, but why do I have to ask again? <br><br>I threw my food away in the trash where it belongs. How dare they serve me food like that! Portillo's sucks! The best thing about this place are their cashiers AND THAT'S IT! Unprofessional children who hand out incomplete orders and explain nothing at all. The milkshake was thrown away as well. <br><br>This place was so nasty you can keep my $$. Nothing fresh. Everything ordered was old & cold. Runaway and never look back!", "pics": null}}, {"review": {"des": "Yes! This is where it is at for the Chicago Dog! I had two in my stay here and they were both excellent - although, I will note that having a fresh dog right off the cooking contraption is a little better than waiting an hour for it to be delivered. Anyway, it doesn't need any ketchup or other condiment in my opinion - just have it for what it is. <br><br>As of the decor and the vibe of the place - it's a big place, almost like you've stepped inside to step outside because it looks like a street corner! The service is pretty good and they have a whole lot more than just hot dogs. I will return and when I do, I'll finally try something else like one of their grinders or their chocolate cake shake I keep hearing about. <br><br>Either way, if you're visiting Downtown Chicago, this is the place that you must visit as Portillo's is a big reason in why the Chicago Dog is so popular.", "pics": null}}, {"review": {"des": "Everyone says come here for two things: <br><br>Chicago style hot dog <br>And <br>Chocolate cake. <br><br>Leeeeeemmmmeeee tellyaaa. I'm from okc and I get better Chicago style hot dogs from Sonic. Plus they got the guuuud ice.<br><br>Their hot dogs? Although they're built in an impressive assembly line of workers, are mediocre. Buns soggy, who likes soggy buns unless you're trying to down a bunch of dogs by dunking it in water? Relish is gross. Dawg is smol. All around MEH. <br><br>Cake? Moist. Rich. But that's kinda where it ends. Maybe I had high expectations since my friends went ON and ON about this cake. <br><br>But I will say TRY THE CHILI! I would come here just for the chili. Super flavorful and warms up the nostalgia. <br><br>In regards to the establishment itself, it's packed. There are two lines to order your dogs. Then another crowd to wait for your dog. And a different line if you want desserts. There could have been another line somewhere, heck I don't know. <br><br>Most seats were taken but we sat outside and there were a few open but it may be a good strategy to have one person order while another hunts for the elusive empty albeit dirty table. <br><br>Try it if you just, but you're better off trying a smaller chain.", "pics": null}}, {"review": {"des": "The best Italian beef ever!  <br>Take a pass on the hotdog and the chocolate cake milkshake.  <br>The environment is worth the visit", "pics": null}}, {"review": {"des": "Ended up here with my boyfriend while walking around the city hoping to find something to eat late-night. Lucky us because we stumbled upon this legendary place. The hot dogs were TO DIE. Don't make any substitutions, just eat the thing and appreciate your life. <br><br>People watching was super fun too! Some people were super dressed up, coming from a fancy event and others were as drunk as us and eating hot dogs like it was their last meal hehe <br><br>Don't even think twice about it, you have to eat here if you're visiting Chicago", "pics": null}}, {"review": {"des": "As a tourist, I had to try a Chicago dog, and my research showed that Portillo's was pretty much THE place to get one. <br>In line, I struck up a conversation with a local who said they come at least twice a week (!!) and said that their Italian beef and malts were also top notch so ended up going for the trifecta.<br>- The hot dog was good - definitely different and unique but I could appreciate the pickle and the neon green colors and the lack of ketchup, and I'd go for it again.<br>- The italian beef was also solid, if not a bit salty and soggy from all the gravy. <br>- The malt was standard - enjoyable but would probably have rather traded the calories for another chicago dog or two haha.", "pics": null}}, {"review": {"des": "Everyone swears by a Chicago hot dog but I don't see get it. The location is huge and offers plenty of seating. When you walk in, you feel like you've been transported back in time. There are a bunch of props and the decor is interesting to observe. The prices here are definitely reasonable but the service could use some improvement. <br><br>I just got a Chicago hot dog and I thought it looked pretty sad. It comes with everything, which includes mustard, relish, onions, tomatoes, pickles and peppers. While there are a lot of toppings, I thought the hot dog itself was mediocre. Don't commit the cardinal sin of putting ketchup on your hot dog! If someone spots you doing that, don't be surprised if you get dirty looks. <br><br>Anyhow, I don't see the allure of a Chicago hot dog. I'd much rather prefer a dirty dog in LA or even a Costco hot dog!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/s0yGn3pia4WKDEWftKUa3w/168s.jpg", "caption": "Chili dog"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Plch-DAJa_etdo21hsghAA/168s.jpg", "caption": "Chicago hot dog"}]}}, {"review": {"des": "Simple but great! The bun is very soft and the hotdog pops when you bite it. This place is very busy but efficient. You line up on one side and pick up on another. <br>We chose the traditional hot dog and the chili, cheese hotdog and onion rings. We also opted for the chocolate cake and the chocolate eclairs. <br>The chocolate was honestly just ok. The eclair was not that good and had a weird after taste.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/3tTksh1YlwbSmABz7r7KWg/168s.jpg", "caption": "Piece of Portillo's Famous Chocolate Cake. Piece of Chocolate Eclair Cake"}]}}, {"review": {"des": "Portillo's is a Chicago institution and I've loved it since the first time I've walked into this location. There's always an energy and life to this place, even when I've come here later at night and not at a lunchtime rush. I've taken my mom and some friends here, and they're generally a fan. I've tried the chocolate cake (indulgent and rich, but so delicious), their French fries (solid), and more recently, I've been eating their pastas for lunch since I started working in River North.<br><br>Their chicken pesto is just okay, decent, but not worth getting again. Their fettuccine alfredo is delicious though - heavy and creamy. One of my coworkers loves it so much that this is the first thing he got at Portillo's and he still has yet to order anything else. I've also had their chicken siciliano pasta, which is heavy on the garlic, but delicious. I feel like I could go here so many times and try so many different things on their menu, and never really tire.", "pics": null}}, {"review": {"des": "Portillo's Hot Dog is excellent!!! I was told to come here by a Chicagoan. His advice was try the chicago dog and then literally anything else is good. <br><br>Line move fast and they're super busy. Italian beef was also amazing. Gotta move quickly though! people will be upset if you stand around thinking about your choices.", "pics": null}}, {"review": {"des": "Flavorful hot dogs.<br><br>The waiting line was long but the service was so fit that we barely waited before we got the order and the food. You will start the order in one line and then pick it up at another line. Seating is open seating, so wherever you find seat you would just go and sit there. There's actually a lot of seats upstairs so don't worry if it seems like a super busy place.<br><br>These hot dogs were just about the same size as the ones you would see outside of home depot. But the texture of the hot dogs were firm, and you could tell it was made with real meat. But if you ever had SAMS clubs hot dogs, these can't compare to those. <br><br>I loved the pickles that were added in the hot dog. <br><br>I didn't try anything else so I can't speak for that.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oVHLLbaf5-9MTAk1QldZcQ/348s.jpg", "caption": "Chicago dogs !"}]}}, {"review": {"des": "Went here for a late lunch today with the bf. As you walk in, a staff member asks if you're from the area or out of town and walks you through the process as needed, which is nice. There's 2 lines to order then when your number is called, you go to the other side of the room to pick it up. Tables are hard to come by despite how big the place is.<br><br>We got a hot dog with everything, polish dog, chili cheese dog, and fries. Out of the three, the hot dog was definitely the best. All of the toppings just gives it so much flavor! But apparently you're not supposed to eat it with ketchup .", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/pdxW5v0x_XAydMfZqIxGOQ/168s.jpg", "caption": "Hot dog"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5Tc1p5aTIUOtWxqPkZPtTQ/168s.jpg", "caption": "Char-Grilled Maxwell Street Polish"}]}}, {"review": {"des": "A favorite of mine to visit every time I visit Chicago. I know the hot dogs are delicious always!<br><br>This is a standard Chicago hot dog place but it includes several other stands within the same complex--including ribs, burgers, pastas. <br><br>It is always brimming with people both visitors and regulars alike! Can't go wrong with Portillo's!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h-eynVfulM6HhYy31CgLEA/348s.jpg", "caption": "The classic beef hot dog"}]}}, {"review": {"des": "This place was better than other Portillo locations. Not that I don't like other locations. But overall, just had a better vibe. <br><br>The italian beef seemed even more huge than at other places, and the hot dogs were great loaded with everything. The Polish dog was definitely tastier though. <br><br>I never had beer here before, so that humongous, heavy beer cup was a shock.  In a good way. <br><br>The girl who took our order was friendly and helpful. But the people serving out the food were, hmm shall we say, pretty rude. Our order took a long time coming out (a whole bunch of people who came after us got their orders before ours got called). While waiting, we noticed some people not coming to pick up their order right away (e.g. number 72) and after calling that number 3 times, some other person started getting really sassy on the mike (\"number 72, last chance, come and get your order NOW\"). <br><br>Still, a good old Chicago place for a late night beer and hot dogs!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DFi_6JWsXLnxdQBX6jVjOw/348s.jpg", "caption": "crinkle fries. not my cup of tea"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/T8tSyrUYsDwVtC8NjcLR1g/168s.jpg", "caption": "loaded hot dogs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vFAW0tosc3rDhw71gpIuLQ/168s.jpg", "caption": "au jus that got leaky. (they got us another one) check if you're taking it to go!"}]}}, {"review": {"des": "Opens late.<br><br>Junky food that is markedly better than the usual chain. <br><br>Nuff said.<br><br>Not remarkable enough to remember anything about the food. It was good and satisfying.", "pics": null}}, {"review": {"des": "Portillo's was one of my first stops in Chicago. I didn't have high expectations for the place because it was so obviously a tourist trap. However, the food was quite good! <br><br>My boyfriend and I ordered the chicago dog (with everything on it), the italian beef sandwich with added hot peppers, cheese fries, mango smoothie, and the strawberry shortcake dessert. <br><br>The Italian beef sandwich was our favorite even though the peppers were SUPER spicy. The meat was cut thinly and the bread was a little soggy from the gravy, but it was so flavorful that I wanted to wait in line for another one. As for the chicago dog, it had a bite that could be felt around the world! I don't know how they cooked the hot dog, but the snap was impeccable. The toppings, on the other hand, was just as you would expect. I contemplated on whether I should get in line for the chili cheese dog. I thought about getting in line again a lot here... The cheese fries were... cheese fries! It was your average, but still addictive. The mango smoothie and strawberry shortcake weren't memorable and I don't think worth your money here. <br><br>The service is on a different level. I've experienced something similar in New York City. The employees could care less about the customers and I felt like I was actually bothering them. I didn't mind too much because I atrributed it to the Chicago way? Anyways, just don't expect a friendly vibe here.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kMv3WWEh-GVWKVkn13FlcA/168s.jpg", "caption": "Cheese fries"}]}}, {"review": {"des": "This is also another five star review on my list from my trip. This place has some of the best Chicago dogs in the area. Customer service is fast and friendly. The restaurant is roomy and big and clean. And we didn't take long to get our food. The chocolate malts are amazing and the onion rings are perfect! They're not too big, they're not soggy, they're not overcooked, and they're absolutely perfect! I'm glad we stopped here for the perfect Chicago dog on our way home of our road trip", "pics": null}}, {"review": {"des": "5 stars for a hot dog?? Absolutely!<br><br>When you step inside it looks like pure chaos, people milling around and loud chatter fills the room.  There is plenty of seating on the main level and upstairs, you find your own table.  We were here for Chicago dogs and their famous Chocolate Cake Shake.  You order at the window and then merge into the mass of people waiting for their number to be called, we came late afternoon and there was about a 10 minute wait for our food.  <br><br>Chicago style hot dog consists of: mustard, relish( a very interesting neon green color) celery salt, onions, tomato, pickle spear and sport peppers( hot!) served on a poppy seed bun. Love the crunch of the dog with the crunch in the pickle and all the toppings that are piled on. <br><br>The chocolate cake shake is exactly what it sounds like, puréed cake in ice cream.  As weird as it sounds it has a great taste.  <br><br>All my future stops in Chicago will include a stop at Portillo's.", "pics": null}}, {"review": {"des": "You want a real authentic Chicago dog? Come here!! After several recommendations from uber drivers we arrived. The hotdogs were so delicious that I can't even think of the right words to describe them.  My friend and I enjoyed every bite!", "pics": null}}, {"review": {"des": "BLUF: A classic Chicago hotdog spot that provides great quality at a reasonable price. <br><br>I've heard only great things about this restaurant to try a classic Chicago hotdog. Upon entering, you could see pictures everywhere from all the famous individuals and celebrities that have visited this establishment - it's quite impressive! It also is way more spacious on the inside than it  looks from the outside. We went at a quite busy time as to be expected with Lollapalooza in town, but it sounds like there is always a line at this place. I was surprised with how the staff received the number of people ordering, staying calm, professional, and at times, even humorous! <br><br>We order the classic beef hotdogs, and they were different than any other hotdog I've had before! The combination of beef hotdog, poppyseed bun, dill pickle, peppers, tomatoes, fresh relish, onions, and mustard made for quite the taste. It was a tad bit salty for my taste, but was to be expected with some of the toppings and additions. However, each bite was delicious as I finished it off before I knew it was gone! <br><br>In conclusion, I am usually not a fan of hotdogs, but was pleasantly surprised with this great Chicago classic. I'll definitely be back next time as I have heard amazing things about their Italian Beef sandwich!", "pics": null}}, {"review": {"des": "The food was not good enough to redeem the HORRIBLE experience we had. I was looking forward to this place so much but left almost in tears...<br><br>Placed our order and waited. They called our number but only 2/5 items we ordered were in the bag. Huh? Had to force my way through the huge mob of customers back to the pick up counter. Employee was completely unhelpful. I asked her how it was possible to have handed me a bag with less than half my order in it and she said it happens all the time. I waited another 15 minutes and had to ask/remind her 2-3 times for the remaining items (2 hot dogs and a sausage....not complicated) during which time 3 other customers approached the counter to complain that their orders were also missing items!!!<br><br>It was completely chaotic, no system in place, employees just didn't seem to care (which in all fairness, I don't blame them... management needs to come up with a new workable system because the one they have is not efficient). <br><br>Save yourself the headache and go somewhere that actually values their customers and doesn't treat you like they're doing you a favour by giving you food. Worst experience in Chicago on our trip so far....", "pics": null}}, {"review": {"des": "What a fun place to experience a casual meal! This venue is a large hall with multiple order-at-the-counter options. All of the food looked good - I personally opted for a chicken sandwich. It was huge, fresh and delicious. <br>It was convenient to seat yourself after you get your food. At lunch time on a Saturday, I only had to scan the crowd for a few minutes before finding a seat. <br>Fun, delicious, casual!", "pics": null}}, {"review": {"des": "Portillo's Hot Dogs is a chain of fast food restaurants around Chicago, and their flagship store is located in downtown near all the major tourist destinations. This large and unique restaurant is on Ontario and Clark with only street parking available. <br><br>Inside is a crazy mess with several lines for ordering and receiving the food. Their menu is Chicago classic with loaded hot dogs, Italian beef sandwiches, red sauce Italian dishes, and much more. You can order anything from any window. <br><br>On my trip I opted for the Italian beef and sausage sandwich with extra gravy. This is a classic Chicago treat with a grilled sausage topped with thinly sliced beef. You can add additional au jus gravy for flavor. Make sure to request either hot or sweet peppers since they did not offer them by default. <br><br>Portillo's is a fun destination for tourists. The inside has a lot of seating and Chicago memorabilia. The food is also legit satisfying that craving well. There are better dogs and better beef, but the downtown Portillo's is hard to beat.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lxQqIPZo6SnW74Hekfa91A/348s.jpg", "caption": "Restaurant Interior"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Gq0iMTHCpqiq8FKaHJ0EcQ/168s.jpg", "caption": "Order Counter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/h500wR5LoRFJbO1qxAkkFQ/168s.jpg", "caption": "Big Combo Beef & Sausage Sandwich"}]}}, {"review": {"des": "This place is packed and really popular.  In terms of hot dogs, it's not bad.  The chili is good on the hot dog.  The chocolate cake is tasty.", "pics": null}}, {"review": {"des": "Good food but HORRIBLE customer service. I came here with a friend a little after midnight on a Monday. We ordered the chocolate cake, burger, fries, and and the portill's hot dog. We took our food and walked back to our hotel about 20 minutes away. Once we got back to our room I realized that they had forgotten about fries, so I called to let them know and ask if there was a way to get a refund. I call the phone number on my receipt and connect to the option to speak to a manager. A lady answers the phone and I tell her about what happened and if there is a way to get my money back. Her response was, \"honestly honey, I don't think that you will. Even if you come back tomorrow they probably wouldn't believe you\". <br><br>I understand that point they were 20 minutes to closing, but an apology would have been good enough for me. However, I didn't receive that or my money back for food that I purchased. I felt that I was blown off by someone who wanted to be done working for the night and didn't want to handle a customer service issue. I'm not even upset about the money, but more about the principle of the situation and how I was talked to by someone who answered as a connection to the manager.", "pics": null}}, {"review": {"des": "Slow AF. Not fast by any means. At least 20 minutes from order to food. They only go fast for drive thru.", "pics": null}}, {"review": {"des": "Ok, here's the deal.  This is a favorite spot, a tourist spot, and a damned good place to eat.  If you can handle the crowds, and the noise, and the long line waiting to order, you can score your own bag of deliciousness.  <br><br>There are a lot of choices, including pasta, and fish, but who goes to Portillo's for fish?  Just get in line, get your order decided BEFORE you get the the head of the line, for all of us waiting behind you.  Place your order, and get out of the way.  Find a table, order a beer, get a shake or soft drink.  Wait for your order number to be called, and sit down and enjoy.  <br><br>They do have drive up service, if you are crazy enough to be driving in downtown Chicago, but we weren't.   Walk there, or Uber, or take a bus.  <br><br>Their beef sandwich will make you smile.  Their jumbo dog will also please you.  Enjoy watching the tourists.", "pics": null}}, {"review": {"des": "First timer in Chicago, I knew I had to come here because I mean.. Chicago Hot Dogs right? <br><br>Unfortunately, I wasn't a huge fan. I guess I didn't understand the hype - it felt like a pretty ordinary hot dog to me? Sure, you got the works with all the toppings - relish, tomato, onions, peppers, mustard etc. but none of that made a terribly significant difference? <br><br>The italian beef sandwich on the other hand, was pretty good. A tad messy, a bit too soggy - but hey, flavor was great. Gravy on the side was definitely a good call, otherwise I think it'd be way too soggy.<br><br>Plentiful seating in a food court style place - order up front, get your order and find a seat. Pretty efficient and quick. The decor is reminds me of older days - but some of the pieces I found to be a little questionable / creepy .. but not terribly off putting. <br><br>Overall, I thought this was worth a visit since it's my first time, but I'm not sure if I'd be coming back here again.", "pics": null}}, {"review": {"des": "Amazing!<br><br>Placing the order was so easy, there were plenty cashiers open. There was a wait on receiving the order but wasn't much of a problem.<br><br>The food was worth the wait. We ordered fries, a Portillo's Beef Jumbo Hot Dog & Italian Beef Sandwich which we opted for easy dip in gravy. Everything was delicious and was made to order. Definitely can't miss this while in the area.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kHoOqVH8jn6UGYyBL8Vx-Q/168s.jpg", "caption": "Portillo's Italian Beef Sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BHp-Lde_PJyz0DzKBSjmOQ/168s.jpg", "caption": "Portillos Jumbo Hot Dog & Italian Beef Sandwich"}]}}, {"review": {"des": "CHEAP, FLAVORFUL & FULFILLING. I would get seconds if I could, but on a budget and discipline. Photos may not look appetizing but man that chili cheese dog was so so so good. It was messy but every bite was so worth it.  <br><br>Chocolate shake is definitely for chocolate lovers, but very sugary. Couldn't finished the shake because of the sweetness level. <br><br>Portillo beef hot dog though, poppy seed though. Game changer on the bread was definitely a nice change from Seattle's famous hot dogs.", "pics": null}}, {"review": {"des": "I LOVE Portillos. I never liked how Italian beef sandwiches looked but boy did I change my mind after I ate it.<br><br>Italian beef sandwiches with hot peppers and cheese fries and the chocolate cake will definitely destroy your cheat day but damn is it worth it. <br><br>Safe to say I always suggest it when we cater lunch and end up ordering it for dinner too. It's just such a good comforting Chicago style meal!", "pics": null}}, {"review": {"des": "The poppy seed and fruit salad was scrumptious (yeah, I hate that adjective, too, but it fits), and Hub's club sandwich was large and (yeah, I had a nibble) downright beautiful.<br><br>Clean, well lighted venue, too.<br><br>I can see why this place rates so high in Chicago!", "pics": null}}, {"review": {"des": "What's not to love?!? Cool corner building, fun and vibrant décor, they have different counters (regular orders, catering, delivery) but very well organized.  Loved that you can see the employees while preparing the food. And this one is also very centrally located. It did not disappoint, love this place!", "pics": null}}, {"review": {"des": "Don't get me wrong I LOVE the food at Portillos! I am a local and have had Portillos many times before out in the burbs. But I have never been to the River North location and now I know why. I hosted a Bachelor's party and we walked in around 2pm on a Saturday. Over the weekend, we ate some of the best food Chicago has to offer (Pequods, Portillos, Chicago Cut). The line was inside, which was good, but it was still a madhouse and like a Fortnite Battle Royale. <br><br>I ended up ordering my usual staple. Italian Beef, dipped, with hot peppers and mozzarella cheese. I also wanted a Chocolate Cake Shake. Once I finished ordering is where the fun began. <br><br>They gave you a number and then you walk over to the pickup area with the massive crowd. We waited a good 50 mins for our food. Portillos is supposed to be fast food...I know they were swamped, but they had NOOOOO system in place and no one knew what to do besides the locals. Portillos has probably about 80% tourists visiting so I can't fault them for not knowing any better. Since the wait was so long, I thought I ought to buy a beer. It took me and my buddy about 20 mins just to get a beer when I was the 2nd person in line waiting for a beer. The employees behind the counter never once told me, \"I'll be with you shortly\" or even acknowledged my existence. I was seriously like, \"Do you want my money?\"<br><br>The woman before me ordered a catering order and of course it was wrong so she had to wait even longer too delaying my date with my Daisy Cutter. To make things worse, when I finally got my order, my order wrong when I ordered a chocolate cake shake not a piece of chocolate cake. Also, my sandwich wasn't dipped like I asked, which was very disappointing. Since I waited for so long, it wasn't even worth it to complain because I was starving. I think the only capable employees at Portillos were the cooks and the employees shouting out numbers. <br><br>So overall, I would not come back to this location due to the service. Take my review with a grain of salt because my buddies and I made the mistake of coming to Portillos on a weekend. Service was a 0 and food was only like a 3 since I had the wrong order and the sandwich wasn't even dipped. The chocolate cake was the only satisfying part of the experience...Go to another Portillos location or Al's down the street.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7FmVWNPHZdLpjOg0646YgQ/168s.jpg", "caption": "Undipped Italian Beef with unmelted mozzarella cheese... :("}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OAbfeg4-N2VYPbyd3Wdu1Q/168s.jpg", "caption": "Only satisfying part of the experience"}]}}, {"review": {"des": "Seriously?? This is an over-hyped chain that might not be better than Arbys. Chicago, what are you thinkng?<br><br>I ate lunch here after hearing tons of great things. I walk up, and the liner is out the door. Great sign this place must be good. I wait in line, order an Italian beef, and wait some more. Once my number is called, i can feel myself begin to salivate anticipating the first bite. I sit down, unwrap my sandwich, and dig in. Unimpressed. The meat was bland. The onions and hot peppers did not do enough to add any flavor to the sandwich. Utterly shocked and disappointed, i finish my meal in disbelief. <br><br>In summary, pass on portillos italian beef. It's not that good.", "pics": null}}, {"review": {"des": "It was late night and I was determined to have a Chicago dog before I left the next morning so trusty Yelp took me to Portillo's.  Some locals told me that they are pretty known for their beef dip but I was determined to have my dog.<br><br>We walked over to Portillo's and it was freaking packed.  The inside is a lot larger than I expected and it was a hub of late night activity.  It is actually kind of overwhelming at first but with numerous places to order I guess there is a method to the madness.  There are like 1,000 menu items on the board but luckily we knew what we wanted already.<br><br>Of course I had the Chicago dog while our friend had the beef dip.  The dog was as good as I remember - celery salty with a nice kick from the hot pepper.  I wish I would have ordered 2 but I didn't want to deal with the line to order another.  My friend said the beef dip was also great.<br><br>Overall if it is late night and you are reading this, you know what to do...head over to Portillo's and you will not be disappointed.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1FMTSiAG8W-VQ1LWgEoOog/348s.jpg", "caption": "Chicago dog"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/94Xdzo4odsSeMWnISanuMQ/168s.jpg", "caption": "Crazy place"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/h8gWAu1H5yADkFiVwTc39A/168s.jpg", "caption": "Portillo's"}]}}, {"review": {"des": "I've been to Chicago numerous times but never had a Chicago hot dog which is just crazy.  While out in the city for a friends wedding I was with friends who luckily are foodies too! We stopped in for hot dogs and My life was once again changed by food! <br><br>I ordered the Portillo Chicago beef hotdog (minus the mustard) and it was delicious!!! The hot dog looks sloppy and you def need a have a good hold on it but it's worth every bite! I was a little surprised <br>By this he size and thought the hot dog wound be a little bigger but it's all good.  I had a side of cheese fries with it which were also delicious.  Cooked perfectly and the cheese was put in a side container which eliminated my fries from getting soggy.  <br><br>My friends also got the Italian beef sandwich which is where the food envy hit.  This sandwich looked amazing.  Generous portion of beef, hot peppers, fresh bread... I need to come back for the beef sandwich! <br><br>Portillos also offers other food options but the hotdog and beef sandwich is highly recommended.  As if the food was tasty enough they also serve beer!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/e_cDqHOYiF7WbrQDkmQDow/348s.jpg", "caption": "Chicago style hot dog!"}]}}, {"review": {"des": "Who doesn't love this place? From the moment you walk through the doors you get transported back in time. There are so many good options here, you can eat something new every day for a month and never repeat a thing. However, if you're visiting you have to get a beef sandwich with peppers and fries!", "pics": null}}, {"review": {"des": "A friend recommended Portillo's for Italian beef. I decided to check it out last night and the sandwich was thoroughly enjoyable. And it was \"dry,\" because the cashier I had did not upsell at all and I forgot to ask to get it \"dipped.\" That's my only regret and next time I will definitely try it dipped.", "pics": null}}, {"review": {"des": "Who comes to Portillo's and doesn't get hot dogs?! I do ! I came here with a friend and wasn't in the mood for a hot dog so I got chicken tenders and fries instead. It was so delicious ! The line was crazy long and the place was PACKED with people at 8 PM on a Thursday! But the food was good and I can't complain about that for sure!<br><br>2nd review: Came here again a couple days later and got a hot dog and it was super good!", "pics": null}}, {"review": {"des": "The chili dog was good and the fries with cheese were great. Everything is fairly priced. The atmosphere is what makes it-- it is so adorable. There was a lot of seating so it wasn't hard to find a spot.", "pics": null}}, {"review": {"des": "Had to get Chicago-style hot dog before I left<br><br>Got: Portillo's Chicago Beef Hotdog<br>To get the true experience, I got everything despite not liking pickles and mustard. I didn't even get ketchup which I typically always do. Clearly not a Chicagoan. This hotdog was surprisingly really good with all its condiments including tomatoes, relish, onions, and pickles. The condiments help enhance the flavor of the hotdog. Not a huge fan of the bun though since it gets mushy with all the juices from the condiments. Perhaps a slightly toasted bun would help with the texture.<br><br>This location is really packed since its one of the Loop locations and this is definitely one of the touristy things. No worries though took me around 10 minutes to get food even though it was fairly packed. Tables/dining area can be a bit dirty though since customer turnover is so fast and there aren't enough workers to clean up.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8DZyD2Rcx0IwU3jldUIykw/348s.jpg", "caption": "Portillo's Hot Dog"}]}}, {"review": {"des": "Portillo' s had, by far, the best Italian Beef sandwich I've ever had.  <br><br>Sweet and hot peppers, a decent amount of giardiniera, and a perfect amount of beef for the bun.  <br><br>Krinkle kut fries topped it off. <br><br>It's worth a trip back.", "pics": null}}, {"review": {"des": "Ordered the classic Chicago style hot dog and my hubby really enjoyed it. I got the Italian beef sandwich which in my opinion was a bit dry.  Johnnie's Italian beef was much better. Long line up to order and long line up to wait for food too. Would come back again.", "pics": null}}, {"review": {"des": "Alright, I might have reviewed my last fast food joint because I was a little tipsy and very much enjoyed my Taco Bell. Well, yelp suggested I review Portillo's because I checked in here. Portillo's is usually very tasty. I'd say a good 4 star regardless of which one you go to. Food is always right on, assuming it's the correct order, and prices are to be expected. But let me say this. <br><br>THE PEOPLE HERE ARE RUDE!<br><br>I totally get that this is probably one of the busiest Portillo's I've ever been to. There were probably a good 25 people, at least, waiting for their food. They did their best to get people their orders as soon as they could. But the workers were extremely rude while doing so. Yelling at the customers to pay attention to them, calling people stupid under their breath, ignoring others. I totally get the frustration they are probably experiencing. However, that does not make up for the behavior, <br><br>All in all. The food is standard, the wait is ridiculous due to the large amount of people going, and the workers (at least when I went) can be rude. If you want a Chicago style hot dog when touristing around downtown Chicago then Portillo's will satisfy that craving. But you might not be happy when leaving.", "pics": null}}, {"review": {"des": "When in Chicago, Portillo's is a must visit stop to try their famous Chicago Dog! It's a minute walk away from the BigBusTours Bus Stop 14 Hard Rock Café.<br><br>Atmosphere - Portillo's reminds me of indoor street vendors. It gets really busy here and takes a while to find a table to sit at due to the popularity. Ordering can be confusing as there are different lines for different items. The busy vibe makes dining here a unique experience, but finding an available is not fun though.<br><br>Food<br>CHICAGO DOG: 4 stars: love the light and refreshing taste of fresh veggie on the dog, but the dog... is.... SMALL! Plan on eating 2 or else you'll still be hungry.<br><br>ITALIAN BEEF SANDWICH: 3 stars: didn't feel it's better than any other place<br><br>Didn't get to try the famous chocolate cake since the line was too long.<br><br>The small portion/pricey tag and the frustration of finding available seating bring the 3.5 star dining experience down to 3 stars.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VzEzOfa5S9PUTUqao1G0eg/348s.jpg", "caption": "Chicago Dog"}]}}, {"review": {"des": "There's nothing that is more Chicago than Portillo's, although it's equal would be Giordano's in a different sense.  Tourists eat from Giordano's and it's good, but locals eat from Portillo's and it's GREAT!!!!!!!  If you've not been here, you're missing out on much AND YOU aren't really from Chicago.   Just sayin!!!!", "pics": null}}]}