{"name": "quartino-ristorante-chicago", "reviews": [{"review": {"des": "If you're looking for a lively restaurant with some fantastic food, this is your place. We were there for dinner before a show at the Oriental Theater on a Saturday night and the place was packed - make sure to make a reservation ahead of time (I made mine 3 weeks ahead of time)! <br><br>Bread and water are brought to the table right away. There is olive oil and balsamic vinegar already on the table. We ordered the red sangria right away and loved it. <br><br>We had a great server who was attentive but wasn't overbearing. Since it was our first time there, she walked us through their menu and explained that their dishes are similar to Spanish tapas - smaller and made to share. I like to enjoy a sampling of different food so this was perfect! <br><br>To start, we ordered the Carne Salada and Provolone off their meats and cheese section. Great serving size for two and came with an apricot preserve (perfect with the sharpness of the provolone), pickled vegetables, and pumpernickel bread.<br><br>Next, we ordered the fried calamari. It was good calamari and came with lemon and marinara. It didn't blow my socks off but definitely nothing to complain about. <br><br>We ordered a fettuccine Alfredo to share and the serving size was just right! I'm not a huge fan of pasta but I would happily order more if I go there again, the flavor of the Alfredo and texture of the pasta were great! <br><br>We decided to do dessert as well - I ordered tiramisu, which was off menu, and she ordered the Torta al Cioccolato. Both were delicious and a great way to end the meal. <br><br>I must say, this place goes above and beyond and doesn't break the bank. We had a 4 course meal and a liter of sangria for $80 with great service. It is loud and busy throughout the restaurant so if you're looking for a quiet place, this definitely isn't the restaurant for you. Luckily, it was just my cup of tea and I can't wait to go back!", "pics": null}}, {"review": {"des": "Simple, elegant and traditional Italian restaurant. Long list of Cabernet, which I love. Their service isn't consistent that's why it didn't get five stars for me. <br>Family style restaurant were they bring food as it is ready,  unless you request specifically you want it to come out in order.<br>I invite my family every time they come from out of town.", "pics": null}}, {"review": {"des": "Man, I really REALLY wanted to like Quartino Ristorante.  The reviews were excellent.  We stumbled upon it naturally, by just walking around the city on our weekend adventure over the summer (yea, i'm catching up on reviews), and here I am with 2 stars.  <br><br>Lemme 'splain!<br><br>As I said, we came on a Saturday afternoon looking for among other things, good food!   This place was getting busy, but after a few conversations with staff we were given a table to have a seat for a meal.  <br><br>What went right?<br><br>As another reviewer mentioned, the balsamic vinegar, bread and olive oil that hits your table is ridiculously good.  I don't even care for balsamic but I could drink this!  <br><br>Room for improvement?<br><br>Timing!<br><br>Everything during our visit was slow, and service plodded along at a snail's pace.  Both our menu and water took about 15 minutes to receive.  These both came out with the complimentary bread, and sadly, that probably should have been our cue to leave, but we soldiered on and ordered entrees. <br><br>Entrees sadly took much longer than those 15 minutes that our water took.  So what did we order?<br><br>Minestrone zuppe ($4.50)<br>Ravioli ($12.50)<br>Burrata salad (removed)<br><br>The minestrone was a perfect cup, came with seasonal veggies, and it was seasoned well.  The veggies weren't mushy and we both enjoyed this.  I'd order it again.<br><br>The ravioli was house made pasta and also filled with braised pork, along with spices, pancetta, and Parmesan cheese.  Fava beans accompanied the dish.  Presentation was nice, and the cook on the pasta definitely showed that it was house made.  <br><br>The spices and overall flavor of this dish were pretty bland in comparison to both the soup or bread, and that 30 minute or so wait didn't help its cause.  The quantity of this dish was also small for dinner, coming with 5 to 6 ravioli pieces. <br><br>The Burrata salad was not my dish, but was sent back because the flavors of the cheese were not what it was expected to be. Kudos to them happily taking it back and not charging us.<br><br>Sadly, we really left Quartino underwhelmed and hungry.  So much so in fact that we walked a few blocks after dining here and found ourselves stopping at a pizza place for actual dinner.  <br><br>Would I be against paying Quartino Ristorante a visit again?  No.  We fell in love with our Chicago visit and will be back to the city next year.<br><br>I also would love a shot at that bread, olive oil and balsamic again, because they were delicious!  <br><br>We may be back to give Quartino Ristorante another shot, but it'll take a while for us to explore what else has to offer first.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uyE92Tvl-jyGD7HBnf7VTQ/348s.jpg", "caption": "Burrata salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0cJM7NrSUX7MOE-OR36n2Q/168s.jpg", "caption": "Ravioli"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/libMYTdE6Jp3UwzYnhXc1g/168s.jpg", "caption": "Minestrone soup"}]}}, {"review": {"des": "9/15/18 - Went here on a Saturday afternoon with a good friend who also just so happened to have worked for the place. She knew the menu incredibly well and ordered quite a bit of food. I will list it all<br><br>Appetizers <br>DATES WRAPPED IN PANCETTA <br>Cheese/Honey and bread tray <br><br>Entrees <br>BRODETTO AL FRUTTI DI MARE<br>CAVATELLI<br>Beef pappardelle<br><br>So as you can see, we ordered quite a bit of food. The pros to this place you ask? We sat on the balcony overlooking state and grand. The service was amazing and quick. The food was delivered in a reasonable time. <br><br>Cons? The balcony was a bit over crowded. They sat their largest groups outside. The beef pappardelle was a bit too chewy. Of course it's a real Italian restaurant but the noodles were a bit too tough for me and too little sauce. The Brodetto al frutti di mare wasn't too my liking let alone my sight. Looked a little to yellowish-green. The sauce wasn't that good either; overly salty and not in a good way. <br>I can honestly say I loved the appetizers more than the actual meals. I would return without my friend to see if I receive a different experience.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/90jZozIVGzCRv8GwWL2vMQ/348s.jpg", "caption": "Dates"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J-tNtqDijW0Obirgb-iefw/168s.jpg", "caption": "Brodetto al fruttti do mare"}]}}, {"review": {"des": "I came here with my family on a vacation last winter. (I know. I know. I'm behind on some reviews but the photos were still lingering on my phone.) The experience is just as memorable. My father initially wanted to go here because it was recommended from one of his friends and not something I actually bookmarked and mentally noted after scouring through lists of places I wanted to personally check out. Definitely a great place. It was packed when we arrived. Wine was really delicious and I like that they had some pretty good deals on if you went with like a carafe or half or even quarter carafe. They separate them also by the intensity with being light, medium, or full bodied. So smart and educated this wine list. They apparently have weekday lunch specials for $8 sandwiches. <br><br>For appetizers we had sicilian cured olives in oil, calamari, and dates wrapped in pancetta, stuffed with gorgonzola and drizzled with honey. The calamari was nice. The olives were actually really good and I hate most olives but for some reason I was going to town on these. But I also remember being starving at this dinner because I skipped lunch. But do yourself a favor and get those dates. Lord. I would have ordered five more of those suckers. <br><br>Entrees we split a few things family style. Portions are on the smaller-medium side. I feel like I got two spoonfuls per dish and was still hungry when I went back to the hotel. But I think I would have been more satisfied if I just ordered my own entree instead of sharing with my kin. But we split the pappardelle with braised beef in a tomato sauce and the porcini and truffle risotto thinking it would be enough for four people and momma (me) objected and insisted we order a pizza with fennel sausage. A really smart idea because no one does sausage pizza better than Chicago. It was brick oven style and more on the personal pizza size but really good tasting. The pasta and risotto were good. The risotto slightly moreso than the pasta. But I feel like their pizza and wine and apps are really where they shine the best. Regardless, it was a surprisingly decent meal from a random suggestion.", "pics": null}}, {"review": {"des": "We were lucky to get a table in the bar area of this very popular Italian restaurant.<br>The atmosphere is warm and lively, the decor vintage. Quartino Ristorante tries to create the ambiance of an old Italian eatery, or what people think it should look like. So, it might seem a little too \"touristy\" to some, including me.  But when service is efficient and the food is good, simple and reasonably priced, I can't complain.<br>The menu is wide enough to please any taste bud.  Everything we had was good, including the drinks.  And the bread with olive oil they bring you once you are seated is perfect to whet your appetite.<br>We left the restaurant full and perfectly contented.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/yfRzqfFb8b6gXtBVXtwEMA/348s.jpg", "caption": "Eggplant Parmigiana."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MQSIfzC65O8Seh3LoZTq0A/168s.jpg", "caption": "Great Limoncello Martini."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Fkt6bmEep8BMs4Yiip2y7A/168s.jpg", "caption": "Cannoli on the right."}]}}, {"review": {"des": "My boyfriend had been here before so we decided to come back with some friends that live in Chicago that also loved the place. They had made reservations earlier so when everyone got there at 8, we were seated right away. <br><br>Our friend described the restaurant as \"Italian Tapas\" and it was very much like that. <br><br>We got a bottle of white and a bottle of red wine. Perfect for us to split between the 5 of us. <br><br>+ Pancetta Wrapped Dates - 9.5/10 - pretty good! I loved the balance of saltiness from the pancetta and sweetness from the date. <br><br>+ Bruschetta - 9/10 - this comes with 3 large pieces cut in half. Each piece has a different topping. I tried the eggplant and the tomato pieces. I really liked the eggplant one. It was delicious!<br><br>+ Pollenta Fries - 7/10 - these were okay. They weren't amazing but weren't bad. Honestly I wish they were cheese sticks instead. Haha. <br><br>+ Margarita Pizza - 9/10 - this was pretty good. No complaints. I loved the big pieces of basil. <br><br>+ Linguine with Clams - 8/10 - this was pretty good. I wish the sauce was a bit creamier but regardless I really enjoyed it. <br><br>+ Penne alla Vodka - 10/10 - I loved this! The Vodka sauce was thick and creamy and amazing. Order this!<br><br>+ Crispy Calamari - 9/10 - I love calamari and this did not disappoint! I wish the marinara was a little bit thicker but overall a great dish. <br><br>+ Tagliatelle alla Bolognese - 9/10 - this was pretty good. The sauce was a great consistency. I wish there was a little more meat in it but I still really enjoyed it. <br><br>Overall it was a great night with friends. The bill came to around $160 for 5 of us and that included 2 bottles of wine so it wasn't bad at all! Definitely will be back on our next trip to Chicago!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/MEydaRLREnRMaB7-YnRxzQ/348s.jpg", "caption": "Crisp Calamari"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/nlovepEeSvz-rpmfeb-fWw/168s.jpg", "caption": "Tagliatelle alla Bolognese"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xs3Ne63X9qxKqIggtWK07Q/168s.jpg", "caption": "Polenta Fries"}]}}, {"review": {"des": "Just had a very quick dinner here with my husband. We sat at a table in the bar area. Someone quickly brought us water, bread, olive oil and balsamic vinegar. The bread has not changed it's just as good as the first time we've had it. We make a mixture of the olive oil, balsamic and Parmesan cheese to dip the bread in and it's amazing!<br><br>For food we ordered the veal meatballs in tomato sauce and penne alla vodka. This is our go to meal we don't even look at the menu. It's 6 large meatballs and a decent amount of pasta. My husband and I are able to share both items and are full from it. <br><br>At first a server brought out meatballs but it was not the type we ordered. They brought us the veal meatballs with the raisins not tomato sauce. He quickly took them back and told our server. Within about 5 minutes both our pasta and correct meatballs came out. Both dishes were just as good as we remember them. The pasta could have been a little warmer but it was okay. <br><br>I changed my rating from a 5/5 to a 4/5 because of the server. Other than taking our order, asking if we were done and then handing us our check we never saw her. I understand if she was busy but we noted that she checked on the table behind us quite a few times. I also feel like she wasn't listening to us when we ordered which is why the meatball mix up happened. It wasn't the best service we've had.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/SMBU61J7Pl5RyFSKVSC0kw/168s.jpg", "caption": "Penne alla Vodka and Veal Meatballs"}]}}, {"review": {"des": "Perfect experience on a Sunday night, our last night in town. Drinks and wine were excellent. Food was really good too.<br><br>Our server was really helpful and friendly. I would gladly eat here again.", "pics": null}}, {"review": {"des": "All I can say is ... wow. Probably the best Italian restaurant I have ever been to. We came as a party of 4 on a Wednesday night and it was still PACKED. We waited about 20 minutes before being seated on a little table on the second floor patio. Our waitress was nice and very informative about the menu. My friend ordered the grapefruit martini, and it was refreshing but strong! She could hardly finish it. <br><br>I was originally going to order the pizza with duck prosciutto but then I found out that they ran out for the month! I was so disappointed, but ended up ordering the shrimp risotto. My friends ordered the gnocchi in a pesto sauce, linguine with clams with a side of asparagus. We also got a side of six meatballs in tomato sauce. The risotto was good and creamy, but a bit bland. I do wish I ordered the porcini and truffle risotto instead. The gnocchi was soft and pillowy in a very dreamy pesto sauce. The linguine was light and flavorful. The asparagus was lightly seasoned and cooked to perfection. The meatballs were yummy, but the sauce it was in was amazing! I could drink it. For dessert, we ordered the tiramisu. Absolutely incredible. Sweet, melt-in-your-mouth, fragrant, everything you could ask for and more in a tiramisu. <br><br>We left full and satisfied. I would love to be able to come back. Make a dinner reservation ASAP!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/t7IhYOp34Ms0k1zU9jZ6-g/348s.jpg", "caption": "Tiramisu! Yummm"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WHeJ9xxpDRU67M2CXGuMBg/168s.jpg", "caption": "Veal Meatballs"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4NeyzaLpg1UQGFCykNSiUQ/168s.jpg", "caption": "Linguine with Clams"}]}}, {"review": {"des": "I had a great meal here.  The place is interesting in that they bring food out you've ordered, when it is ready, not all food at the same time for your entire party.  They encourage you to share dishes for this reason.<br><br>The food was delicious and moderately priced for Chicago.  The thing that was of questionable business practice for me (nerd alert) is that the wine if priced in 1/4, 1/2, and full (I think full) litre crafts.  The thing is that a half litre is twice the price of a quarter litre.  A full litre is twice the price of a half litre.  If you are following here, you see that there is now price advantage for buying the larger size.  Therefore, my guest and I got the 1/4 litre and decided if we wanted more, we would order more.  Both of us noticed this independently as did the group sitting at the table next to us.", "pics": null}}, {"review": {"des": "3.5- I always say I have to go to Chicago to get decent Italian. I really do. I was happy with my choice of Quartino. It is really busy/ crowded. if you have a party larger than 4 I implore you to make reservations.if you have to wait they will take your number and text you so you can explore nearby areas. I always appreciate that. This place is tapas style. Be prepared to share! They do give you table bread and the resources to make a decent olive oil dip. <br><br>Things I loved: eggplant, tomato soup, and the homemade pasta bolognese. These were probably top 5/10 of the particular dish I have had. <br><br>Things that were meh: the shrimp risotto (was kind of flavorless and overly toothsome- kind of off since they had risotto books for sale) and salami salad it kind of seemed just thrown together like a salad I would make at home). <br><br>The servers were efficient and pleasant when taking your order and answering questions but they could be a bit aggressive on the booze/ upsell. They also took away plates before you were done.", "pics": null}}, {"review": {"des": "This is a Chicago must for everyone!  I have come here yearly (multiple times) for the past five years and love this place!  The food comes as it's ready and it's a perfect place for sharing! <br><br>There in indoor and outdoor seating and the service is phenomenal.  I've been well over ten times and have always had fantastic experiences.<br><br>The menu is small plates, meat & cheese, olives etc.  Along with Soup, Salad, Fondue, house made pasta and imported pasta.  They also have a variety of risottos, vegetables, seafood, specialties, and pizza! <br><br>I've attached a lot of photos but I have to highlight my favorites first!  The Calamari is simply perfect and we order it every time we come!  It's perfectly seasoned and flavorful!<br><br>The Caprese salad is my go to when I don't have a clue what I want.  It's a nice portion and so fresh! <br><br>The fresh pastas and ingredients are fantastic!  My favorite is the Cavatelli!<br><br>My absolute favorite thing i've ever had is the pork shank and it more than enough for two people!  <br><br>I can't wait to go back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Q7V-ZTjGyhKOb_nGi-YGig/348s.jpg", "caption": "Margherita pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/qrbkfdZ_mrQ6Cf5fZ28NPQ/168s.jpg", "caption": "gnocchi"}]}}, {"review": {"des": "Very welcoming family style Italian restaurant, they offer thin crust pizza to a variety of pastas. We had two different pizzas (Margherita, Quattro Formagi). To top it all off, we had Truffle Risotto and Arugula Gnocchi. The risotto was fantastic but the gnocchi left a lot to be desired. <br><br>It's overall a good restaurant but quite average as far as Italian fare goes. A little bit overrated, you can probably find better Italian elsewhere.", "pics": null}}, {"review": {"des": "I went to Quartino earlier this week with my team, a large party of about 11 people. We had a great time! The food was delicious and the service was fantastic! <br><br>Shout out to our server Spencer who really took care of us. She was able to see that we were a bit indecisive and more focused on our conversations and then took charge of our group. She ordered appetizers and other dishes for us after asking for our preferences. She made great wine recommendations too. Spencer kept the plates coming and made sure empty plates were quickly removed to make space for more food. She made the experience really enjoyable where we could focus on connecting with each other rather than worrying about the food.<br><br>I have been to Quartino once before and couldn't remember the food but everything we had his time was really great. We ordered too many dishes for me to recount but a few hits included the artichoke appetizer, the burrata, fried calamari, clams and the linguine and clams (in a tomato sauce). I highly recommend all of those.<br><br>This place is especially great for big parties! Will be back for sure!", "pics": null}}, {"review": {"des": "*this restaurant is a game changer*<br><br>My family and I visited from California and I had this place on my top restaurants to try.  My mom (part Italian) was craving good Italian food so the pressure was on to deliver.<br><br>The bartender here was amazing, she was telling us everything we should order on the menu as we were at the bar waiting for a table.  She gave some of the best recommendations.<br><br>Our experience continued with excellent service as we were seated and greeted by our server.  Our food came out as soon as it was ready, and for it being really crowded we were shocked at how fast the food came out!<br><br>By far my favorite thing I had was the mushroom truffle risotto - holy crap!  I was speechless.  My mom who is a tough food critic was raving about the entire meal in general days after we ate there.  I have posted the pics of what we ordered, but there was honestly not one bad thing that we ordered.  Everything was made to perfection and I would imagine anything you order here would be 5 stars.<br><br>I will most definitely be recommending this place to my friends that visit and I will be back myself!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/XJqyCyk_x_Hj_4QtYGCAZA/348s.jpg", "caption": "Veal Meatballs"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/c8c5jmF-y67Bfz-KK79QXw/168s.jpg", "caption": "Dates wrapped in pancetta"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-TrpZCy1UOo-IQg6FlnoLA/168s.jpg", "caption": "Inside decor"}]}}, {"review": {"des": "We had a reservation for 8 on a Friday evening. We were seated promptly on the second floor. <br>We started off with the cheese fondue x 2 (one with apples other with carrots and celery). It came with plenty of veggies for four ladies. <br>We shared some prosciutto and salami with the house pickled pickles and veggies. I have a love for prosciutto and that was delicious. <br><br>Since we had so much bread, I just got the pesto gnocchi to share for my entree. That was one of the best gnocchi dishes I have ever had! I loved the green beans in it, so different. And just oh that flavor was amazing! It was a perfect sharable size. <br><br>Our server was the sweetest thing ever and she loved our cat shirts for our bachelorette party. <br>I would have returned the following night if I could have and sat outside! I loved the energy and feel of this restaurant. If I am ever back in town, I will<br>be stopping back!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WmkbhTyfKlGR6kb5XRIEyQ/348s.jpg", "caption": "Gnocchi"}]}}, {"review": {"des": "Went here for dinner with the bf for my 30th/our 3 year anniversary. We were lucky enough to be seated outside in a corner so we didn't feel too cramped. However, it can get pretty loud depending on the people hanging out or walking by on the sidewalk. The decor outside is very pretty. <br><br>We got: <br>- POLPETTE AL SUGO DI POMODORO <br>- TAGLIATELLE ALLA BOLOGNESE <br>- GNOCCHI<br>- TIRAMISU<br><br>Everything was very delicious and the price was reasonable. The portions are big enough to share between two people, but it is smaller than a lot of other Italian restaurants. If you eat a lot, maybe get your own plates (:<br><br>The servers were very nice and attentive as well as all of the other staff. My only gripe about this place is that their table for two outside is pretty small. It's like playing tetris trying to fit a couple of plates and our drinks on there.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d_Q95XBYMpz0jU11pCOtig/168s.jpg", "caption": "Tiramisu"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/8gBvcvzxqf98Jkldo4l6jw/168s.jpg", "caption": "Gnocchi"}]}}, {"review": {"des": "There are an endless number of great Italian restaurants in Chicago. I'm sure you have your favorites. But after a couple of visits to Quartino I have to say this place has risen to the top of my list. Granted we've only come for lunch but I'm here to say that you'll not find a better lunch experience than the one at Quartino. Their offering of a $25,  3 course meal for 2 is unparalleled. It is spectacular!<br><br>We started this time with veal meatballs in an amazing red sauce. These babies were a pure delight. We went with the linguine and white clam sauce for course 2 and this just blew me away. So many clams!! Usually places short change you on clams but we had many in every single bite. And the sauce? How do they get so much flavor and spice in there? I'll be dreaming about that dish tonight.  Finished off with fruit de mar which is $18 on its own and a huge plate of the freshest seafood imaginable including clams, shrimp, fish and calamari. Spectacular. We topped it off with a 1/4 liter of French rosé for an amazing meal. The wine selection is awesome as well. <br><br>Can't go wrong here. Highly recommended.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GcLWhqzaEqgZoj7wZRt3hA/348s.jpg", "caption": "The \"viewing window\" between men's and women's restroom is an interesting touch."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/RBWIOCO7B6ODR55_erplHw/168s.jpg", "caption": "I love that they have REAL Boraxo as the soap in the restrooms! Classic."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/A_jElB9_qvttfFHATZ8q-A/168s.jpg", "caption": "Veal meatballs. Amazing."}]}}, {"review": {"des": "Limon Martini is great.<br>Overall all the dishes are tasty.", "pics": null}}, {"review": {"des": "Ambiance<br>We came here for lunch and sat out in the patio since it was a really nice day.  It is a great place to sit outside and just relax and have some food.  <br><br>Food<br>Angus beef carpaccio<br>-Very fresh.  The celery is not overwhelming with just enough cheese.<br>Organic veal skirt steak<br>-Thin steak probably well done over what was asked for which was medium.  <br>Tortellini<br>-The meat tasted really fresh with the pasta tasting home made.  There are a lot of peas in the dish.  <br>Tuscan sausage risotto<br>-The sausage is blended nicely into the risotto.  There are a lot of peas in this dish as well.<br>Coppa Alla Banana<br>-Vanilla ice cream with some chocolate shavings.  The biscotti is excellent.  Nice caramelized banana on the side. <br><br>Service<br>We came at lunch time during a weekday and it was pretty dead.  The service was good and the food came out pretty quick.", "pics": null}}, {"review": {"des": "We ordered the spaghetti and the noodles were super fresh and cooked al dente (my favorite!) We wanted a side salad (not a full salad) so the waiter suggested ordering half a salad (we didn't even know that was an option!) Portions are medium sized and two pastas + half a salad was filling for the two of us. <br><br>Suggest making reservations before coming since this place is pretty popular.", "pics": null}}, {"review": {"des": "Great service and wonderful food! The tortellini was amazing, and I also loved the chicken soup (was craving some soup on a chillier evening). Caprese salad was also super yummy!", "pics": null}}, {"review": {"des": "I've been here twice now and both times I had amazing service! My server, Lynnae, was super accommodating and helped my friend customize her order due to her lactose intolerance. I had the vegetarian pizza along with the arugula salad. <br><br>The salad was a bit plain, but was to be expected. The pizza didn't take too long to come out and the rest of my table got their food pretty quickly. <br><br>It is nice that they are open late for people who want to have a night on the town as well as great food!", "pics": null}}, {"review": {"des": "So... I had an errand to run in the area... after it was done, decided to treat myself to an alfresco meal... and this place was in visual proximity of the parking garage (good deal $13 on SpotHero vs. normal rate of $40, and I could have stayed another 2 hours... garage for the Holiday Inn Express)<br><br>AMBIANCE <br>It seems nice enough but nothing fantastic for this area... did go inside for the restroom and it was not impressive. Bathroom was meh, stalls were like high school, and a weird sink setup too.<br><br>Seems like other reviewers think its loud when packed... while it's probably empty at this time... I like to be in daylight when possible. <br><br>SERVICE<br>Could be better for the fancy location. The host/<br>Server Ramon, that seated me outside didn't do the normal stuff I expect from Italian places (like setup the dipping oil balsamic plate) for the bread. Not sure if he didn't think I looked like I wouldn't be that picky, but... that's not usually what most people get as my vibe... still tipped him 20%. Take THAT Trump.<br><br>FOOD<br>Ordered the beet salad (did not see any evidence of roasting), shrimp in a wine sauce and then the sauteed version of their calamari... which I asked to have grilled more when they initially brought it out.<br><br>Apparently this is like Italian Tapas, and small plates... good enough, with the bread it's a solid meal... but don't expect anything more than a saucer size portion.<br><br>Beet Salad, good. It got more flavorful as you went into it. Sent the shrimp back, too soggy and the sauce or marinade was watery and tasted only the pinot part of whatever it was supposed to be... the calamari was great once it had the sear... though it was a tad salty, was very flavorful without any marinara.<br><br>Pic is of it after asking for more grilling. Not sure I love this place, it was alright... combining all the factors... depending on your appetite, reasonable lunch total.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dHQu-e8gCy3bxZ98mFoXvg/348s.jpg", "caption": "Presentation is basic."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/-ONy1omcwrUdWLENUGYGmA/168s.jpg", "caption": "Beet Salad... it's okay, walnuts saved it from a blah."}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gkLhLl8rtqdhS0m8KzjqMg/168s.jpg", "caption": "Shrimp something... looks kinda meh for $12"}]}}, {"review": {"des": "Let's start with the restaurant decor...it looks very authentically \"aged\" Italian but we were told it was designed to be since the restaurant is not that old.  Great job!<br><br>We ordered the tortellini with prosciutto and peas. I must say it was better than any I've had in Italy!  The meat was very flavorful and tender and the pasta was so light and tasty. This dish is excellent!<br><br>Also had the margarita pizza. It was good, but the tortellini outshined it.<br><br>The lemon dessert was also amazing and delicious. I've never tasted lemon cream gelato but it lived up to its name; super lemony with just the right tartness and creamy to boot.  Just writing this makes me want more. <br><br>Our server was knowledgeable and efficient especially since the place was packed. <br><br>Can't wait to go back next time I'm in Chicago.", "pics": null}}, {"review": {"des": "First time here as my colleagues and I couldn't decide where to have a meal.  We chanced it hoping there would be a few spots at the bar so we didn't have to wait for tables. Ultimately, we got luck and found a few empty chairs.<br><br>The bartenders were friendly, and quick to attend to our party. After perusing the menu for a bit, I tried Shrimp Diavolo which consisted of <br>garlic, Chilli, tomato sauce, basil, etc. It was really quite good when pairing with a glass of white wine. I did have the dish with complimentary bread, which worked out well because the sauce was quite taste on a bit of spicy side. Still it was too small of a portion for me so I went for Spaghetti and meat balls as well per my colleague recommendation. Well, the meatballs were just OK.<br><br>In summary, the food was good, and the service was prompt. Will I be back? Yes. Will it be on top of my list of restaurants in Chicago? No. Still, I would give this place a 4-star rating.", "pics": null}}, {"review": {"des": "My family and I are here prior to seeing a show at the Cadillac Palace.  The staff was welcoming and the food was excellent.  We shared pasta, pizza, sausage, and dessert.  We did not have a negative review of anything we had.  We sat at a cozy table in the window and took in the sites.  We would definite come back again!", "pics": null}}, {"review": {"des": "Looking for good pizza in Chicago is like hoping for a sunny day in Denver = a pretty good bet.<br>Found an excellent one topped with very good prosciutto and arugula  at Quartino's. Better yet, it was provided by a great server while my sweetheart and I got to enjoy it on their neat little downtown patio.<br>What made it even better? I'd ordered an amber Italian ale I'd never heard of before and when she left a Morelli by mistake she just told me to drink them both. <br>Mama mia! Free beer with excellent pizza. Doesn't get any better than that.<br>Arriverderci Roma,<br>Davide (D.Martin) M.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Yyq59EUIPSyeD1KoHw_DVw/348s.jpg", "caption": "The Danielle -- a definite yes."}]}}, {"review": {"des": "This restaurant has been a staple for me throughout my time in Chicago. I absolutely adore Quartinos. They have super well priced items and good food.<br><br>First of all- did you know the house wine is $5? An entire bottle for $5-$7 (depending on which you get). Amazing. It doesn't taste bad, I promise.<br><br>They give you bread, and you order small plates. Each of the plates are well put together, the food is always cooked well and comes out hot. I'd recommend the penne all a vodka and their pizza. Omg their duck prosciutto pizza is to die for!!! If they have it, when you come in, you have to order it. <br><br>For lunch, they have a $25 three course meal- drink, salad, small entree, and dessert. So affordable, so good, definitely try it out!", "pics": null}}, {"review": {"des": "I've been to Quartino 3 times and I keep coming back for more! My husband and I came this past weekend on Saturday - ducking in to avoid the snow/rain combo that was plaguing the city. The food was warm, the wine was flowing and we left with full tummies! The service is exceptional - it seems like there is always a dish coming out to your table in perfect time so that you are never left without food. And the portions are good for sharing! We recommend the tortellini with peas and prosciutto, a lovely cheese and carpaccio combination and wrapping up with the donuts!", "pics": null}}, {"review": {"des": "Lousy service. <br><br>Had reservations for special occasion, and reservations are a must. But clearly they can't handle crowds. Things as simple as drink orders took an inordinate amount of time. As in over 30 minutes for 4 drink refills. <br><br>The concept of small plates is fun. Lots of great selection. But ask your server. Some are plentiful, but others are really not.", "pics": null}}, {"review": {"des": "I'm going with 4 stars here, but I'm torn. <br><br>Table of 3, ordered several items to share around. All items were really yummy. Although, the Minestrone would be considered overly salty by just about anyone but me. <br><br>So, the food was good. And, to me, good food is necessary for a good restaurant experience. Necessary, but not sufficient.<br><br>The ambiance here leaves something to be desired. The whole place has this classic old-timey vibe, which is fine. But they are definitely a churn & burn style place. Ultimately, this all feels very catered towards tourists who want to have a classic chicago italian meal experience. Which I guess is fine? Just not really what I was hoping for. <br><br>Anyway, I'll try somewhere different next time. But, if you're hungry & in the area, and need a table on short notice-- you could definitely do worse than Quartino!", "pics": null}}, {"review": {"des": "In-freaking-credible. <br><br>We ordered SO much food here because our friend described it to us as an Italian tapas, so we assumed the portion sizes were super small but dang were we wrong. Definitely shareable! <br><br>Every single thing was delicious. From heavenly peach bellini's, an incredible sampler, pepperoni pizza, fettuccine, salad, and more, I was left with one disappointment - the small size of the table top limiting me from adding more to our table and my waistline. <br><br>Plates are brought out as the items are prepared which is great if you plan to pass the items around family style like we did. The servers are very casual and will take time to walk you through the menu (thank goodness) as it is pretty extensive!<br><br>Highly recommend to those looking for a great lunch spot in Chicago!", "pics": null}}, {"review": {"des": "Great vibe at this bustling spot in the heart of Chicago Friendly wine list great pizzas and Italian dishes Service is usually spot on and there can be a wait", "pics": null}}, {"review": {"des": "Came here for the \"lunch for two\" special and got three Italian shared plates for only $25. We ate outside on State Street and it was much more relaxing than most outdoor areas downtown. The service was friendly, the food came very quickly, the food was extremely delicious, and we did not have to wait on the bill. Very satisfactory meal. Would definitely come here again!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/4UwZwuBmDzer6VCvM_luOQ/348s.jpg", "caption": "Polpette Al Sugo Di Pomodoro"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/oI2nCeJOELhqZwkwDY1Ong/168s.jpg", "caption": "Tortellini"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/eLMO_47L9zSblrpx8S3Eqw/168s.jpg", "caption": "Beef Short Rib"}]}}, {"review": {"des": "I was a little disappointed the past few times I came to Quartino. Granted I usually come during busy weekend nights, I made a reservation multiple times and every time I was asked to wait over 30 minutes for a table to open up. I understand they are busy, but it's still frustrating to wait so long despite having made a reservation to avoid exactly that. Be warned that parking is a real struggle.<br><br>Thankfully, to make up for the wait, each person at my table was offered a free glass of wine, which was a very nice gesture to apologize for the wait. In terms of food, I've enjoyed pretty much every dish I've tried. <br><br>The restaurant is family style/small plates menu. Basically you order a bunch of dishes for the table and you all share a few things. The menu mainly consists of pizzas and pastas and a few interesting dishes such as octopus. Also they have free bread! Always a huge plus. <br><br>A real downside of dining here was the noise level. I had to yell at my friend next to me just so they would hear me. It wasn't the best dining experience but the food was decent.<br><br>I would personally only come here for special occasions. It's very pricey and the style/setting is best for larger parties.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/shqJjp6TuXB7QTXPMrWPrg/348s.jpg", "caption": "Roasted Baby Octopus"}]}}, {"review": {"des": "I was disappointed by both the food and the service at Quartino. It is in a busy setting on State St., with an enormous amount of seating indoors on two floors and outside the restaurant as well. My friend and I were seated in about 10 min outside walking-in on a weekday night, although we would have needed to wait longer if we wanted to sit indoors. My first issue was how cramped the outdoor seating was. I could barely pull out my chair, let along weave through the chairs. In order to get out, my friend would also have to stand up to let me through. It was hard to get our server's attention, especially after we had ordered our food.<br><br>Bruschette<br>3 toasted bread slices with a bedding of spinach and arugula had roasted tomato, sicilian eggplant and portobello mushroom, topped with two different kinds of cheese. It was very different than the kind of bruschetta I am accustomed to on small baguette slices with a tomato and cheese topping. It was quite filling, and I ended up thinking that it was a decent dish.<br><br>My friend on the other hand, waited almost 40 minutes for her pappardelle pasta, which is unfortunate. We had to remind 2 different servers, and I was pretty much done with my dish by the time she had hers delivered to the table. Her dish was a very small portion too. I don't think I'll be coming back here, and if I do, it would be in a large group to eat family-style.", "pics": null}}, {"review": {"des": "3.5 stars. My friend and I tried the truffle risotto, linguine with clams, spinach, and wrapped dates. Overall, the food was mediocre. Nothing was particularly bad, but nothing was amazing. The risotto was probably the best thing we had and I appreciate that the truffle flavor did stand out. As for the the linguine with clams, I found the white sauce to be a little bland, but did appreciate the amount of clams they included with the dish. More than enough to get a piece with ever bite! Our waiter was very helpful and cheery.", "pics": null}}, {"review": {"des": "I was totally impressed by Quartino. Their lunch special sitting out on their patio on a beautiful day couldn't be beat! Sharing 3 lunch courses for 2 people for $25 was one of the most amazing deals ever. So much food - appetizer, pasta course & main course with many choices for each and everything so flavorful - we just kept saying 'wow!' Our server, Ramon, was very charming & attentive. <br><br>We started with veal meatballs Napoli served with raisins and sun dried tomatoes. Our pasta course was linguine with red clam sauce which had a nice spicy kick. Loved it! Our main course was a giant bowl of fresh seafood in red sauce - clams, calamari, octopus, shrimp, whitefish, etc. All 3 courses were beautifully prepared. To say the least we didn't need dinner after this hearty lunch! <br><br>The wine list looks fabulous and quite reasonably priced. Sadly we couldn't indulge in that on our first visit but, we plan on returning & taking advantage. During dinner service the items we ordered would have been nearly double in price but, still a very good value.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ks_6dTMe0PHtJ41RUgXM-w/348s.jpg", "caption": "Veal Meatballs Napoli with raisins and sun dried tomatoes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7Hla2GuAkHd9dAnQPcLP6A/168s.jpg", "caption": "Linguine with Red Clam Sauce"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/J2C3ru-w53h6FqmrsYvK2A/168s.jpg", "caption": "Brodetto al Frutti di Mare - shrimp, calamari, octopus, clams & whitefish in San Marzano tomato sauce"}]}}, {"review": {"des": "I can't say enough about this restaurant. <br><br>All of their dishes are absolutely delicious. The dishes are all made to share, so go with a group, and order anything and everything. I've tried over half of the menu at this point and love EVERYTHING. <br><br>Great for vegetarians, affordable, great vibes.", "pics": null}}, {"review": {"des": "We came here mid-afternoon on St. Patrick's day of all days- and yes, it was packed, but miraculously we got a table for 3 right away. The dining space is huge, so there's plenty of seating.<br><br>The waiter was VERY attentive given how busy it was and the fact that it was St. Patrick's Day in Chicago. <br><br>The three of us shared a Margherita pizza and a sausage pizza. Both were absolutely delicious! <br><br>Overall, we were very impressed with this place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/VEm4w-voDMVQjkBBigB4PA/168s.jpg", "caption": "Margherita pizza"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/v4EgDMAx6JsMjOZCbJr7YA/168s.jpg", "caption": "Sausage pizza"}]}}, {"review": {"des": "3.75-4 star<br><br>I was very impressed by how thorough our server presented the entire menu. He definitely knew his shit. We ordered:<br><br>Beet salad- it was average, needed a little more seasoning and nuts. <br><br>Caprese salad- the mozzarella complemented the juicy tomatoes and met my expectations.<br><br>Veal meatballs Pomodoro- a nice surprise to have it come with six pieces. The flavors were there, it was moist and the sauce worked well with the veal.<br><br>Pappardelle- fresh noodles made in-house, it was thicker than usual but I liked that it had an \"eggy\" taste. The meat sauce was soft and flavorful.<br><br>Polenta fries- crispy but bland. It needed more salt, and the sauce it came with was like a watered down sweet buffalo sauce. Skip it.<br><br>Per my eating partner, the main attraction was the cheese they provided in a self-grating dispenser. It elevated everything we poured it on- which was pretty much everything we ordered.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/y7MsbyfnI0tJFyvC0gd1yA/348s.jpg", "caption": "Polenta Fries"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/uRpMxM9wQeLjT1ivHnWCdQ/168s.jpg", "caption": "Pappardelle al sugo si manzo"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/X-T8HjW34Dzl0g_E1qlP-Q/168s.jpg", "caption": "Veal Meatballs Pomodoro"}]}}, {"review": {"des": "I was looking for a place to have a bite that wouldn't cost too much money... I was actually on my way walking to another restaurant when I stumbled across this! A hostess saw me looking at the menu outside in the cold and invited me inside to read a paper menu, everyone was so incredibly nice and the food was absolutely delicious and a really really fair price, I will definitely go back next time I'm in Chicago.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/honR7ZURduSckIJ4rYDhzg/348s.jpg", "caption": "Old fashioned was"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/4NcLXlFntpynn4Nhop7NbQ/168s.jpg", "caption": "Honestly, one of the best things I've ever eaten! Ricotta and bread!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aQ47MRt7oiWaMMVXrKJ5Zg/168s.jpg", "caption": "Roasted tomato soup and an old fashioned - perfect!"}]}}, {"review": {"des": "Came here based on all the yelp reviews and recommendations from family.... and left very disappointed and hungry. Definitely would not recommend coming here for date night. Also, make a reservation. My bf and I tried dining here and it took about an hour and a half for us to be seated. I liked that they texted us when our table was about ready and the hostesses were very nice, apologizing for the long wait. <br><br>The entire top floor was blocked off for a private event. The top floor was very nice and overlooks part of the restaurant. There's also patio seating downstairs, but I wouldn't recommend sitting outside since there's a long line out the door. <br><br>It is SUPER loud in the restaurant. There were a lot of large parties and of course a ton of people drinking/ drunk people. We sat towards the back and the tables were very cramped for two. The waitress did warn us that the entrees were meant to be shared, meaning they were very small. My bf and I didnt realize that literally meant half of a normal portion that you'd get elsewhere. We both ordered pasta dishes... he got the pasta alla vodka with meatballs and I ordered the pappardelle. Both dishes were pretty salty in our opinion, but the pappardelle is one of their more popular dishes and it wasn't too bad. The pasta alla vodka wasn't great and we waited forever the check to arrive. <br><br>2 entrees weren't enough for us and we probably should have listened to the waitress when she told us the portions are pretty small. So, if you do decide to dine here I would recommend ordering a few appetizers and a few entrees for the table. We couldn't wait to leave as the two tables next to us were pretty loud and decided to go to Eataly for some gelato.", "pics": null}}, {"review": {"des": "OMG! If only they make pasta this good in the Bay Area!<br><br>On our first night in Chicago, we decided to grab bite close to the hotel so we decided to go here. The wait was about 1.5 hours at 9:30PM on a Thursday so my coworker and I decided to grab a drink at a Red Head Piano (they have the BEST OLD FASHIONS) since it was close by.<br><br>Here is what we order: (No star rating needed since they are all 5 stars)<br><br>- San Daniele Pizza ($16): prosciutto, wild arugula and grana- SO GOOD! It was topped off with some lemon so the citrus balance out the salty prosciutto and grana cheese. MMM! Thinking about it is making me hungry.<br><br>-Burrata ($10.75): in house made burrata with roasted beets salad. OMG! It's so simple but so freaking delicious!<br><br>-Linguine with Clams ($11.75): I always ordered linguini with clams at most Italian restaurants but this place definetly takes the cake. Al dente pasta bathing in that sweet clam broth! MMMM!<br><br>Quartino easily made it to my top three favorite Italian restaurant. I don't know if its because I haven't eaten anything all day since I flew in that afternoon and then was busy setting up the tradeshow or it was because the 4 old fashions I had at the bar that helped enhance my taste buds. Whatever it was, this was one epic meal and I told myself I must eat here whenever I am in Chicago.", "pics": null}}, {"review": {"des": "I had high hopes for this place with their abundance of Yelp reviews and the menu looked amazing. Overall my husband and I were not impressed with our food whatsoever. I had the shrimp risotto which looked like vomit. It tasted ok, but the unappealing ĺook just ruined it for me. My husband had the tortellini which he felt tasted fishy, and I thought it had no flavor at all. It was completely bland. I did enjoy the kale salad, although it had far too many pumpkin seeds and dried cranberries. Honestly the best part of the whole meal was the bread with oil and vinegar to start. It was incredible how loud and busy it was on a Wednesday evening when their food is this sub par. I'm not seeing what is so good about Quartino's.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/WTr8kssgFWH48VYnqyFfWA/348s.jpg", "caption": "Shrimp risotto"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/RGs5Ja4qmPIEJfSzbHMG7Q/168s.jpg", "caption": "Tortellini"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/vkYy19VXu-y7aLnLiJv1sw/168s.jpg", "caption": "Kale salad"}]}}, {"review": {"des": "I love Quartino! I came here the other day and tried the Italian soda, pizza, veal sliders and calamari! I love coming here because the atmosphere is lively and fun! The service is always amazing and the food is great. It's in a great location and also a nice after work spot!", "pics": null}}, {"review": {"des": "Super busy and loud spot - tables are very close to each other and had to raise our voices a little to be heard. <br><br>The truffle salame came with giardiniera - the salami just tasted like salted meat and had really no truffle flavor. Additionally, it had a bit of a plastic texture so was just generally unpleasant to eat. We only had a couple pieces before we gave up on the dish. <br><br>My sister has the caprese salad and roasted baby octopus. The caprese salad was really refreshing and tomatoes were crisp. Solid take but nothing special. The roasted baby octopus was tender and had a good citrus taste. The broccoli rabe nicely complimented the octopus. <br><br>I had the tagliatelle alla bolognese - the pasta had a good bite to it and tasted fresh. The sauce was super meaty and filling. <br><br>Overall, good spot but don't know if I would go back - none of the dishes were super special and the place is really loud.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ACGuc0Ech1buuy0Bx41dnA/348s.jpg", "caption": "Truffle Salame"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Lkk7RkPBUQ2O1AwaAE3gcA/168s.jpg", "caption": "Caprese Salad"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/n1Pjem50cozXqWYjN3bPzg/168s.jpg", "caption": "Roasted Baby Octopus"}]}}, {"review": {"des": "I was in Chicago with my husband and found this little gem. The food is outstanding. It's shared plates as well if you'd like. My best friend is from Sarno Italy and this sauce was as good as hers! We had meatballs as an appetizer. I had penne alla vodka and hubby got Ravilolis.  The sauce on my penne we both Liked much better.  I asked if they deliver to Boston area where we are from but they sadly don't. I'll be there anytime I visit Chicago!", "pics": null}}, {"review": {"des": "Ok so I'm a bit confused about how I feel about Quartino. The first time I came here, I had a few glasses of wine in me so I thought everything tasted AMAZING. I honestly don't remember what my party of 14 ordered, but we all loved the food and spent only ~$400 if my memory serves me right. I would absolutely recommend reserving their wine room, which seats up to 16 people, if you're trying to find a nice place for dinner for a large group without breaking the bank (you don't have to do a private dining menu, you can just order normally!). I love that it's shared plates family style, so everyone can try a bite of everything. <br><br>The last two times I've come here, I wasn't as impressed. I still thought the food overall was good, but nothing really blew me away. That being said, I will still be coming back to try other dishes if I'm in the area.<br><br>Onto my thoughts on the dishes I've had:<br>Duck prosciutto was good but the portion size was small. Their margherita pizza ($13) was good but nothing special, would recommend either trying a more specialty/complex pizza. The rigatoni ($13.75) is delicious--I remember the waitress saying that it once was up for a James Beard award? The tagliatelle alla bolognese ($12.50), which is one of their homemade pastas, was just okay. The noodles themselves were not that impressive, which was disappointing at an Italian restaurant. We still finished the plate but all the while wishing we had ordered something different. The steamed clams were SO salty. I don't know if that was a fluke, but it was almost to the point of being inedible. They serve grilled bread with the clams, but there was no way you could dip the bread into the liquid because it was so salty. Regardless, the clams were so tiny that it wouldn't have been worth the $14.25. <br><br>Because the prices overall aren't too steep, I've still felt satisfied with my food after every meal and haven't written Quartino off my list yet!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/m6k541fUvvsJdDjuCQ8Z6Q/348s.jpg", "caption": "Tagliatelle alla Bolognese"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/6p1IMR1rjBNgW393x92Mwg/168s.jpg", "caption": "Margherita pizza"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/zGtEsRNl9XyqtUAB_qZg4g/168s.jpg", "caption": "Steamed Clams"}]}}, {"review": {"des": "One of my all time favorite restaurants in Chicago.<br><br>I love everything and anything about this place- from the Italian ambiance to the out of this world food. After visiting a couple of cities in Italy last year, I came back to Chicago on a mission to find a restaurant that would mimic the type of food I had there.. and I'm telling you guys- everything at Quartino reminds me of Italy. <br><br>My absolute favorite pizzas here are the Quattro formaggi (4 cheese) and the Rucolina (fresh wild arugula). They are simply out of this world, so sooo sooooo good. Ambrosial in every way. My favorite pasta here is the tortellini with Alfredo pasta with peas! Tastes like a replica of the ones I had in Italy. You also have to try the olive selection and pastrami! <br><br>I also love the vibe here, very rustic but chic. The waiters aren't that friendly, but the food and ambiance of the restaurant makes up for it. <br><br>It's a little piece of Italy located in Chicago!", "pics": null}}, {"review": {"des": "This was a hopping vibrant fun small plates establishment. They showcase authentic classic Italian dishes that are small but great for sharing. Our group of five ordered the spaghetti, asparagus risotto, ravioli, orechette, spare ribs and egg plant parm to<br>share. We also shared the beat salad and bacon wrapped dates for our appetizers. It was plenty of food for 5 people. Everything came out hot and expertly prepared. Service was quick and friendly. Highly recommend coming here with a group to try lots of yummy dishes. It's noisy but in that good way where you know everyone is having fun. I think it's great for groups.", "pics": null}}, {"review": {"des": "We went there a month ago.  Very crowded.  Our waiter was great and the food was great and unique playing for Italian.  It was like tapas Italian style.   We tried quite a few things everything was great.   We are definitely going to return.  Reservations in advance are recommended for the weekend!", "pics": null}}, {"review": {"des": "Arrived in Chicago for a conference the next day and had eaten here many years ago and had recommended it to many friends and family with positive feedback. Seated in the side patio area away from the main dining room and was a little quieter. Our server, Ray, was very good. He helped us with some wine recommendations and we took his advice and was very pleased we did. Had the veal meatballs and stuffed dates to start. I had the veal steak and my wife had the mushroom risotto. Everything was very tasty. We ordered the Kale salad and he forgot to include it with our order so they quickly corrected it at no charge. Handled the error quickly and made it a positive experience.", "pics": null}}, {"review": {"des": "Very low rating for taste. I'm pretty shocked by how high the rating is for this restaurant.<br><br>If you want fine dining experience do not be fooled by the nice decor and outer appearance of the place. <br><br>I ordered spaghetti and my friend ordered pasta. When the food came out we were not impressed by the plating. The food honestly looked like something we could make at home but we were still excited at that point and trusted that the taste was going to be good. When we started eating the pasta it honestly tasted like a cafeteria style pasta and not something you would go to a nice restaurant for.<br><br>Another thing that bugged us was when we were waiting for the waiter to take our orders he totally ignored that we were done looking at the menu and went to another table that was just seated and took their orders first. The waiter had walked right past my friend who even said hi to try to get his attention.<br><br>The only nice thing I have to say about the restaurant is that their bathroom is very nice and has a very cool soap dispenser. I had originally come to this restaurant because I saw that it had a 4.5 star rating on yelp I gave this place a very very low rating because I think that it is overrated on yelp.<br><br>Another disgusting thing about our food is that they had failed to devein the shrimp in my friends pasta dish.", "pics": null}}, {"review": {"des": "Yum! Eating here felt like we were in Italy eating the delicious pasta and pizza. We were visiting Chicago for 4 nights and came here for dinner two of those nights simple based on the good reviews. I would recommend any of the homemade pasta dishes and a pizza. We got the hot chocolate cake for dessert. Great spot, you are guaranteed a tasty meal here!", "pics": null}}, {"review": {"des": "We ordered steamed clam. The clams are not cleaned and it is stuffed with MUD. <br>Our waiter did terrible with this situation. No apology, and no explanation. The manager told us it is a natural thing. This place is terrible. We will never ever come back again. Very disappointed with this Sunday night dinner!!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tgOGwCkoXsXE5BKox5tsPg/348s.jpg", "caption": "MUD from clams, \"natural thing\" according to the manager.....  terrible"}]}}, {"review": {"des": "Visited Chicago for a few days and decided to check this place out for dinner. The wait was an hour long on a Friday night but I expected it since it's marathon weekend (and of course the thousands of yelp reviews.) I was also expecting for the kitchen to be backed up and service to be a little slower since they were slammed, but I Was surprisingly wrong. Service was great and our food came out pretty fast. My boyfriend and I ordered the Cesar salad, linguine with clams in red sauce, gnocchi, and the tiramisu. Everything was delicious and flavorful!", "pics": null}}, {"review": {"des": "Amazing family style eating with delicious food and carafes of house wine.  Such a great vibe here! Old timey movies playing on the tv's, a great mixture of diners of all ages, hipsters, business people, young lovers, old married people, families, party groups... The food is absolutely terrific and since you can order a ton of different dishes and pass them around, you can have a variety of tastes. All of the Italian dishes you love plus really good pizzas. The bigger your group, the more you can try. And then wash it down with mass quantities of house wine!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jSrukPeSyww0GGrbDFrLvQ/348s.jpg", "caption": "Bruschetta"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oi7Le7vFX7QWRf6z6NoIWA/168s.jpg", "caption": "Veal Meatballs"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/JzXDaVMX4zap8tjaLV0amA/168s.jpg", "caption": "Cocktails"}]}}, {"review": {"des": "One of the finest and very authentic Itlain food, the lamb in Rigatoni was cooked just perfectly and it was digitally accurate... great location, price and ambiance..<br><br>A good food is what you can remember after eating.. <br><br>Why 4 not 5? Its great no doubt but I had better..", "pics": null}}, {"review": {"des": "Came here with a big group of people around 8 PM for a birthday dinner. It was definitely packed inside and we were likely only able to get seating because we had made prior reservations. Good sign. A lot of people coming here must mean the food is good right?<br><br>ATMOSPHERE/ARCHITECTURE: 8/10<br><br>This place has a homey, classic feel to it, utilizing a lot of dark wood to set the ambience. There is always some old Italian movie playing in the background and apparently Al Capone and his crew used to hang around here back in the 1920s/30s. The restaurant is large and has a lot of seating. Easily 150+ and that is a conservative estimate. It was a little bit packed and tight for space in my opinion, but that just means it is doing very well.<br><br>SERVICE : 3/10<br><br>They were very busy but that is no excuse for the handful of marred mistakes that were made that were actually pretty big. We had ordered a birthday cake for a friend and it was supposed to come with a candle. No candle. Strike one. I ordered braised pork shank which I will get into later and it said it comes with organic vegetables. No vegetables. Strike two. And lastly, one our friends was struck with a bill double what it should have been at the end. Luckily she was immediately take aback and asked about it before realizing it was a mistake and it was a double charge, but this is a pretty grave mistake. Strike three.<br><br>FOOD: 8/10<br><br>Braised Pork Shank - First off, WHERE were the organic vegetables?! I would have entirely forgotten about this until someone at my table mentioned that it was supposed to come with some organic vegetables. Disappointed. However, the braised pork shank is FANTASTIC. The meat is cooked to perfect tenderness so that it falls off the bone and melts in your mouth. The flavor is really perfect to me. Not too salty. Some might find it a bit bland but I think it was seasoned exactly as I wanted. HIGHLY recommended. Just ask for the vegetables next time.<br><br>D'Anitra Pizze - Pizza with duck prosciutto which is cured in house with onion and wild agugula. The pizza overall was really good. Very authentic Italian style pizza that is different from a lot of the Americanized offerings in Chicago.<br><br>Pouilly-Fuisse White Wine - Very smooth clear tasting wine that had a little tartness to it. I thought this was a very good white wine and good choice for someone who wants something a little sweeter and lighter.<br><br>Gavi DOCG del Comune White Wine - Very similar to the Pouilly-Fuisse except with less tartness and also less sweetness. I thought it was good was well but preferred the Pouilly-Fuisse over this one.<br><br>PROBABILITY OF RETURN: 6/10<br><br>I would definitely consider returning here to try other food options. The things that they had were very good. Just turned away by some hit or miss service problems.<br><br>TO EAT OR NOT TO EAT: The food is good. <br><br>OVERALL: 6/10", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5r2jOyGAy5PL9iGpUEZO5w/348s.jpg", "caption": "Braised Pork Shank"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/_GS2N2wwWnXzNzS_QfSuhA/168s.jpg", "caption": "Pouilly-Fuisse White Wine"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/KnvZF_Za8Ha401mKts8Dgg/168s.jpg", "caption": "Gavi DOCG del Comune Di Gavi White Wine"}]}}, {"review": {"des": "We had a work dinner here- reservations for 17. We were seated immediately and the service was pretty quick even though it was packed. There were no open seats anywhere but everyone was working quickly and all the clients seemed happy. They definitely were staffed adequately which is SO appreciated. <br><br>Now about the food... it was amazing. We tried nearly everything on the menu and I don't think we left anything on our plates. Seriously that good. Amazing flavors and quality ingredients. They also have an incredible selection of not just small plates and entrees but meats, cheese and wines. And let's not forget the desserts- a large diverse list, everyone can find something! <br><br>This place is definitely worth stopping in to try! Moderately priced, quick service, huge selection and great location. I didn't get pictures of everything because I couldn't help tasting it before I took the picture ;)", "pics": null}}, {"review": {"des": "All the food are good 5/5<br>Reasonable price 5/5<br>Take reservation for even group of 14!<br>Amazing place to hang out<br>The thing is they don't allow to split bills <br>I love my pasta so much will go back again and again!", "pics": null}}, {"review": {"des": "We come here every year on annual Chicago weekend visit- it is the best Italian food and atmosphere!  Great service, delicious food, great wine- the bathrooms upstairs take you back, with Boraxo soap powder, remember grade school?  Will be back again and again!", "pics": null}}, {"review": {"des": "Our door seating fantastic. <br>Finochicna was amazing.<br>Rigatoni not all the way cooked. The sauce with it was fantastic! So good!<br>Gnocchi did not taste very good at all.<br>Service was good- maybe a tad slower than it should be.<br>Love the smaller plates to share- that's a good time.", "pics": null}}, {"review": {"des": "Let's begin with the facts; if you come to this unassuming place you will determine a way to come back. No questions asked! Tonight we dined, party of 3, on bread, cheeses, meats, a liter of wine (chosen from many), and a vodka cream pasta dish and pizza. The place was hoping, not a single empty seat in sight. Yet despite the high pace, the wait staff never forgot us. This place represents everything an American/Italian chain restaurant tries to embody, but can't!  This place is simple good, not investor driven or greed driven but for the love of customer driven. We will be back!", "pics": null}}, {"review": {"des": "We got there about 7:30 on a Saturday night.   The place was extremely crowded but regardless, we were sat right away inside.   One thing I noticed right away is that everything is really cramped.  They managed to figure out how to get as many tables in the restaurant as humanly possible.  <br><br>I don't remember our servers name but she was friendly, helpful and had a great attitude.   Calamari was not chewy at all, the breading was light and flavorful.  Definitely would order it again.  We also got the fried polenta and didn't like it at all.  I don't know the exact name of the dish but fairly sure this is was it was.  After a few bites we decided to cut our loses and not eat it.  My wife got the fettuccine and claims.   She loved it and I thought it was excellent too.  It was a definite winner.  I don't remember what I got but it was good not great.   At the end we decided to have some of the zeppolis for dessert.  We weren't crazy about them like I've read other people are in other reviews.", "pics": null}}, {"review": {"des": "Great food and friendly servers! Definitely one of my go-to Italian places. The only con is that it can get really loud, so trying to talk to someone across the table from you can get tricky.", "pics": null}}, {"review": {"des": "Eh. <br><br>Food is very very mediocre to me. I have been here 2 times and I decided on my last time I can do without this entirely. Food is bland. They are also always super busy and crowded. Good for them!", "pics": null}}, {"review": {"des": "Great food!!!  Being Italian, I'm very picky when it comes to this type of cuisine.  The big test is whenever I see gnocchi on the menu.  Most places just serve a pre-made product, but Quartino said it was homemade, so had to try it.  The gnocchi was great!  Maybe a little harder than they should be, but that happens sometimes when they are homemade, still, really enjoyed them.<br><br>Quartino's theme is kind of tapas like, the idea being you order plates that you can share with the group.  I'm not into that, the food is mine, LOL.  You can order the traditional way, that's what our table did, no problems at all.<br><br>I actually did a fair bit of customization and they were fine with it, and got everything right.  I ordered the gnocchi with their regular tomato sauce, a side of meatballs; and then I asked them if they do a chicken parmigiana (which wasn't on the menu).  They said they can make it no problem, they did, and it was awesome!  Probably one of the best chicken parms I've had, so very surprised it's not on their regular menu.<br><br>Overall great food, service and atmosphere.  Highly recommended!", "pics": null}}, {"review": {"des": "Poor service in a pretty package.<br><br>A disappointment. The food was good, but not great, but the service level was awful. We arrived early to have drinks before dinner and were faced with a disinterested and grim bartender. He did light up like a Christmas tree though when my (attractive) 23 year old daughter joined us. She at least got a smile and some attention.<br><br>But the prize, was the outright rude hostess. My party went tot he dining room while I paid the bar tab. When I approached the hostess stand and asked about my party, she ldid not look up, jerked her head toward the dining room, and said \"They're in there\" with no specific direction to where they are seated.<br><br>When I got to the table the rest of my party said she was rude to them as well. <br><br>The waiter was OK, but when the table talk in a restaurant  is about how bad the service is, you're not returning.", "pics": null}}, {"review": {"des": "This place is hopping. Even if you have reservations, expect to wait a bit because this place is packed out. As a result, you will not get really attentive service. The servers are very clearly stretched to their limits, but they do a pretty decent job despite having what appears to be a daunting workload.<br><br>The food is very good Italian. We got the ricotta plate which was very nicely done. We also had the meat and cheese plate. They let you pick your meats, cheese, and veggies. Everything thing in there is homemade & as far as I can tell you really can't go wrong. <br><br>For dessert, we had a piece of tiramisu & a banana split. The tiramisu was some of the best I can remember having.<br><br>All in all, a very tasty, satisfying meal. Not sure I understand why it's so packed, but definitely good.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Vw1xvtWJkGiHqFu4cj7FHw/168s.jpg", "caption": "Salum plate."}]}}, {"review": {"des": "Great place tm for Italian food. We were in food coma after the veal steak and rigatoni we ordered. It was extremely busy and had a 40 mins wait time. We were lucky to snoop around the bar and find couple of seats. This is the best Italian food I ate while in Chicago, albeit I was in Chicago for 3 days. <br><br>They have small plates for entrees so please order accordingly. The drinks are pretty good too! <br><br>If you're looking for a romantic dinner on a weekend night, please make reservations and choose a table accordingly. The people are super friendly, I loved all of it. <br><br>It would be a good decision to go on a week night. You'll love it! Cheers", "pics": null}}, {"review": {"des": "I had many friends rave about Quartino, but after visiting with family, I wasn't super impressed. <br><br>The atmosphere is a bit hectic, which isn't a problem, but we were seated next to the most obnoxious birthday party to ever exist. It was unbearably loud. This isn't necessarily the restaurant's fault, but I wouldn't come here if you plan on hearing what other people in your party are saying. <br><br>The food was good, but I can't remember anything that I would come back for. We tried the calamari, grilled bread and ricotta, meatballs, farmhouse chicken, the gnocchi, and the ravioli. I enjoyed everything except the chicken, which was incredibly dry.  We also sampled a few red wines, which were good...but again, nothing memorable.<br><br>Our waitress was attentive for the most part, but there were at least two dishes she forgot about on two separate occasions. I'm not sure if that was on her or the kitchen, but we had enough food that it wasn't a big deal.<br><br>The River North area is pretty packed and I'm not nearby often, so I don't think I'll come back unless I'm in the area and have out-of-towners to entertain.", "pics": null}}, {"review": {"des": "I been here once and it was good. Very Italian place, relaxed atmosphere. During summer and good weather they open outside. Delicious food, just if they could improve a little service. Otherwise everything was good", "pics": null}}, {"review": {"des": "Great, slightly casual atmosphere with solid food at a decent price.  Everything is meant to be shared tapas style and the varied menu allows everyone at your table to find something to nibble on.  The pizzas are very good and everything is very reasonably priced for the nice part of town.  Tons of desert options as well, which are delicious.", "pics": null}}, {"review": {"des": "I can not believe I haven't reviewed one of my ALL TIME FAVORITE restaurants: Quartino Ristorante, who featured my photos on their Instagram.<br><br>QUARTINO RISTORANTE<br><br>As always, I love to do my research and find out some info on the location I'm visiting, so I can use my reviews for reference. And this is what I found from various sources.<br><br>Quartino is a bustling downtown Chicago restaurant and wine bar noted for its distinctive Italian small plates menu, vintage décor, and attentive, personable service staff.<br><br>Their menu features Italy's regional specialties including artisanal salumi, Neapolitan thin-crust pizza, house-made pasta, and seasonal dishes.<br><br>Menu items, served in moderate portions and meant to be shared, are perfect for adventurous diners ready for a unique experience.<br><br>Quartino is owned and operated by the Gibsons Restaurant Group.<br><br>Founded in 1989 with the iconic Gibsons Bar & Steakhouse on Rush Street, Gibsons Restaurant Group has been dedicated to providing unmatched hospitality, quality, and value to its customers. <br><br>With 14 locations owned and operated in 4 states, Gibsons Restaurant Group spans 9 distinguished concepts including Gibsons Bar & Steakhouse, Hugo's Frog Bar & Fish House, LUXBAR, Quartino Ristorante & Wine Bar, Gibsons Italia, Chi Sox Bar & Grill (on behalf of the Chicago White Sox), Hugo's Frog Bar & Chop House (on behalf of Rivers Casino and Sugarhouse Casino), and The BOATHOUSE (on behalf of Creative Attractions). <br><br>Gibsons Restaurant Group also operates The Montgomery Club, the group's premier off-site private event venue.<br><br>THE STORY & SERVICE EXPERIENCE<br><br>Having been in the Chicago scene for some time now, and always seeking the best, it's no mystery that me and my crew have gravitated to many of the Gibson's concept restaurants.<br><br>I first became a regular at LUXBAR, and eventually wound up a regular at their other establishments, not as anything planned, it just so happens that I like the best, and Gibson's is the best.<br><br>Me and my crew love coming to Quartino Ristorante for their patio brunches.<br><br>Of course, I'm always ready for bottomless mimosas, and some delicious snacks.<br><br>Quartino is known for small plates and sharing.<br><br>I've tried so much of their menu. Some of my favorites are the octopus, the meatballs, and the spinach and arugula pizza, amongst others.<br><br>The service is mostly spot on, although at brunch, it can get a little hectic.<br><br>CONCLUSION<br><br>Quartino Ristorante is a must try SUPERB Chicago gem.<br><br>5/5 RECOMMEND<br><br>OF NOTE<br><br>*Large groups welcome, pre-ordering recommended for groups of 20 or more. Please call the restaurant for more information: 312-698-5000.<br><br>*It's downtown Chicago, so parking is a mess. I always get dropped off by cab or Uber.<br><br>*For more information: <a href=\"/redir?url=http%3A%2F%2Fquartinochicago.com&s=f85666e8d6551c6ef686f2b66f03c9417ceab00dc557c06fd01e8fa94884d18a\" target=\"_blank\" rel=\"nofollow\">quartinochicago.com</a>", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/-nkbTP_v-5UShvZRPrQudw/348s.jpg", "caption": "At Quartino's"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/BjGY0awLBP7puFAuU8zv5w/168s.jpg", "caption": "Shrimp Appetizer at Quartino's"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ESr6qJP715NgzTlWQmqp8A/168s.jpg", "caption": "Prosciutto at Quartino's"}]}}, {"review": {"des": "Usually not a huge fan of fancy Italian food, but the service was really great at this place since they were bright and made my not so great day a lot better :) <br><br>I got the cavatelli with some meatballs! The cavatelli was pretty normal, but the sauce was tasty with just the right bit of tartness from the tomatoes. The meatballs were great -- soft, peppery and flavorful. Just as I was eating this the server was explaining to the table behind me that everything at this restaurant was designed to be shared... whoops! As I dined for one AND got a dessert. <br><br>I got the hot chocolate cake with vanilla bean ice cream. Great vanilla bean ice cream, could taste that the ice cream was not artificially flavored at all but made with vanilla bean which I appreciated. BUT EVEN GREATER HOT CHOCOLATE CAKE. It was melty and dense and wow what a great little cake. I ate the entire thing so it got a bit sweet at the end with the chocolate sauce and everything but for the first 7/8ths of it was the greatest thing and greatest mood booster on earth. Definitely the cure to all bad days. Would come back for this cake. Maybe would come back to try the tiramisu too.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_t_VSuYartfGQzWNCQgvwg/348s.jpg", "caption": "Hot chocolate cake with vanilla gelato"}]}}, {"review": {"des": "Best restaurant in Chicago!  We sat at the bar and had the best service.  The bartender's suggestions were spot on and was so accommodating with letting us try wines before ordering. We decide on a Pinot Noir called \"Cherry Pie\".  You gotta try it!!!  We just shared the Salumi and Arugula Salads and the Penne al a Vodka. They provide this really cool grana padano grater, balsamic & olive oil, cracked pepper and salt grinder to make a tasty dip for their bread!  Menu was so reasonably priced and plates are meant for sharing.  So tasty!!!!!  Clean plates!!", "pics": null}}]}