{"name": "smoque-bbq-chicago", "reviews": [{"review": {"des": "If you are into BBQ, Smoque in Chicago is a BBQ experience that you don't want to miss out on. <br><br>Their ribs: Carolina and St. Louis-style both use dry rubs consisting of spices, tomatoes and vinegar in a very balanced fashion. What's particularly special about these ribs is that you can really taste the smokiness of the meat. Unlike other popular styles of BBQ, the meat here do not come off the bone completely, which I learned that the chefs have done intentionally to give the meat more texture. <br><br>Their briskets: Texas-style and by far my personal favorite thing to order here. I prefer the chopped version because of the perfect mix of fat and lean meat. Every brisket should taste like these: moist and tender with good textured, smoky, and well balanced in terms of flavors.  <br><br>All in all, every dish here deserves a try. All the meat can be enjoyed by themselves but you will find their house sauces, from sweet-tangy to peppery-spicy, a pleasant addition. Finally, you won't break a bank eating here. As a matter of fact, they are extremely affordable, which is always a win in my books.", "pics": null}}, {"review": {"des": "The best true (read: not covered in sauce, although I like that too) BBQ I've had in Chicago, although still not quite as good as \"pretty good\" BBQ you can get in Texas.  Tip:  Go early on a Sunday; 11-11:30 am is a good time.<br><br>A friend and I tried nearly all the meat varieties they have - chopped brisket, sliced brisket, st louis ribs, pulled pork.  Chopped brisket (as close as you could get to burnt ends) and pulled pork were my favorite, and I also liked that they gave you both sweet sauce and vinegary sauce.  We tried many of the sides too: fries (huge portion!), cornbread, mac & cheese, and cole slaw...which is vinegary, not creamy (for those of you who care).<br><br>I will be back!", "pics": null}}, {"review": {"des": "I have been here twice and there is a line out the door. I think this is the best BBQ in Chicago. My mouth still waters for the Brisket. The owners are passionate about BBQ and it shows. The only problem is that it's a drive to get their from the burbs. <br><br>Best Brisket and Carolina BBQ sauce. My recommendation is that you try it", "pics": null}}, {"review": {"des": "There's a reason Smoque is always busy!! <br>Their food is so amazing. The best barbecue I've ever had in Chicago!!! Beef brisket is always a go to and I actually LOVE the coleslaw here and I usually hate coleslaw!! <br>There's really nothing to go into detail with here. It's a great place. It's busy. It's worth it. <br>Enough said!!", "pics": null}}, {"review": {"des": "I had every intention to really love this place after eyeing up all the pictures and reading all the reviews but this place is a-ok and nothing more. The chopped brisket was a bit dry and kind of cold. The cornbread didn't have much flavor and the mac n cheese was too wateryish. The sauces were good but nothing great. <br><br>This place isn't worth any wait at all. I would say give it a try if it's convenient but don't go out of your way for this place.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/kELOlEJPgR1aN4FGOCVu3A/348s.jpg", "caption": "Chopped brisket with mac n cheese and cornbread."}]}}, {"review": {"des": "Wow...what  great joint.    <br><br>I ordered a half slab of St Louis Ribs and a side of sliced brisket.   Both were excellent.   Tender, nicely seasoned, very very good.    The brisket was so tender, it just melted in my mouth.    Six pieces of ribs, brisket, fries, mac and cheese and slaw was a lot of food....Maybe next time, I can split with a friend and get only 3 ribs, the brisket and share a side dish.<br><br>Great staff, very clean, very busy.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/LMfbzcH05ygmTA7EfQk8Lw/348s.jpg", "caption": "1/2 slab of ribs, brisket, fries and Mac n cheese. Slaw is free"}]}}, {"review": {"des": "We had a proper Memphis-style bbq dinner here during our tour of Chicago. While the ribs and pulled pork and brisket were wonderful, the star of the show was the not-on-the-menu candies jalapeños! Sweet yet slightly spicy, these little atomic morsels were unique and delicious! We also enjoy the brisket chili which was packed with flavor! <br><br>The best part was the friendly and helpful service. Everyone took care of us, taking away our dishes, and bringing us to-go containers when it was time to hit the road. <br><br>As for drinks, they only have the soft variety but they have no issue with byob. So, byob we did!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Rj6I5vzxGT1hB7tzYEhWkA/348s.jpg", "caption": "Complete with candied  jalapeños!"}]}}, {"review": {"des": "If one is a customer who has never smoked meat, this restaurant is a solid 4-stars. If you are someone who has smoked meat, this restaurant is a 3 to 3 1/2 star restaurant; a BBQ smoker aficionado will be able to smoke better food...but, then, it's a pain in the boongie to pack a 300 lb smoker in your checked-in luggage. :)<br><br>The restaurant is clean. The service is polite and quick.<br><br>This is what I had for 2 meals:<br><br>Pickled Jalepenos: Scrumptious!! The heat of the jalepenos was nicely balanced by the slight sweetness. Strange, but great flavor combination.<br><br>Beans: Decent. Warning: taste these before eating the Brisket Chile. Once you eat the Brisket Chile, you don't want to stop. Yes, the Brisket Chile is to die for. Oh...the beans...yes the beans are good. But, Psssssttttt...the Brisket Chile is better!!<br><br>Brisket Chile: You will thank the BBQ Gods for this side dish.<br><br>Coleslaw: Refreshing, yummy, delicioso, delizioso, délicieux, köstlich, , Oishī..you get the picture. This is a fantastic vinegary, no-mayo coleslaw. Made of cabbage & radish.<br><br>Pulled pork: Delicious and moist. Unlike most BBQ places, they actually serve you pork with the smoke ring. Most BBQ places we've been to (most of them highly-rated in Yelp), do not serve you any meat with the smoke ring. The smoke ring is a sign that the meat has been smoked properly. Also, most BBQ places do not inject their pulled pork. So, if the BBQ restaurant is not smoking the pulled pork for 6-14 hours, do not add additional rub to the pulled pork, and/or do not inject their pulled pork with marinade, you will end up with bland pork. My husband & I have just smoked pork during July 4th...we will eventually become BBQ Smoking ninjas. :)<br><br>Cornbread: Basic. *sigh*<br><br>Brisket: Boring. It was a bit dry. According to their website, \"The deep, rich smoke flavor is complemented by a 2-layer spice rub.\" Sorry, but, there was absolutely no spice rub or smoke flavor in the 1/2 lb to 1 lb of brisket that I had. Luckily, I was able to use the Carolina and Spicy Memphis BBQ sauces to flavor the brisket.<br><br>Great pulled pork and surprisingly wonderful side dishes. There is something for everyone at this restaurant.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/QdS6cllLCNgkfE4YmdYo8w/168s.jpg", "caption": "Back Left to right : candied jalepenos, Beans, Coleslaw Front Left to Right: chopped brisket, cornbread, pulled pork"}]}}, {"review": {"des": "Solid BBQ for the Midwest. You order your food first and then one of the Smoque employees directs your group to a seating area. The place was busy but the wait wasn't too bad, maybe 15-20 minutes (this was 6 pm on a weeknight).<br><br>My group of 4 decided to share a bunch of stuff: 1.25 lb of sliced brisket, full slab of baby back ribs, large BBQ beans, large mac & cheese, large fresh cut fries, and 3 cornbreads.  We chose sliced brisket over chopped for its higher fat content, definitely worth the extra calories. Included with the order were 3 types of sauce (Memphis style, Spicy Memphis style, Carolina style). The Spicy Memphis was my favorite -- I dipped everything in it! While the four of us were able to finish everything, we were absolutely STUFFED. We probably should have gotten one less side and stuck with 1 lb of brisket.<br><br>I thought the brisket was the star of the show. It was super tender and juicy and tasted amazing with any of the sauces. Ribs were good, nice and smokey. Out of all the sides we got, I enjoyed the beans and fries the most. I'm not usually a beans type of person, but the Smoque version was bursting with flavor. The fries were hot and fresh and tasted great dipped in BBQ sauce. Cornbread was decent although I couldn't tell you what constitutes good cornbread (I might have been too full to appreciate it). The biggest disappointment was the mac & cheese. The \"large\" we got was simply two of their pre-portioned containers, which are pretty small. Honestly it tasted pretty bland and the texture was not creamy or cheesy whatsoever. Would skip next time.<br><br>Overall, I'd come back here for the meat, though I'm not too excited about those sides.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/m7Bm0QzTooHG8ekh9bd3hQ/348s.jpg", "caption": "Sliced brisket -- get this!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/BKyqoSWHql2TtExXsqbLvQ/168s.jpg", "caption": "Full rack baby back ribs, fries, beans"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ccD21J6taGSpXdB_Iw9g0Q/168s.jpg", "caption": "\"Large\" mac & cheese (two containers), 3 cornbreads"}]}}, {"review": {"des": "I've been told about this place & how it is one of the best BBQ in the city. Therefore, this place had some high expectations from me.. & it they were met and exceeded! Located a block down and right past the interstate on Pulaski and Irving Park, Smoque is in its own tiny hot spot. I came here for dinner on a weekday night RIGHT BEFORE the line grew outside the doors. <br><br>The menu is small, which is ideal for an indecisive person like me...but has all the essential american BBQ options like Ribs (baby back & st. louis style), brisket, chicken, pull pork, and sausage. <br><br>Also, most entrees include a couple sides with the meal and coleslaw. Sides are fries, brisket chili, mac and cheese, cornbread, and beans. I had the chopped brisket with slaw, mac&cheese, and cornbread. MAN OH MAN, the mac&cheese was a small serving but soft, fluffy, and delicious! The cornbread is equivalent to the child of Famous Dave's cornbread (if you know, they have the BEST cornbread ever) with corn inside. Lastly, my food came with a Caroline BBQ sauce & and Memphis style BBQ sauce that i would interchangeably switch back and forth on my brisket. OOOO baby, it was a good, quick bite that came out pretty quick! Mark my word, I'll be back to get some of those good good ribs i saw others had.<br><br>12/10", "pics": null}}, {"review": {"des": "The food is so tasty and they give you a lot with each order. Service is friendly and pretty fast", "pics": null}}, {"review": {"des": "My favorite bbq in the city , besides my own ribs excellent brisket amazing and love there sausages. Line can be out the door during lunch so be prepared to wait a bit . But it's definitely worth the wait! I love there sauces too! Oh and  fries", "pics": null}}, {"review": {"des": "SOO I was super excited to try this place out and I WAS NOT DISAPPOINTED. The brisket was OUT OF THIS WORLD. I had a smile on my face the entire time, it was so juicy and delicious...I only wish I had a bigger appetite so I could eat more. Definitely recommend checking this place out if you're in the area. I actually ended up going to the one that's in the food hall and it was such a cute lunch spot!<br><br>Oh and I also need to mention that the mac and cheese was absolutely amazing....there was LOTS of cheese in that...so just be aware if you're a bit on the sensitive side. I am....but either way, it was SO worth it.", "pics": null}}, {"review": {"des": "Delicious! Used smoque bbq for catering for the last two events I have thrown and they do not disappoint! We got the brisket , grilled chicken and cornbread and everyone was very pleased! The bbq sauces are very tasty. <br><br>For catering, they did a great job estimating the amount of food we would need based on guest count and also provided utensils, napkins and prompt delivery service and set up.", "pics": null}}, {"review": {"des": "I'm from St. Louis, and I was quite skeptical about getting BBQ in Chicago, but I was pleasantly surprised by how good the food was at Smoque! They have really good BBQ, very good portions, and the prices aren't bad. I got a half slab of STL ribs with mac n cheese, fries, and coleslaw for an early dinner on Saturday. We had about a 30 minute wait in the line to order, and then a 15 minute wait for our food. It was surprising that the food took so long to arrive, but the food was fresh and hot when our names were finally called. My cousin and her friend both ordered the double meat brisket and pulled pork sandwiches, and it was a ton of meat. All of us enjoyed our food and were pleasantly surprised by how good the coleslaw was. It has really good flavor and is not your typical coleslaw. The watermelon iced tea and sweet tea are also winners!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/fVz9K1NLdKdsG9IDVPgKig/348s.jpg", "caption": "Half rack of ribs with fries mac and cheese and coleslaw"}]}}, {"review": {"des": "One of my favorite BBQ spots in all of Chicago! This is backed up by the fact that Smoque is Guy Fieri approved. I came here on a late Friday afternoon and the restaurant wasn't busy at all, though I wouldn't expect the same for for weekend lunch or dinners. We ordered the pulled pork sandwich, BBQ beef brisket, and the gumbo. We definitely could've gone without the gumbo but the sandwich and brisket was prepared just the way I like meat - extremely flavorful and moist. It doesn't seem like a lot of food at first but once you start eating, the meat fills you up really quickly. <br><br>I would absolutely come back to Smoque and look forward to the next time that I do. I think it's a Chicago BBQ essential highly highly recommend this place to not only meat lovers, but people who feel indifferent towards BBQ.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/faZMlUY7EDIONhQZXNFsBA/348s.jpg", "caption": "Beef Sliced Brisket, Pulled Pork Sandwich with sides of mac and cheese and Cornbread"}]}}, {"review": {"des": "The bbq ribs were amazing! When I went to pick up my order every one was so nice and pilot. Best rib ever!!", "pics": null}}, {"review": {"des": "GET THE BRISKET. <br>It was super tender, juicy, and packed with flavor. <br>Bbq sauces were so good. One's thick and sweet: Carolina style. The other one's thin and vinegary: Memphis style. <br><br>Ordered with a side of Mac & Cheese, Cornbread, and slaw. Cornbread was good, had bits of corn, but I think some jalapeños would amp it upppp. Mac & cheese was so bomb with a toasted breadcrumb top. Slaw was quite vinegary- not like most slaws I've had but refreshing! <br><br>Asked to switch my mac & cheese for fries and girl calling out orders gave it to me for free. That kind of customer service alone will have me coming back time and time again for sure, and with friends/family. <br><br>Fries were crispy and fresh. So glad she let me keep the Mac & cheese because it was delicious. So cheesy, and warm, like a hug you'd get from your grandma or big auntie.", "pics": null}}, {"review": {"des": "Amazing service! Efficient and friendly staff. Bar none one of the best BBQs I've had.", "pics": null}}, {"review": {"des": "Amazing. The rumors are true. I had the baby back ribs with a side of Mac and cheese and coleslaw and, although it was SO MUCH food, I wanted to keep eating. Slow cooked and smoked for hours, this BBQ does not disappoint. Nestled on a quiet corner, Smoque provides a laid back atmosphere with counter ordering and a casual interior. They'll help you find somewhere to sit after you order. It gets packed, so eat then get up for someone else to enjoy this incredible BBQ. Arguably the best in the city. I will recommend this place to anyone who says they're in the mood for BBQ and I will definitely be back.", "pics": null}}, {"review": {"des": "The barbecue was wonderful. It is so difficult to get that dark crusty surface with a moist and tasty inside. On the downside, I think they could make it work a little better if they took reservations or even when you are there they could give you a number or a beeper to indicate that your food is ready. Also we had Memphis BBQ sauce and I kind of prefer the Kansas City variety. On the plus side, they let you Bring your own alcohol in --you have to open it yourself per city rules. If I were rating on the food alone, it would definitely be five star but I think they could make the set up for ordering and delivery better.", "pics": null}}, {"review": {"des": "One of the the best BBQ places in Chicago! You order at the counter and then have the option of indoor or outdoor seating (weather permitting). I usually get a platter with 2 sides. I've tried almost all the meat options and the brisket and pulled pork are out of this world. <br><br>All the sides are good but I really love the Mac n cheese and the cornbread. You can also get a sandwich or platter with slaw which is also amazing. The place is usually packed and nothing fancy but if you are looking for some delicious meat Smoque is the place to go. There are a few options for sauce and you really can't go wrong!", "pics": null}}, {"review": {"des": "Nice neighborhood ribs and brisket joint! The combo meal is more the enough with a choice of two sides.  The brisket is nice and moist and tender - very tasty.   You get two sauces with your brisket and both taste yummy. <br><br>If it gets busy it'll be tough to find a seat but folks don't usually sit for long.", "pics": null}}, {"review": {"des": "The best dry rub pork ribs in Chicago. I get the St. Louis cut. They are pull part tender with just the right mount of smoke. These ribs are accompanied by two sauces. Memphis (sweet and tangy) Carolina (vinegar base) both good but I prefer the Memphis for these ribs. Carolina goes great with the fries :)<br><br>The meal comes with a vinegar cole slaw and a choice of two sides. Because I am pro carbs, I opt for the fries and Mac and cheese. Their corn bread is pretty good though so I get a side of that too. <br><br>Since I do not get the chance to stop here often, I also get the sliced brisket platter to go. Juicy tenders slices of brisket again with the right amount of smoke served with the same combination of sides and sauces. <br><br>Yeah I got two meals nothing wrong with that right? Muuuhahaha get in my belly!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/aNlc6_Rr-MHKbUsmeTwJdQ/348s.jpg", "caption": "It's beautiful"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/K4N4RO09NBrQINII5UQcZg/168s.jpg", "caption": "This is he place!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/cYCbBT5kpnWskIujzw7yag/168s.jpg", "caption": "Ready to smash this full rack st Full Slab St. Louis and Fresh Cut Fries"}]}}, {"review": {"des": "I had this place bookmarked for quite some time now and came here yesterday with a family friend who resides in Chicago now. OMG is an understatement on how amazing this bbq is. <br><br>We decided to go with a full rack of baby back ribs and pulled pork. The ribs were cooked to perfection. Im mad i didn't get a full rack of ribs just for myself it was so-amazing. The pulled pork was also good, but no comparisons to the ribs. A full rack comes with coleslaw and 2 sides. We went with the baked beans with burnt ends, which i had much better, but was still good and a side of fries. <br><br>This place is legit and and from reading other reviews gets very packed. We decided to come on a Sunday evening with hopes that it a be great day to come with it not being so packed and it was a great decision. We came in and i grabbed a table while my brother from another ordered our food. <br><br>The staff and cashiers here are great. They have cleaning staff that a take your trays after you eat and throw out your food to expedite table for the next arriving guest, which was awesome. I really enjoyed this place and look forward to ordering the Texas ribs on my return. This place is by far out of this world and the bbq here is very good. <br><br>If you love bbq and are in the Chicago area i highly recommend this place. You will not be disappointed!! I might have to get some dry ice and take a few slab of ribs back with me to N.Y.  <br><br>I will definitely be back before departing.....", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/KIzMo4MG1z4zxGoAzX7FPA/168s.jpg", "caption": "Baby Back Ribs & pulled pork"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y9-1nzSl_sh7PJHw_FzGRw/168s.jpg", "caption": "Bbq pull pork sandwich with Cole slaw"}]}}, {"review": {"des": "Great eatery. Well run trundy business, and a wonderful ambiance.  Can't help but feel happy in a place where everyone is having a great time enjoying delicious food.", "pics": null}}, {"review": {"des": "Smoque delivers a consistent quality delicious product every time. I usually visit the Smoque stand in Revival Food Court for indulgent BBQ sandwiches. I've also come in after work to buy the meat by the pound and containers of sides to bring to friends or family. It's great comfort food and always very appreciated.", "pics": null}}, {"review": {"des": "Don't be fooled by other bbq joints. Smoque towers above all the others. Be sure to have St. Louis ribs; no sauce needed, but sauces are great too. The sliced brisket can't be beat. Don't pass up the signature dessert, just save room, really.", "pics": null}}, {"review": {"des": "Yummy all the time! Food is great. Sides are great. The only thing is that it's super popular so lines and wait can be long", "pics": null}}, {"review": {"des": "Smoque bbq was highly rated on yelp and a byob so it had to be a win-win.<br><br>Only half of our party had arrived, so they wouldn't let us order. If we did, they couldn't guarantee seating for our whole party. I understand that there is limited seating and it's a popular place, but this rule was a pain in the butt. When the rest of our party did arrive, we ordered and waited a while to be seated because the rush that walked in earlier was happily eating. Luckily, they didn't prepare our orders until we had a table. <br><br>Finally we were able to dig in!<br><br>All of our platters were served with coleslaw and two choices of sides. Between all of us, we had pulled pork, three orders of sliced brisket, and one order of chopped brisket. Each platter was served with memphis and carolina style barbeque sauce. <br><br>Most of the meat is lean here. The pulled pork was delicious. I really enjoyed the crispy pieces. The chopped and sliced brisket were also very good. Two of our orders of sliced brisket were lean and one wasn't, so the brisket is not totally consistent. In all, the meat was tender and had a nice smoke flavor. The only thing I didn't care for was the Texas sausage. It wasn't memorable; it tasted like a regular sausage.<br><br>Now, for the special part of the meal: the sides!<br>Sides ranked: 1. Beans 2. Coleslaw 3. Gumbo 4. Chili 5. Mac 6. Fries 7. Cornbread<br><br>The beans took the gold. They had an addicting smoke flavor and just enough sweetness to make you want to ditch the spoon and drink it out of the container. (Okay, maybe that's just me). But seriously, Smoque BBQ should can the sauce from the bbq beans. I found it even better than the Memphis style and Carolina style sauces.<br><br>A very close second was the coleslaw. Thank God they include it on everyone's plate because we all devoured it. Not a single shred was leftover! The coleslaw was crisp, light and refreshing. I love that they didn't weigh it down with a ton of mayo.<br><br>The gumbo was in third. It may not technically be a side, but it is the same size, so we'll allow it. The spice level was where a gumbo needed to be. I couldn't find anything wrong with it.<br><br>Chili was next. It was heavy on the chili powder, but I enjoyed the kick. <br><br>Mac and cheese took fifth place. Smoque keeps their Mac classic: creamy and topped with breadcrumbs. I was thankful for the small portion, so I could enjoy the other sides as well. <br><br>Second to last, the fries. Just plain ol' fries here folks. Nothing to it.<br><br>And in last place, cornbread. Sorry cornbread lovers, but I found it as dry as a day old biscuit.<br><br>Smoque BBQ is a great place for barbeque in Chicago. Heck, I even like it more than some bbq places in Texas. Bring your friends, arrive all together, drink some beers, and get that food in your belly! Don't forget to order the bbq beans. Oh,  and if you have room, the bread pudding is full of cinnamon. It's delicious and I normally hate bread pudding.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/sMNXDJa53HRRI2VOK3M-tg/348s.jpg", "caption": "Order up. They can't take your orders until your whole party is present"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JoB-jlZvAsC-PM4DoRp16A/168s.jpg", "caption": "Guy!"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/FTo7Fr9YtymW4ed2n-8nTQ/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "The shredded brisket was amazing. Great flavor. I had the corn bread with Mac n cheese on the side. Everything was delicious. The French fries are fresh cut and soooo good. We will definitely go back", "pics": null}}, {"review": {"des": "OH NO!!! forgot to read my own prior reviews!<br>Smoque is nothing special.<br>I had to give it another try to see if it is better than my favorite Chicago BBQ or not.<br>Fell short of that...really short of that.<br>That's a shame as i always welcome good BBQ shops...need the variety but it just did not make it.", "pics": null}}, {"review": {"des": "Brisket was amazing! Nice smoky flavor and well cooked on inside. Im not a fan of coleslaw but I loved this one because it had no mayo<br> Homemade bbq sauce and cornbread that melts in your mouth", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zK0-t3KrX7dNQXKfHZnhrw/168s.jpg", "caption": "Brisket sandwich"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/atSeS-tQ3YUrp_dXmT9dPg/168s.jpg", "caption": "Brisket meal"}]}}, {"review": {"des": "One of my favorite spots on the north side for bbq! Every time I go the staff are extremely helpful and friendly. When it gets very busy they have a fairly nice system of having someone delegate where to wait or go which is very helpful. My favorite combo has to be the chopped and sliced brisket combined with their homemade sauces (which they are usually very generous with!) I'm also sure to get a side of the Mac and cheese. I absolutely LOVE their bread pudding and I believe they are very reasonably priced for the quality of food they serve. I highly recommend this place.", "pics": null}}, {"review": {"des": "Overall good, solid bbq. Nice, friendly service. I liked how they direct you to a seat. It was pretty quick to get in and out on a weekday lunch. Shared a few different things.<br><br>- St Louis ribs - nice rub and bark, easily cuts away from bone<br>- Sliced brisket - I tend to like the leaner cuts but this was nice and tender<br>- Memphis and Carolina sauces - no idea what went on them. Memphis sauce was thicker and close to a KC style. Carolina wasn't mustard but more tomato based in appearance like some NC styles. Both pretty good<br>- BBQ beans - smoky flavor with bits of meat<br>- cornbread - not too sweet<br>- slaw - was okay, nice palate cleanser, vinegar based. Wasn't sure what it was but slightly sweet, but too acidic.<br>- fries - plenty and greasy as god intended.<br>- peach cobbler - made in individual tins, a little too watery at the bottom<br><br>Lots of craft sodas. Don't make my mistake. Skip the fountain drink.", "pics": null}}, {"review": {"des": "Smoque is most definitely worth the trip from Schaumburg to the city. We've been frequenting this amazing BBQ joint since we lived in Albany Park a few years back, but that pulled pork and mac n' cheese brings us back time after time. <br>This is a no-frills place, y'all. Don't get me wrong. You'll get friendly, efficient service, a clean table and amazing food, but you should also expect to order at a counter, eat close to strangers and fill your own drinks. That's okay though because that's how a BBQ place should be, amirite? <br>Parking can be a bit challenging, but you're sure to find something if you circle the block. <br>In short, eat here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/4bzcqjHxfcDYynsGXbd6PQ/168s.jpg", "caption": "A little bit of everything: brisket, pulled pork, baked beans, coleslaw, mac n' cheese and BBQ sauce. Memphis style for the win!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VZ9ZNJmnXwHS7L-UbjU4zw/168s.jpg", "caption": "Kid's pulled pork sandwich meal = Just the right amount for me!"}]}}, {"review": {"des": "Soooooo gooooood! Have been there five or six times and they are consistent and high quality", "pics": null}}, {"review": {"des": "My husband loved his food but my food was just ok . I've had better bbq at home the taste of the food and the way it look was just ok . I ordered peach cobbler even that was just ok I've seen seen peach cobbler made with peanuts baked on top of it . My husband however loved his briskets other than that I have nothing else to say about this place", "pics": null}}, {"review": {"des": "Be ready to wait, but it's worth it. I recommend getting here before noon on the weekends to a sour the lunch rush. Limited seating and the line runs right down the middle of the restaurant. <br><br>Plates all come with two sides and coleslaw. The coleslaw is a vinegar base and is really tasty. Brisket is my go to with the house bbq. Must try the Mac n Cheese and I'm a big fan of the French Fries. <br><br>There's a lot of love behind this bbq joint and I would definitely visit again. My family has been here several times when visiting Chicago and they all would agree Smoque gets 5 stars.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QqLj8VEOg6Lt2t8ruHoprQ/348s.jpg", "caption": "Brisket, Fries, Mac n cheese, and Cole Slaw"}]}}, {"review": {"des": "I just Ubered here from Rosemont... but I'm from Seattle. Second time here! SO WORTH THE RIDE! I fly for a living so have had BBQ in Austin, ST Louis, Kansas City, Charleston... and NO ONE, and I mean NO ONE holds a candle to Smoque in good ole Chicago!!!", "pics": null}}, {"review": {"des": "Quick and delicious. So many people recommend this place to me because I live in the area. <br><br>Decent outdoor seating and the ribs were, of course, some of the best in the city", "pics": null}}, {"review": {"des": "Wow, Smoque was jumping on the evening we went. The line was almost out the door on our arrival and went out the door shortly after. For this venture we ordered the sliced brisket, texas sausage, rib combo (1/2 baby back, 1/2 St. Louis), mac and cheese, fresh cut fries, cornbread, and the pecan bread pudding.<br><br>The rib combo was pretty good with me liking their St. Louis ribs just a tiny bit more than their baby backs. Typically, I'm usually more of a baby back guy. The mac and cheese, fries, and cornbread were okay. The texas sausage was pretty good and had a nice snap to it. The takeaways for me were the sliced brisket and the pecan bread pudding.<br><br>The brisket was so soft that it barely stayed intact when lifting it with a fork. There was more than enough flavor where adding barbecue sauce was just to see how well it paired. I am no BBQ pit master or aficionado, but I really did enjoy the brisket a lot. The pecan bread pudding was a sleeper hit for me and my friend. We only ordered one to try and my friend took a small piece of it saying that was all he wanted. Yeah, after eating that small piece he came right back and apologized and said that he's going to have to be taking his half now. I wish I had ordered like six of them.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/62vP9g-Ozu-DZIT4NJaC5g/348s.jpg", "caption": "Menu and pricing as of August 19, 2018."}]}}, {"review": {"des": "I want earlier this week, this place never disappoints. I will definitely be back soon!", "pics": null}}, {"review": {"des": "We do love good barbecue and have been anxious to check Smoque out since we moved to Chicago. Their ribs and brisket are really delicious, perfectly cooked and deserving of the 4 stars. Have I had better? Yes, but not by a lot. So that's a win. Cute little barbecue shack type look where you order and pick up your food at the counter. It looks like it could get really busy & crowded in there. <br><br>The Coleslaw was great! Theirs is the vinegary variety and is loaded with flavor. Both the Mac & Cheese and Cornbread which were served in tiny oven tins were dry & just not worthy. I also didn't understand the sauce situation. My ribs came with 1 tiny container, my husband got 2 different ones. The containers were way too small to dip a rib into plus there wasn't enough sauce to even decide if I liked it. Squeeze bottles of sauce in the restaurant would be a much better option. <br><br>Prices are very fair but I wish they also offered a combo platter with multiple meats so you could get a taste of 2 or 3 items. It's always fun to sample in places like this. <br><br>We'll absolutely return but next time I'll stick with the meat only options & just order a side of coleslaw.", "pics": null}}, {"review": {"des": "This place is legit!! The reviews are pretty much right on. It's really good! And having it less than 10 minutes from my house might prove to be dangerous! I had the sliced brisket platter with the brisket chili (which was a little watery to my taste but flavorful nonetheless) and fries (more fries than I needed) as my 2 sides. Comes with slaw which was really very good! The brisket was tender, moist, lean and had a nice hint of smoky flavor. Was it the best brisket I ever had? No but I wasn't expecting it to be. That honor belongs to a friend of mine who does the best I've ever had on his Big Green Egg and smokes it low and slow for 16 hours. Yum. <br><br>I tasted my wife's baby back ribs which were awesome. Tender, fall off the bone deliciousness. I'd order those next time. They were really terrific. She opted for the corn bread ( a little small) and the mac and cheese. She loved it all. <br><br>This place is a clear winner. I'll be back!!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GoANV5PnU3-yyfcEFYC9gA/348s.jpg", "caption": "Sliced brisket platter. Really good."}]}}, {"review": {"des": "Tasty BBQ with awesome sauces. <br><br>Ordered the sliced brisket and pulled pork platter, added sausage and st louis ribs, with side of brisket chili and mac n cheese. Sliced brisket was very lean and a bit dry but everything else was great. Favorite was the pulled pork, which was surprisingly tender. My favorite sauce was the Spicy Memphis. Also really enjoyed the chili. Portion was small.", "pics": null}}, {"review": {"des": "Really great BBQ joint, makes you almost forget you're in Chicago. Tried a full run of their offerings from pulled pork, to brisket, to ribs, to chicken. And ordered straight down the line for sides. EVERYTHING was considered, differentiated in flavor, and on point. Will be back very soon.<br><br>Also the owner is a real sweetheart.", "pics": null}}, {"review": {"des": "I was underwhelmed with their bbq'd meats.  And walking into the place, thought it was ok.  Kind of divey which is kool.  The sides were solid.  Atmosphere was fun.  We got there just in time to beat the rush bc the line was out the door.  Maybe I was disappointed bc there was so much hype about this place.  My expectations were pretty high.  Not a place I'd visit again.  I was visiting from NY and had a better experience at another bbq joint.", "pics": null}}, {"review": {"des": "There's usually a long line at this place, but we got lucky and the wait time wasn't any longer than 10 minutes to get our food and seated. I know this is a barbecue joint, but my favorite thing on their menu is not their ribs, or their briskets, or the pulled pork, - it's their macaroni and cheese! They are so good, they were my two sides with the order. The ribs were good, just a bit on the dry side for me. Briskets were good also. I didn't like the sauces that came with the ribs, so I used Tabasco sauce instead. <br><br>They are a bit on the pricey side. I had the brisket platter, comes with coleslaw and 2 sides. I also added 1/4 of a slab. Total was $25. <br><br>I'm not much of a ribs person, so I'll be back next year, or when I'm craving mac and cheese.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7-ilmvLkBTcp4S1AoxqtVA/348s.jpg", "caption": "Brisket platter with 1/4 slab of ribs."}]}}, {"review": {"des": "Locations is a bit out of the way, but it's located close to the blue line CTA which made it easy to hop off when we arrived at O'Hare!<br><br>Our first meal in Chicago, and we were ravenous!<br><br>MENU: really simple to understand. Pick your type of meal: sandwich, platter (slaw by default and 2 sides), or a smaller plate. <br><br>PRICING: super reasonable for the quality and quantity! <br><br>We ordered: <br>1. Sliced brisket platter with slaw (free), BBQ beans, macaroni & cheese ($14/95) //<br>+1 Love that the brisket had enough meat on it, and not just fatty pieces!<br>+1 slaw was good! It's more liked pickled slaw, instead of the mayo kind. <br>+1 I really like the beans! Love that it's not too sweat, and the pieces of brisket made it super rich (in a good way).<br>+1 mac and cheese could be a bit hotter, but I think the portion size was good!<br><br>2. 1/2 slab of st. louis ribs with slaw (free), brisket chili, fresh cut fries ($15.95) //<br>+1 Nom! Ribs were great! Had a good amount of meat, and portion size was awesome too.<br>+1 Brisket chili not bad! It looked kind of like the BBQ beans though...<br>+1 YAS. Fries on point! Wish it had some cajun seasoning, but portion is HUGE!<br><br>Tips/Observations:<br>1. Their dishes are NOT salty at all, which is fantastic for me since I like to add my own sauces instead.<br>2. Really like the sauce combination that they give you with each rib!<br><br>Overall, probably the most satisfying meal I had in Chicago that did not break the wallet. I believe they have a location within a building somewhere near the finance district...", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1lX0VlEShHuaBDVFbdr9kw/348s.jpg", "caption": "Half rack of ribs with slaw and 2 sides"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uq_K188isrmJ-D5jMPRu9A/168s.jpg", "caption": "Sliced brisket platter with slaw and 2 sides"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/A8PQ5CjgLV4a4JEjBOhWvg/168s.jpg", "caption": "Menu 3"}]}}, {"review": {"des": "I've been to Smoque a couple times and the only bad thing about it is the fact that there is no parking!  The place is always full despite of that fact which is a testament to the great BBQ.<br><br>I've tried both the Baby Back Ribs and the St Louis Ribs and there is a clear winner--St Loius Ribs!  I've never been to St Louis but Smoque BBQ makes me think that trip might be worth it!  The service is great and the food is even better!  Highly recommend if you're looking for food that will stick to your ribs!<br><br>As far as ambiance it is definitely a laid back setting which makes sense as who needs cloth napkins while you're stuffing your face with BBQ.  If Carsons was still open Smoque would give them a run for their money.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/dNfv_pg1vMM9Wg6zrYliEA/168s.jpg", "caption": "St Louis Half slab"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zcbKALA3_U9RjeRU8x17jQ/168s.jpg", "caption": "Full Slab, Mac & Cheese, Beans"}]}}, {"review": {"des": "Looking for barbeque done right? Then stop the search you found smoque. Excelent product. Be ready for a wait depending on the day. Today was no wait bit the last time I was there we waited in line for 20 min before we even got in the door. Well worth the wait.<br><br>Lots of outside seating but the parking can be tricky.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/gzl7PZw_icX0oS1MvOb2eg/168s.jpg", "caption": "Rib platter"}]}}, {"review": {"des": "Seems like whenever I have visitors from out of town we always end up going to Smoque... and for a good reason!  The food here is awesome!  <br><br>For a party of 4 we shared a full slab of baby back ribs, half a chicken, pulled pork, cole slaw, fries, beans, and chili.  Nothing else to say than everything was great and highly recommend you come and try everything, can't go wrong with anything on the menu.", "pics": null}}, {"review": {"des": "Excellent food and service. <br><br>Brisket is tender and tasty. Mac and cheese is scrumptious but portion size is small.<br><br>Lack of parking but worth the struggle!", "pics": null}}, {"review": {"des": "Tasty Food, Slightly Overpriced<br><br>Smoque does a great barbecue, that's for certain. However, when you pay $15 for only a mild amount of brisket, you can still feel disappointed. Their $15 for two sides and a the brisket itself still left me decently hungry after the meal. However, I can absolutely say that Smoque was better barbecue than any I've had in Chicago. <br><br>Ultimately, barbecue is a combination of artistry and effort. Many barbecue shops end up lacking in one or the other. Smoque on the other hand is absolutely willing to put their artisan's love into their food. I went with a friend, and together we sampled the brisket, sausage, coleslaw, and mac and cheese. The sides were tasty, albeit not of the same quality as the barbecue. The brisket itself was absolutely fantastic though. <br><br>The way Smoque distinguishes itself can be felt through their brisket. While most brisket is either 1.) bland or 2.) drowned in sauce to replace flavor, Smoque manages to cultivate flavor organically through their cooking process. Their cooking process leaves a delightfully smokey flavor, and a moistness that is unmatched anywhere else in Chicago. Overall, Smoque is a great value for its slightly high price.", "pics": null}}, {"review": {"des": "Based on reviews we had high hopes for this place. We waited on low for about 30mins which wasn't a problem. But we were disappointed to learn they sold out of St. Louis style ribs by the time we made it up to order. Long story short we ordered the baby back ribs. They were decent but not worth the wait in my humble opinion.", "pics": null}}, {"review": {"des": "Five stars for the taste of everything I ordered which was basically brisket platter, cole slaw and corn bread and fountain drink (iced tea).  You don't even need a knife to eat the meat, it's that tender. Delish!! I thought I would take some home but ate every delicious bite. I am not a regular meat eater so this was a treat/sin and I would say worth it!  Slaw could have used a tad more umph, though nice to not have mayo drenched slaw but maybe a bit more seasoning just the same.  Cornbread was still warm and pretty moist and the sauces were both good that they provide for the brisket.<br><br>I took off a star for the person seating and the person at the register.  We got seated under the menu butted up against the wall where everyone would be staring at us to read the menu in a semi empty restaurant, there were better tables for us.  Plus the counter person did not engage enough to explain anything, ask any questions or inform that there are default sauces and if you want spicy you can ask.   Also I wish they did not have so much single use plastic in there.   The sauces are in plastic containers, plastic straws are still being used, plastic lids too, perhaps for the dining in they can put sauce in paper cups and get paper and wax straws...then I bump to five stars.   The person who gave us the stinky table did ask us if we were enjoying our meal and I did say Yes, except the table!  He apologized..next time we just speak up. I didn't speak up this time as I was taking in the menu, surroundings and getting my bearings.<br><br>I thought the price was reasonable for the very high quality of the food and look forward to going back next time I am indulging in eating some brisket again.", "pics": null}}, {"review": {"des": "I had a wonderful experience at Smoque BBQ today! The food is superb! I always judge a barbecue place by its sides. I can only speak to the ones I actually tasted. The mac and cheese is a small delight. Eat it while it's hot and crispy on top and you will be in mac and cheese heaven. The coleslaw is vinaigrette based. It was  crunchy, tart, and has a lovely subtle onion flavor. Quite good. The cornbread... Wow! It is almost as good as my homemade cornbread. It is creamy and dense and has a just the right amount of actual corn kernels in the batter. If you want to kick it up a knotch don't just butter it, add some of the candied jalapeños! Yum! The french fries are made with real potatoes and are crisp and perfectly seasoned. You can't go wrong with the fries. <br><br>Now to the part all of you care about, the meat. The baby back ribs fall off the bone so easily, and yet they are not greasy in any way. The only thing that comes off on your fingers is a little bit of dry rub and the occasional sauce you wound up getting your fingers into by accident. The brisket was so tender and moist I was actually quite happy eating it without any sauce at all. However, I can recommend all of their sauces. Based on what you like, a NC vinegar based sauce, or a smokey and sweet Memphis sauce you will find one you like. They even have a spicy Memphis style; however, I did not find it to be substantially hotter. I was not expecting to find a gem like this in Chicago.<br><br>One final, and in my opinion really  important comment, they take food allergies very seriously! My sister who has a very serious case of celiac disease and lactose allergy was able to eat here safely and without a trip to the ER. Al thank you for all the careful treatment. I look forward to visiting the next time I am in town!", "pics": null}}, {"review": {"des": "Freakin' Good!!!<br><br>In search for some good BBQ while visiting Chicago my wife and I decided to head a little north of the city and tried out Smoque. Trust me it was worth the trip! By far one of the best BBQ spots I've been to in a while. I think it's safe to say waaaaay better than Mighty Quinn's (NYC). There was just something about the <br>St. Louis Ribs that made you want another bite while you were chewing on your previous bite. The smokiness, the meat falling free off the bone, pure bliss. <br><br>For 2 people, my wife and I destroyed a full order of ribs, chopped brisket, beans and Mac n' cheese. I can't rave too much over the brisket, but honestly I never do where ever I go. But those ribs is a must. Another must (if you have room for it) is the delicious pecan bread pudding. You will be missing out on a taste of heaven if you don't try it.", "pics": null}}, {"review": {"des": "Get the sliced brisket by the pound. It's a ton of meat and the value is great. Came here on a Sunday afternoon at 3:30pm and luckily there was no line. Grabbed some sliced brisket and a few sides. I had everything on their menu and everything is delicious. Make sure to get the peach cobbler!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5YzGw-AbnTE8OvT67zCkiA/168s.jpg", "caption": "2 lbs. sliced brisket  Large coleslaw Large beans Small Mac"}]}}, {"review": {"des": "Fall off the bone, perfectly charred St. Louis riiiiibs, woooooooo!! I just had the best slab of ribs here at Chicago's own Smoque BBQ. Until now my local hometown buzz and neds reigned supreme...but this rich, juicy, tender, Smokey charred meat marshmallows in my mouth goodness  the brisket here is amazing too, I would recommend the sliced brisket and the St. Louis ribs over the baby back ribs. <br><br>Located 6 miles out the city, even though it was poppin inside, the wait wasn't too horrible. There were 5 of us and we were seated in about 15 mins and got our food in 25 mins on a busy Saturday night at around 8 pm, so I can only imagine what this place looked at around prime time 6-7pm. The staff here is awesome, very courteous and helpful, this is not a sit down restaurant but there was one guy who would go around asking how many in each party and reserving tables when people got up to accommodate each group which I thought was cool. <br><br>The price is not bad, my full rack with 2 sides and cole slaw was $25.99. There brisket chili is and I just added fries with that which were good. The cole slaw was really goood too. I saw a lot of ppl getting the beans and Mac and cheese but the Mac and cheese didn't look worth it as it looked like an ice cream scoop worth of Mac and cheese compared to the amount of fries they gave you, in too much of a fatty and wanted more for what I felt I was paying for. Brisket chili was a generous portion too<br><br>Smoque BBQ is rockin out some Midwest goodness, can't wait to head to Texas and KC one day because I love BBQ (frank underwood tap tap)", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/k7QlPLaX3iLwmIpKAgtr4g/168s.jpg", "caption": "Dreeeeeeewlz"}]}}, {"review": {"des": "The chicken and ribs (St Louis style) were great but the BBQ sauce was really wonderful! Beans and slaw were also good. And the pecan bread pudding was a great finish. Highly recommended!", "pics": null}}, {"review": {"des": "Pro-tip: Possibly the best BBQ the Chicagoland area has to offer without actually traveling to Texas.<br><br>I admit I had a really huge lunch before, so I only hade a taste of the smoke brisket and the baked beans. Also got a whiff of the sauce.<br><br>Sauce tastes semi-sweet/bitter Worcestershire-like. Reminded me of the jewel and crown spot that everyone loves (except me) called LA Barbecue.<br><br>Beans tasted more like Kansas Missouri pit beans , rather than Texas style.<br><br>Brisket had a nice barky moist taste that can and should be consumed without the sauce.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/b60VnRcD80xO6RAxlPjGhQ/168s.jpg", "caption": "Brisket with fillings plus corn bread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_W9gra7dICkUPwHAmPRgaA/168s.jpg", "caption": "Smoked brisket. Nice bark."}]}}, {"review": {"des": "Amazing food! The brisket is sent from heaven above, and the coleslaw - UNREAL. The side salad is a nice accompaniment to the meat, and byob is always appreciated. Great service and staff - will be back. Next time I will remember that you can't byob and eat outside. We had to move inside after popping open the wine, but the atmosphere inside was just as nice.", "pics": null}}, {"review": {"des": "Smoque has without a doubt some of the best BBQ in the city. Their staff is very friendly, you order at the counter and they'll take it to your table. They will also not let you throw away your trash. They absolutely won't! The food is also very fairly priced. <br><br>Now onto the best part, their food! I ordered a half slab of their St. Louis style ribs. It's got a delicious smoked flavor  and an excellent dry rub. You pour some of their Memphis style BBQ sauce on those babys and that's all she wrote. I ordered their BBQ beans and mac & cheese for my sides and my hole meal was absolutely fantastic. Smoque will definitely be my go to spot for BBQ.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tP3DTD9-fX23l8FWqM_pSw/348s.jpg", "caption": "Half Slab St. Louis ribs with BBQ beans and mac & cheese."}]}}, {"review": {"des": "Great brisket in Chicago! The long lines and tight seating spaces are worth it if you are looking for a hearty meal.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0yn2G9lLKuEcYYe3bdVGSw/168s.jpg", "caption": "My favorite sandwich."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/S_-t3umH1xrDcVIVG8omcQ/168s.jpg", "caption": "My meal!"}]}}, {"review": {"des": "Everything was great, especially the bbq gumbo and a nice spin on the smoked beans. Nice work Smoque crew.", "pics": null}}, {"review": {"des": "I don't necessarily consider myself a bbq connoisseur but I have had ribs from numerous restaurants ranging from low to high end locations in multiple states including Texas. Let me just say, this is hands down the best BBQ I've ever had the pleasure of tasting in my life. <br><br>The St Louis ribs were perfect and moist with the meat barely hanging on to the bone. I opted for the brisket over the pulled pork and I couldn't have been happier with my decision. Like the ribs, the brisket was equally as succulent and tender. The meat coupled with the savory Memphis style BBQ sauce was simply perfection on a platter. <br><br>At the time of our visit, they were having a BBQ gumbo special. The gumbo came in a small bowl filled with sausage, rib, chicken, and rice with the house gumbo gravy. The taste was decent and would recommend to anyone looking for something different aside from their usual sides.<br><br>Overall, the food was amazing and affordable. The staff was attentive and never missed the chance to clear away finished trays and even provided take-away containers/bags without having to be asked. While Chicago is famous for it's deep dish pizza, I would visit Chicago again just to have another taste of Smoque BBQ!", "pics": null}}, {"review": {"des": "yummy<br>i order the brisket plater<br>slice brisket<br>slaw<br>corn bread<br>mac & cheese<br>and 2 dipping sauce<br>was pretty good<br>i be back", "pics": null}}, {"review": {"des": "I love BBQ.  Smoked meats are hands down one of my most favorite things on earth. So I finally got here, to Smoque. It should have been a lot sooner!  <br><br>I got in around lunchtime, past peak rush time. I was greeted immediately upon entering. Placed my order and was seated.  The food was ready within a couple of minutes.<br><br>I ordered brisket, and forgot to specify sliced or chopped.   They have me chopped and it was excellent. I also got pulled pork, Mac and cheese, cornbread and slaw.  Everything was spot on. I am a big fan of a slaw that has a vinegary note to it. Smoque's slaw is just that.   Damn near perfect.  The pork was on point.  Fabulous mac and the cornbread was decent, although a bit dry. <br><br>Two sauces were given. Memphis and Carolina.  I thought they were both really good. I preferred the Carolina one though.   Make sure you get extra sauce.  Two of them wasn't quite enough for my liking. <br><br>Friendly people.  Easygoing vibe to the place. Excellent food.  Plus I was actually able to park on the street nearby!   I'll be back.", "pics": null}}, {"review": {"des": "First time here! Loved it! Service was fast and food was flavorful and filling. Friendly staff and didn't feel rushed.", "pics": null}}, {"review": {"des": "During my 5-year stay in Chicago, Smoque has become the clear favorite from some good old fashioned BBQ. There's not much else to say besides just go. The ribs and brisket, moist and succulent, are on par with some of the best BBQ joints I've tried. <br><br>For anyone who hasn't given the place a visit yet, Smoque is a must-try regardless of whether you're a regular joe or a BBQ connoisseur. Sure, the line can get ridiculously long sometimes....but did mention it's BYOB? Bring your appetite and crack open a couple of cold ones with the boys.", "pics": null}}, {"review": {"des": "All week I've been craving BBQ and today I finally satisfied those cravings. Sometimes you have to travel for good food and let me tell you it was totally worth the trip. 40 minutes drive in Chicago traffic to dine (get to go food) at Smoque BBQ. Today I had the pleasure of killing an order of baby back ribs, Texas sausage and the best Brisket in the city with Memphis style bbq sauce (which is needed, food so good that you don't need sauce) I encourage everyone that if you want some really good bbq try Smoque BBQ. If you can't make it to the full service restaurant they have a scaled down version at the Revival Food Hall", "pics": null}}, {"review": {"des": "I did a catering order for 40 people ordered 11 slabs of rib two trays of mac and cheese and some brisket.<br>We picked up the order because the delivery prices were pretty steep. But service was great! And the food even better :-) they give you a generous portion of barbecue sauce for the ribs in the brisket. The containers that they put the food in to keep it warm are excellent.<br>I will definitely be catering from them again.", "pics": null}}, {"review": {"des": "I've been meaning to go here for the longest time but to be honest I don't really crave BBQ. I associate BBq with summer and typically prefer to grill out on my own. Folks, my whole mentality on BBQ has changed after having Smoque. I regret thinking that way because Smoque is LEGIT. We got the St. Louis ribs and Brisket with sides of slaw, mac and cheese, and beans. Everything was on point. Although they are known for the brisket I loved the ribs more. The naturally infused smokiness was delicious and the meat fell off the bones. Mac and cheese was solid. I loved the slaw actually and at first I was hesitant cause I don't seek veggie based items but it was executed well. <br><br>Smoque's BBQ rivals that of the best BBQ I had which was in Austin, Texas. Thankfully we have a BBQ place of our own in the Chi to satisfy those cravings. <br><br>#RefereEats<br>\"I call it like I eat it.\"", "pics": null}}, {"review": {"des": "Meat falls right off the bone. Little pricey but worth every penny. Truly a must go for tourists.", "pics": null}}, {"review": {"des": "I don't know much about brisket. I've had it maybe 20 different occasions during my 63 years, but this stuff right here! I mean the brisket they serve at Smoque!  Beats the pants off any other brisket I've had. My only complaint is the consistency. I don't know the mechanics of smoking but the doneness of a particular  order  can sometimes vary. I've had an order that was a little rare for my taste and I'ver had an order that was overdone. Any time I had a problem though, the staff fixed it with no problem. This is a great place.", "pics": null}}, {"review": {"des": "Everything is solid here,  the meat come right off the bone and the brisket was fall apart tender.  I would come back for the ribs, definitely a full rack.", "pics": null}}, {"review": {"des": "Very good BBQ the chopped brisket is delicious and their coleslaw is so good not the mayo kind!", "pics": null}}, {"review": {"des": "St. Louis ribs  n the Mac cheese is off the chain!! High recommend. <br><br>The line can be long sometimes but it's worth it. Ask for all the bbq sauces mix them n figure out what flavors u like!", "pics": null}}]}