{"name": "the-purple-pig-chicago", "reviews": [{"review": {"des": "I have nothing but good things to say about The Purple Pig. The food was great and the service was even better so I left there happy and full. <br><br>The food is tapas style and I split three dishes with my sister and it was more than enough for the both of us, I was struggling to finish my half of the last dish. We ordered the cornbread, grilled octopus, and pork shoulder. We started off with the cornbread and it was alright but nothing special. The octopus and pork shoulder however tasted amazing! The pork shoulder was my favorite dish and is a must get. Very filling and great flavors! I would recommend both of those dishes if you ever stop here. <br><br>The entrance is down an alleyway but the sign is out near the street so it's easy to find.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/G0V9XXLv7RYnJXzEgtRS2Q/348s.jpg", "caption": "The octopus and veggies tossed in pesto was great!"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ah6Jc4Hz-pj0N7Rc6NO3yA/168s.jpg", "caption": "The pork shoulder tasted amazing and is a must get! Such a good dish"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aB85R5PvPi0JUSuWEnVx6Q/168s.jpg", "caption": "The cornbread is alright but wouldn't order again"}]}}, {"review": {"des": "Delicious small plates and craft cocktails. I love the purple pig. It's dimly lit and perfect for a date night. It's always crowded and loud, so just know that going into this restaurant. If you don't have a reservation, be prepared to wait at least 45 minutes. Even though the wait is long, there is always a place to stand and order drinks while you wait. <br><br>Great small plates and cocktails, long wait/always busy.", "pics": null}}, {"review": {"des": "I came here for a dinner with my team, after wanting to try this place for years. I finally made it! We shared a bunch of plates and everything they made was delicious. The sauces honestly make half the dishes here.<br><br>That being said, the below rankings are mostly for future me to reference when I go back.<br><br>Would Not Hesitate to Order Again:<br>1) Pork Shoulder: I blinked, and then it was gone like a dream. That's how quickly it melted in my mouth.<br>2) Roasted Bone Marrow: beautifully flavored and well accompanied with capers & greens<br>3) Grilled Broccoli: coated in an amazing tangy sauce<br><br>Would Consider Again:<br>1) Pork Belly (w/ Ginger Glaze): cut through like butter<br>2) Scallops: fresh, tender, and served over a delicious creamy orange sauce<br>3) Fried Brussels Sprouts: the generous drizzle of lemon juice makes all the difference<br><br>Slightly Underwhelming:<br>1) Pigs Feet & Pheasant: good, rich flavors, but small portions<br>2) Turkey Leg: it looked impressive on the plate, but otherwise it was just a normal turkey leg. It probably didn't help that Thanksgiving was just a couple weeks ago.", "pics": null}}, {"review": {"des": "Amazing food! It's tapas style and meant to share. I don't think they take reservations but we went Sunday ~2pm and there were a few available tables. We had the crispy pig ears which was absolutely delicious! The peppers provided a nice tangy acid that complemented the fried ears. It pretty much tasted like crispy bits of meat! Delicious! We also had the cauliflower with cornichons which was probably the best tasting cauliflower I've ever had! The octopus was good, delicious, soft but maybe a bit oily from the sauce. The gnocchi was amazing. This was not vegetarian since the ragú sauce had meat in it. This was rich and delicious. To end, we had the loukem...... not sure how to spell it but the Greek fried dough with honey. Best donuts. Better than beignets ;-)<br><br>Overall I recommend coming here. It's a great place to have wine and tapas and be a little adventurous!", "pics": null}}, {"review": {"des": "Not much to say about The Purple Pig, which is a good thing in this case.<br><br>Tapas styles food, great service, great food.<br>The portions are not too big but not too small, 4 dishes should be enough to share with 3 people depending on how much your party eats.<br><br>I wouldn't take a date here if you're looking for something quiet and romantic, there is definitely a more talky crowd but not overwhelming loud. <br><br>The milk braised Berkshire pork shoulder is my favorite on the menu here!! It's super soft full of melt in your mouth yummy goodness. The bone marrow pound cake is good too, the bone marrow adds a nice moist richness to the pound cake. A must go if you're visiting Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/TtI9JEkRCYLof0tXHFnfgQ/348s.jpg", "caption": "A must order!! Milk braised Berkshire pork shoulder"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Y6zd9bEfactFIAaUUdVTeg/168s.jpg", "caption": "Salmon"}]}}, {"review": {"des": "I was in Chicago over the weekend and looking for a good place to eat around 9 p.m.  I went on yelp and found the Purple Pig - with four stars and over 6,000 reviews, it looked promising!  I was not disappointed, and this is why I love Yelp!  I can always count on fellow yelpers when I'm in a different city.<br><br>The Purple Pig was crowded even around 9 p.m., and we had to wait 15 minutes for a spot at the bar.  There is a patio area, and the main dining area consists of a good sized bar and several high tables.  It looks like they have an extensive wine list and a good number of beers, but I just wanted a quick dinner.  I ordered the milk braised pork shoulder with mashed potatoes.  The pork was so juicy and tender that I didn't need a knife at all during dinner.  The pork was well seasoned, and the mashed potatoes underneath had a perfect creamy consistency to round out the dish. <br><br>The servers were all great, and the bartender was recommending drinks and wine to patrons around us.  He definitely seemed knowledgeable, and I'll have to come back next time to try some of their other dishes and drinks!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/bCxE0mz-bZKikK1mGNR3zw/348s.jpg", "caption": "Milk braised pork shoulder!"}]}}, {"review": {"des": "As visitors to Chicago, this place was on our list but we were nervous about the no reservations set up. We decided to try a late afternoon time and were rewarded by a short wait! Our small group was shown to our \"assigned seats\" at the communal tables and we started to review a menu that everything sounded tasty. With the help of our neighboring diners and the knowledgeable servers, we started our selecting our items.<br><br>We started with the recommended roasted bone marrow with an herb salad. We were provided 4 pieces of crusty bread. The bone was large and we used our provided bread quickly and were soon offered more which we happily accepted. The herb salad was perfectly seasoned with a  light, tangy dressing which perfectly complimented the marrow. <br><br>Then we moved on to the Ricotta Gnocchi with neck bone gravy. The light fluffy Gnocchi was a favorite dish. Grilled broccoli and Octopus a la plancha rounded out of feast of favorites. <br><br>One dish which wasn't a favorite was the eggplant caponata with goat cheese. This is usually a favorite dish of mine but this version was a little sweet for my preference.<br><br>The Purple pig has a nice selection of wines and beer. Be prepared to wait if arrive during the dinner hour and get ready to share your table with some new friends!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/c6LUAvSbF3xL7BkcyQbtFw/348s.jpg", "caption": "Toasted bone Roasted Bone Marrow With Herb salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HIJnidw14-Q5wYzfpzsTCQ/168s.jpg", "caption": "The kitchen and inside seating"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/V-xsC8_envX4Kk9mXGeB2A/168s.jpg", "caption": "Eggplant caponata"}]}}, {"review": {"des": "The SWINE!!! Why would you rave about the SWINE?! Let alone a Purple SWINE!! Because it's absolutely delicious...DUH!! <br>Prior to my Chi-Town Trip the suggestions kept pouring in about how The Purple Pig was a must visit...a ton of people I know were just raving about this place, for good reason! Amazing DELICIOUSNESS!!<br><br>~ Crispy Pig ears - 5/5 <br>Didn't realize it came with a Fried Egg on top. My server told me to mix it all up and eat it...so I took his advice. But first, I had to try a few of the Crispy Pig ears by themselves. Amazing! I'm not sure if this dish was suppose to be an appetizer or a main course. Either way, I'm just glad I ordered it...Crispy, Crunchy, Flavorful...FRIED!!! There's nothing bad about this dish! <br><br>~ Milk Braised Berkshire Shoulder - 5/5<br>Another absolutely amazing dish! Tell tale sign...this was something special; it was served with a spoon! NO KNIFE!!! My thoughts at the time: A piece of Pork Shoulder on the Bone served with a SPOON?! Hmmm...are they nuts?! Where is my KNIFE?! Did they make a mistake? Nope. Nope. Nope. They got it right! The meat is so tender, it just falls of the bone...no knife required! The Pork was just PERFECT! Tender, Juicy, full of flavor, complemented brilliantly with the Lentils & Mashed Potatoes. I could find no fault...just wish there was more. #LifeOfAFatty<br><br>I will endeavor to stop by here every time I am in Chi-Town! Brilliant!", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ezN2J5FuxGjc5uG41MmoEw/348s.jpg", "caption": "Milk Braised Berkshire Shoulder - 5/5"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/YAilOK5wp9D7teDMnA3Ppg/168s.jpg", "caption": "Crispy Pig's Ears - 5/5"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/ibvysOjaais2f_S8J8O8Cw/168s.jpg", "caption": "Menu"}]}}, {"review": {"des": "This was my first meal after landing in Chicago. My friends and I came by on a Saturday for brunch. We placed our name, walked around, and was called to our table in a little over an hour. Luckily since The Purple Pig is so centrally located, we were able to walk around and explore the city during that time.<br><br>The restaurant is crowded with a lot of communal tables. The family-knit atmosphere follows with the family-style of sharing multiple dishes though. Between the four of us, we shared 6 dishes, which was the perfect amount. My favorites had to be the Milk Braised Pork Shoulder ($19) and Chicken Thigh Kebabs ($17). The pork shoulder was perfectly cooked and just fell off the bone. The tenderness of the meat paired so smoothly with the pureed mashed potatoes for this divine consistency. As for the chicken kebabs, they came in huge pieces grilled on a skewer on top of beautifully roasted potatoes. The potatoes were so crispy, yet soft that just made every bite so heavenly. I'd definitely get these two dishes again.<br><br>We also ordered the Crispy Pig's Ears ($15), which is one of their most popular dishes. It comes topped with a sunnyside egg to mixed into the crispy pig ears and veggies. This was a nice dish with a sour twist, but didn't stand out as much to me. The Grilled Broccoli ($13) was a very unique take of the vegetable with a crispy yet creamy texture in a hint of sour taste as well. This was a favorite amongst our table.<br><br>Our last two dishes were the Olive Oil Poached Tuna ($12) and Stuffed Squid ($16). The tuna was so vividly colorful in a beautiful presentation from the purple potatoes, green beans, red peppers, yellow quail eggs, and of course the pink tuna. This was a fun and tasteful dish to try! Now although the squid was good, it came with only 3 pieces. It was also stuffed, so made splitting between 4 people a bit of a mess.<br><br>Overall, delicious and unique spot on various types of menu items. Even though I'm not the biggest fan of tapas, I'd still recommend coming here and living its hype. I'd definitely be back for their meat menu items though, especially that pork shoulder!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/exykUykj12kzQGwu_i6OWw/348s.jpg", "caption": "Milk Braised Pork Shoulder."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/LRQY4AAxzN0Z1DNVnOZRJw/168s.jpg", "caption": "Milk Braised Pork Shoulder."}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/U-ZkH2e0dEVX1uaOJtDaEg/168s.jpg", "caption": "Stuffed Squid."}]}}, {"review": {"des": "In the 5 nights that we stayed in Chicago, Purple Pig was by far our favorite meal! We got seated right away at a community table. Neither of us have any problems sitting with others and we angled our chairs to keep to ourselves anyways. <br><br>We started our meal with some local beers and the olive appetizer. Oh, em, gee. The olives were warmed/charred with shaved celery, a mustard type sauce and grilled bread. We both were just in awe of how delicious these olives were. We knew right away we were going to love everything on the menu. We had such a hard time choosing what we wanted next. The octopus, the panini, the cheese boards all sounded so heavenly.<br><br>We ended up going with creating our own charcuterie plate. We opted for a smoked goat cheese, a sharp cheddar, and then we let the waiter pick our third. We got two meats that included duck prosciutto & air cured beef. It came with a few accompaniments like olives, and spreads. We both loved it and it was the perfect portion for the two of us to share. I think we could have sat here and ate all night trying everything on the menu but we had plans that we had to get to. <br><br>Yes it is pricey, but the food quality is worth the price you are paying. The wait staff was friendly, helpful, and quick. I was in love with this place.", "pics": null}}, {"review": {"des": "I think this is my 3rd visit here - and it was definitely my favorite visit! Maybe it's because we had expert guides with us this time ;)<br><br>So we were stuffing our faces in Chicago and didn't have space for the charcuterie and cheese... but next time right?<br><br>We went with the fancy Egg Muffin (so good!), the Whipped Feta (fancy looking!), the broccoli (nothing special here), and the braised pork shoulder (terrific!). Simply put, everything was super good - and can't wait to come back :)", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TVTdWdwzF4QpGBYQw2G_cA/348s.jpg", "caption": "Shoulder"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qf9YAh6piSujT5F1T6PALg/168s.jpg", "caption": "I forgot... but I think it's burrata cheese"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/mO1HHUd5OD6QO5yKUV4TGA/168s.jpg", "caption": "Roasted Brocolli"}]}}, {"review": {"des": "Wasn't sure if this place was a tourist trap or actually had legit food! Stopped in on a Monday afternoon around 3 pm. It was bustling with tourists but we were able to be seated right away with a party of two. We went for a few of the yelp highlights: bone marrow, octopus and pork shoulder. The food did not disappoint!! The bone marrow was a generous portion with a side of perfectly toasted bread, herbs and capers and salt. They even provided us with extra bread after we ran out! <br>The octopus was perfectly cooked with a soft texture on the inside and slight char on the outside. It was served with green beans tossed in a pesto sauce. The pork shoulder was amazing! The pork was incredibly soft and tender and just fell apart as we ate it. It was served on top of the creamiest mashed potatoes! <br>Overall a solid choice but definitely popular with tourists, but for good reason.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AQqU213CbVA2422hbKPIwQ/348s.jpg", "caption": "Bone marrow"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/xfBHjAuksHqwuBFpsJ776w/168s.jpg", "caption": "Octopus"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lXha8eYdGRJnnXZ9UkpPTw/168s.jpg", "caption": "Pork shoulder"}]}}, {"review": {"des": "Wow. All I can say is Wow. Everything here we had was amazing. <br><br>Salmon - incredibly moist and flavorful. Larger than anticipated based on the price. <br>Salted Beets - huge portion and the best thing we had. The whipped goat cheese is so delicate and light yet incredibly flavorful. <br>Broccoli - my least favorite, but still amazing. A rendition of cheesy broccoli<br>Steak - unfortunately don't recall the name, but it was melt in your mouth good <br><br>A few notes:<br>-don't take reservations. We were there at 5pm on a Monday and didn't have a problem. They were full at 6pm. <br>- communal tables <br>- huge wine selection, 5 and 8 oz pours<br>- create their own soda water", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/5c2yrLmkvZH3iP9wIe4q2Q/348s.jpg", "caption": "Steak - don't recall the name but it was wonderful. Melt in your mouth."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wO3GAABDtvBQdLusnkQF8g/168s.jpg", "caption": "Salted beets with whipped goat cheese and pistachio butter."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/TJGd9K-nvWTEIcRTiI2WkA/168s.jpg", "caption": "Salmon - exceptional. Moist and flavorful."}]}}, {"review": {"des": "Couldn't wait to try this place when we visited Chicago. We tried several dishes and none of them disappointed: <br><br>Bone marrow: very smooth and decadent. <br>Beef tendon chips: probably our least favorite dish, but still good. very crispy. <br>Gnocchi with oxtail ragu: BEST DISH. Hands down. Could have eaten three of these.<br>Grilled Octopus: amazing.<br><br>Can't wait to go back!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/xPfZj0dEPPKW9E-55_0Xuw/168s.jpg", "caption": "Beef tendon chips"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fhVgcY5CTJVaT18fdGJqyA/168s.jpg", "caption": "Gnocchi with oxtail ragu- beyond amazing."}]}}, {"review": {"des": "Came here to see what's the hype all about and left a bit disappointed. Went in and sat at the long communal table since it was just me. I ordered the Stuffed Squid. The presentation of the plate was beautiful! But it was too salty for me. The black sauce was acidic so it definitely helped out with the saltiness of the stuffings inside the squid. It was an okay experience for me and the dish didn't really blow me away with its flavors. Maybe I'll try something else on the menu next time to see if I like it better.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/7eacCAwBiGgPRFlVY4nUcw/348s.jpg", "caption": "Stuffed squid"}]}}, {"review": {"des": "So glad we came! Heriberto took good care of us. He was very attentive, he had great suggestions for food and desserts, and he one when to bring stuff out since we ordered around 11 plates or so. We were really happy he took the time to chat with us, despite it being super busy on a Friday night.<br><br>Food:<br>We had lots: Beef Bavette, Duck prosciutto, prosciutto de Parma, grilled broccoli (the sauce is to die for! It's no anchovy-ish at all I think), manchego cheese(The cheese itself was amazing but the sauce is a little on the sweet relish side) <br><br>The standouts:  <br>Pork Shoulder- holy *%#]}{* that was good. Like really good comfort food. Fall off the bone tender. Wonderfully made with Gravy and mashed potatoes and these little crunchy things on top that were just perfect. <br><br>Turkey leg confit: I don't know because my husband ate it like a Flintstone.  For the young people, I mean it was huge turkey leg that is probably meant for 2-3 people but he just sat there happily eating like that old cartoon... anyhow! The sauce. It was magic. <br><br>Octopus ala Plancha-grilled octopus Oh so good. It's so smooth and the sauce is what makes it. <br><br>Bone Marrow- Bread with a dash of sea salt and the most deliciously dressed cilantro was KILLER! <br><br>Desserts: <br>Get the Bone Marrow Pound Cake. So good! Doesn't taste like marrow -and it's honestly one of the best pounds cakes I have ever had.", "pics": null}}, {"review": {"des": "Five stars for the food, 4 stars for the service and 2 stars for ambiance. We came on a Sunday evening around 5:30 and it took 45 minutes to get a table for 3. We're seated in the patio and at a big communal table. We're seated close to other guests and barely have any elbow room. The noise level is very high in the restaurant. It's very loud and it's not a place to have a nice quiet dinner and chat. <br><br>Our friendly server took our order and the food came in a reasonable time. We ordered the grilled cuttlefish, pork and charred cauliflower. All of the are delicious and impressively flavorful with nice combination of Teton each dish. The cuttlefish was grilled perfectly and the charcoal bread added a nice sweetness to the dish. The Coppa pork was cooked perfectly and greatly seasoned. The shishito peppers, lentil and pomegranate gave a nice flavor and texture to the dish. The cauliflower dish are delicious as well. It's tangy with a hint of charred flavor.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_IupQriDVqQ1SZy_x2y09A/348s.jpg", "caption": "Charred Cauliflower"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/aLBI5epEwhjZuCRzjtp2MA/168s.jpg", "caption": "Grilled Cuttlefish"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/2J-32bexA32I7PNPP2zqvw/168s.jpg", "caption": "Pork/Coppa with shishito peppers, pomegranate and lentil"}]}}, {"review": {"des": "Been meaning to get to this place for quite a while now! We were seeing a show at House of Blues and decided that we would go early and see if we could snag a seat at the bar which definitely worked in our favor! <br><br>I got there at about 5 and it was quickly filling up. When I walked in there were about 6 empty seats at the bar. I made a beeline and sat down, was greeted quickly by the bartender, cannot remember his name but he provided great service! He was very knowledgeable about drinks, recommendations, and ingredients. <br><br>We started off with the soprassata and a cheese that I can't even remember now but it was very bold and very funky! Great flavor tho! We ordered the crispy pig ears, salt roasted beets with whipped goat cheese and pistachio vinaigrette, and huevos rotas con chorizo! We also got a steak dish that was good but I didn't get a pic and the name of it escapes me now. But Everything was so good! I couldn't stop eating the beets and I wish I had more people so that I could try more things! We will definitely be back.<br><br>Oh, GREAT drink menu as well. Tons of selections on all liquors and wine.", "pics": null}}, {"review": {"des": "The Purple Pig was my favourite food experience in Chicago! Despite the hour-long wait to get seated, it turned out to be worthwhile.<br><br>Myself and a couple others shared 5 plates, which filled us up! Ranked in order from best to worse, we tried: Bone Marrow, Octopus, Pig Ears, Neck Bone Gravy, and Sausage. The first two were to die for but you could probably skip the latter 3. Also, space was really, really tight.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/SH_Lw3RA1bn75uGGADTlCQ/348s.jpg", "caption": "Neck Bone Gravy"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kc9BTjzUkw4ilErRDFfJqA/168s.jpg", "caption": "Octopus"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fp0dKG35JTK5CA49Shm_nw/168s.jpg", "caption": "Sausage"}]}}, {"review": {"des": "Not all that it's hyped up to be. Luckily, we got there right when it opened so the wait wasn't too bad. Very cramped inside. I felt like I couldn't eat freely without bumping into my neighbor. <br><br>I will say that service was pretty nice. They were attentive and quick to clear the table of finished dishes.", "pics": null}}, {"review": {"des": "I came here a few years ago and remembered how amazing it was. We decided to come back since we were in town, and it's just as good as I remembered!<br><br>We ordered the bone marrow, which was delicious. Comes with toasted bread and an acidic herb salad. There's also salt to season yourself. The combination is amazing. We also had the octopus, which was super tender. The best part of the meal was probably the milk marinated short rib. It's creamy on the inside, and it completely falls apart when you stab into it with your fork. <br><br>Everything here is rich and flavorful. The only downside is that everything seems a little fatty and heavy. But if you don't mind gaining a little weight, it's worth it!!", "pics": null}}, {"review": {"des": "Probably one of the more upscale places I wouldn't have imagined going to. I came across this place a few days before my friend and I took our trip to Chicago. It ended up becoming one of her friend's recommendations for must try places. So, one nigh we decided to just go for it since we were in the area. The wait time for a table of two was about an hour. To kill some time, we ended up walking around before indulging. We got seated promptly and the atmosphere was dimmed, but made it feel like a very lively outting- in. The waitress let me sample 3-4 different types of wine just to figure out my preference and she was more than accommodating in helping me select the right one.<br><br>We got the corn mash to start and it was so flavorful! The portion was a good amount for two ladies to share. <br><br>Then, we got talked into ordering the duck. This was a dish I didn't intend on ordering but the server said that they braise it for days/hours. I guess we couldn't say no. haha. It ended up being amazing. There were giant pieces of duck meat, unlike many other places that have ducks with more skin than meat. You put it in a fluffy bun and the white sauce on the side really compliment the entire entree. It's a mix of fun and umami flavors all together.<br><br>Finally, we had the bone marrow because that was the most ordered item around. I've never had bone marrow before, so I had a high expectation for this. It was huge!! Very fatty tasting, but it didn't make me feel \"greasy\". So that was great. Slap it on the crunchy/ soft side bread and top it with cilantro, and well enjoy! <br><br>Definitely on the pricier side, but a good type of pricey and I would say it was worth it.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/y78G3S7P-_fZGDN8NOmH7Q/348s.jpg", "caption": "Roasted Bone Marrow With Herbs"}]}}, {"review": {"des": "Was visiting Chicago, my favorite City, for a Bachelorette weekend. Amongst the funfilled events of complete debauchery I had to carve out sometime to eat at a resturant I've wanted to eat at for sometime now but have never had the chance during my former business trips to ChiTown. <br><br>Located at the center of the Magnificent Mile, The Purple Pig is a must visit. It's small and you might find yourself sharing a table with strangers but if you're open minded it really is a cool vibe and totally worth getting aquinted to new people.<br><br>I got lucky and was able to get seated at the bar right in front of the kitchen where all the magic happens.  Being able to watch the team put the flavorful plates together was an added bonus to my experience. Voted one of  America's best restaurants in 2010 the Purple Pig exceeded my expectations.  <br><br>My party of two ordered the smashed potatoes, octopus a la plancha and the Turkey leg confit. Please note the plates are meant to be shared and OMG it was more than enough food. Let's just say each plate just got better as they came. It was as if my friend and I were making music with our yums and oh's and ah's and wow's of how delicious everything was.  Minimal talking was had as we were too busy stuffing our faces with such deliciousness! <br><br>I was still a little hungover from the night before and had a flight to catch so I chose not to have a hair of the dog but they have an extensive wine list that I will absolutely try the next time I'm in town.  I will certainly be back!<br><br>If you're looking for delicious reasonably priced food and a good time with awesome service, you must try the Purple Pig. One of my all time favorite restaurants in Chitown.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/kzJVBvF8xNyUbQVvZEzzrw/348s.jpg", "caption": "The team that makes the magic happen..."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/vOwUNW-_KcgsM1o0WU8jYQ/168s.jpg", "caption": "The executive chef"}]}}, {"review": {"des": "This place was packed on a Saturday night.  The hostess will text you when your table is ready so you can walk around while waiting or you can grab a drink.  As a party of two were were seated at a large table with other unfamiliar patrons.  It was a bit awkward sitting face to face with a stranger but when the place is packed I guess you have to sit wherever you can fit.  <br><br>We started with the Nduja, it was a think sweet and salty salami spreadable paste.  While that may sound off putting it was actually delicious. They provided a slice of warm bread covered in cheese the eat with the Nduja.  It was a decadent start but washed down very easily with the wine. <br><br>Grilled Octopus entree came with fingerling potatoes, green beans and salsa verde. The octopus was tender and perfectly cooked. The Salsa verde was a flavorful blend of salt, acid and spice which complemented the sweet flavor of the octopus perfectly.  I really enjoyed this dish. <br><br>Roasted broccoli  with anchovy vinaigrette, roasted garlic and bread crumbs.  This dish was bursting with flavor.  The anchovy vinaigrette offered  salty, umami flavors and the roasted garlic rounded it out.  The one thing I couldn't taste much of was the broccoli.   <br><br>The server was very attentive and personable.  He knew the wine menu back and forth and had great recommendations.", "pics": null}}, {"review": {"des": "Definitely a great experience.  We were visiting Chicago and this place was highly recommended and I can fully understand why.  The place was very busy when we got there with no reservation but we were seated immediately at a shared high top.  The service was great, even with a crazy crowd.<br><br>The food was nothing short of amazing.  We ordered the bone marrow, scallion garganelli (chicken bolognese), grilled octopus and affogato for dessert.  Every single plate was practically licked clean.  Since we had shared seating, I got a chance to see other patrons choices up close and everything looked mouth watering.<br><br>Can't wait to come back", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/JveKY8ykZCNyliRG5Yy69g/348s.jpg", "caption": "Bone Marrow with herb salad."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/guk9GEk9zDs3-nuIsnn4Dg/168s.jpg", "caption": "Grilled Octopus- also amazing"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Lzpvkoq8seau4kIdhp5fRA/168s.jpg", "caption": "Scallion Garganelli -- chicken bolognese.  Absolutely amazing"}]}}, {"review": {"des": "Came here for a late lunch on a Tuesday afternoon. Sat at the bar and received fantastic service from bartender Ryan, who recently moved from Denver to Chicago.<br><br>I had the \"Our Purple Pig\" Pilsner on draft. They seem to be mostly wine focused, and their list is huge. I tried the roasted bone marrow, which came with some really good toast and a mostly parsley salad and coarse salt. Rich and decadent just like bone marrow should be. Then I told Ryan I wanted to finish off with something light and refreshing, and he immediately recommended the Caprese salad. This salad is awesome, and I liked all three main ingredients equally. The fresh buffalo mozzarella was perfect, the heirloom cherry tomatoes flavorful, and the charred onion vinaigrette zingy and great. <br><br>The space is crowded and busy, as I expected it to be. Perfect place to come as a party of one or two.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/-vkpACCvscKtNtmXoN4LOg/348s.jpg", "caption": "Caprese Salad"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/1EloJlQzSQ0kaWtwLLQMmw/168s.jpg", "caption": "Roasted Bone Marrow With Herbs"}]}}, {"review": {"des": "The Purple Pig is located on the Magnificent Mile, slightly tucked in from the street. They serve tapas that were mainly delicious. My favorite was a broccoli dish. My critiques are that the turkey leg was a bit salty and the octopus wasn't seasoned enough for the thicker chunks. The restaurant has a shared table concept and can get quite noisy and crowded inside. You will normally have to wait for seating. I would probably return if I have friends visiting the city.", "pics": null}}, {"review": {"des": "I was expecting to have a better experience at the Purple Pig. I'd give a 4 and a half for the food, a 3 for the space as well as for the service. Our server was not patient and wasn't helpful either when we were asking questions about the dishes. <br><br>The space is too tight, it seems like they try to squeeze as many people as possible in one table. Plus you have everybody bumping into you during your meal. And it's very noisy. Definitely not my favorite atmosphere. The cool thing is that you share your table with other guests. <br><br>Portions are meant to be shared, if you like that you will enjoy your meal. Dishes come to you as soon as they're ready, which I enjoyed. Ingredients used are fresh, and the flavors in general are very good. <br>I got the grilled octopus (one of the most popular dish), the roasted beets (which were great), the salmon crudo and the passion fruit ice cream (which was actually kind of salty, surprisingly). <br><br>Everything was really good food wise, but I just didn't enjoy my time there. (I'm happy we didn't had to wait an hour to get our table though, I would have thought it is not worth it)", "pics": null}}, {"review": {"des": "Okay so we actually stumbled upon this gem accidentally. It was the only place open late. We didn't realize it was an upscale restaurant. It was difficult choosing what to get on the menu with all the different and out of the ordinary items they had. Checking yelp as usual, I realized that the menu changes often. We ask our waiter what he recommends and he did not disappoint. We got a pasta item and this corn dish (I really wish I could remember the names). We devoured the food!! The flavors are not what you expect from the descriptions in the menu. I really hope I can come back here to try more of their dishes. This place knows what it's doing with their flavors and dishes. No wonder they have so many reviews and high ratings!", "pics": null}}, {"review": {"des": "I don't brag about a lot of things, but I'm quite proud of my restaurant selections when it comes to group culinary adventures. We were at a convention and hungry for lunch. It was finally time to leave the two-block radius and take a Lyft to Magnificent Mile. Originally we wanted Lou Malnati's but the wait was too long. I've had Purple Pig bookmarked for awhile, so we headed there.<br><br>Because it was a late lunch in the middle of the work week, there was no wait. Whew! I totally expected at least a 30 minute line. The four of us were seated at the high top communal table on the outdoor patio. Gorgeous Chicago weather, and perfect for hanging out on the patio, especially since it was covered.<br><br>We shared our food family style, and ordered quite a bit: <br>* Cornbread<br>* Chicharrones<br>* Caprese Salad<br>* Calamari Salad<br>* Garganelli Pasta<br>* Chicken Thigh Kebabs<br><br>The cornbread and chicharrones were my favorites. I could eat them forever. This restaurant -- both food and service -- lived up to everything I expected. Totally worth the trip out here. While I took a Lyft back to the hotel, some of my colleagues walked around MM for some sightseeing... great area to go for a walk and just check out the beautiful, historic sites!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/S5TlniBvvkQUaRhBB_UPYg/348s.jpg", "caption": "Cornbread"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/OYUm5Zqg2aQ6f5_syvRbjw/168s.jpg", "caption": "Chicharrones"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/aF8eBv09kGF2cu9MZZgI-w/168s.jpg", "caption": "Caprese Salad"}]}}, {"review": {"des": "My husband and I walked in around 430 in a Tuesday and were seated right away. They had heated outdoor seating and indoor available. We had ordered the salt roasted beets which were delicious and could pass for dessert. The eggplant caponata was also delicious and I would order again. Also ordered the pig ears which weren't anything special. They kind of reminded us of the French fried onions. The Bavette steak was also cook perfect for my husband and he had no complaints about it. <br>Only down side was that we didn't realize the dinner menu hadn't been given out. We would have probably waited to order from the dinner menu instead.<br>Overall, great experience!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/_IG8b-JTBd9P9WlqRNZrnQ/168s.jpg", "caption": "Eggplant Caponata"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hgE_6sgueAImiGhyQji9CQ/168s.jpg", "caption": "Salt roasted beets"}]}}, {"review": {"des": "Okay so the wait is crazy. Gotta expect that. But you can order drinks while waiting outside. They have a very extensive beer and wine menu, and if you want the best non-alcoholic drink ever, ask for the Baladin Cedrata citrus sparkling soda. It was amazing! <br><br>We then got in and wow, the food is worth the hype. Our party of 8 sat down and served the plates family style. I tried the risotto, the chicken thigh skewers, and the grilled broccoli (mind blowing, by the way). I originally was the only one who wanted the broccoli but after they tried it, we ordered a second plate of it! The rest of the table enjoyed some fish and pork plates, and everyone loved it. <br><br>Highly recommended - be prepared to wait. It's worth it :-)", "pics": null}}, {"review": {"des": "The Purple Pig has been a longtime favorite spot of mine and after many years it continues to impress. In fact, my latest visit was my best yet. I went here for lunch with a group of four and we split a bottle of rosé, and one order of the salt-roasted beets, whipped feta, chicken thigh kebabs, and octopus. It was the perfect amount for four people, and we were all silent when the food it the table because we were so busy eating. Though we thoroughly enjoyed each dish, the table favorite was the Chicken Thigh Kebabs - the combo of the crispy smashed potatoes, and deliciously creamy Tzatziki sauce was to die for. <br><br>This is a GREAT spot to share small plates with friends, just arrive early and plan to wait for a table - they do the whole \"we'll text you when we're ready\" deal so you can shop while you wait for your turn.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/sWAtyH0fzyUmd3CdI_sq3w/348s.jpg", "caption": "Salt - roasted Beets"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/OOKq-63WnzmFKWAsIPuJvg/168s.jpg", "caption": "Whipped Feta With Cucumbers"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/fQDVdvvOGvGfQJyWUZ4FIg/168s.jpg", "caption": "Chicken Thigh Kebabs , Fried Smashed Potatoes & Tzatziki"}]}}, {"review": {"des": "Once in awhile you find food nirvana. This place was recommended by a foodie friend and I only wish I'd come here with more people because I wanted to try everything!  To make matters worse, I sat at the pass bar and watched, in wonder at the symphony of movement and timing as five quick as lightning staff members, under the baton of the lead, moved deftly to compose each plate. One seasoning, handing it off to the grilled, another checking each bone of marrow, as another painted flavor and color across a plate. A final inspection by the lead just as a server swept by to take it to an eagerly awaiting patron. Each dish, more tempting than the last. Each person, more impressive in organization, skill and presentation. I highly recommend. Bring friends, order everything, and enjoy!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JjyHmIgDmKZg97Fx0z1v8w/348s.jpg", "caption": "Latte"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/FDBW78mSecVxjvOzFLWbnw/168s.jpg", "caption": "Eggplant caponata"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GHWUl-Gb9HkaX4gOrixKiw/168s.jpg", "caption": "Truffle sausage, foie butter egg muffin"}]}}, {"review": {"des": "One visit to The Purple Pig is simply not enough to give it a proper review.  I barely scratched the surface of what the menu has to offer, and even with the three items I ordered I was completely overwhelmed with how outstanding the food was.  One caveat - I didn't order the pork shoulder (I know, I know).  I wasn't that hungry and I knew that would put me over the edge.  The pork fat roasted almonds were unbelievably delicious, do not hesitate to start your meal off with those babies.  The salt-roasted beets are the absolute way to go after that, my goodness.  Light, fluffy, perfect.  I thought the mortadella was just ok, but that being the only dish I tried that was even slightly disappointing speaks volumes to the overall quality here.  <br><br>I want to come back as soon as possible and try every single thing on the menu.  Great vibe, fun and festive atmosphere.  Phenomenal.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/5THBaw02plLr9dVwKaRyVg/348s.jpg", "caption": "Mortadella - finely ground heat-cured pork * toasted pistachio"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/0NeokCfhvCfpN_popbfvqA/168s.jpg", "caption": "Salt-roasted beets * whipped goat cheese * pistachio butter"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n8uminwTl1T22w-mfFj7ag/168s.jpg", "caption": "Pork fat roasted almonds * rosemary * garlic"}]}}, {"review": {"des": "More than Mu Shu<br><br>I'm not an expert in pig cuisine, actually a newbie to it. I thought pulled pork came from playing tug of war with a pig. <br><br>But the purple pig on MIchigan Avenue has a terrific reputation and a line. There are even chairs outside the restaurant to people can wait comfortably. <br><br>I wasn't going to wait in line for a crowded restaurant. But when my meeting let out early and there was no line between lunch and dinner, I decided to give it a try. <br><br>I get it now!  Great food, reasonably priced. Everything has some meat, sauce and shredded something.  I sat at the chefs table and got to see 8 people crammed together push out amazing food quickly. The chefs table were all tourists who came because of a guidebook, many mentioned the James Beard award, all tried different dishes. <br><br>I had the porkchetta, Korean themed pork sandwich, and was very impressed. Loved the sauce, the hard role and whatever was on top of it. <br><br>The wine book was intimidating. I asked the waiter to bring me a full body fruity red that would go well with Korean pork sandwich, and he brought out a nice 16 dollar glass of wine. <br><br>Dessert was surprisingly excellent. The guava white chocolate mouse was light, sweet and had a wafer that made the flavors linger. <br><br>It is worth waiting in line for this place. <br><br>Going alone and sitting at the kitchen table was a fun experience. Going with a group and getting pig tapas to share would also be great. <br><br>Looking forward to coming back here!", "pics": null}}, {"review": {"des": "I know I am late to the game but I made it to The Purple Pig. I really enjoyed the food and the ambience. I wish I came here sooner. Definitely come here early because people line up before it even opens. Luckily we came right at 11:30a and didn't have to wait at all for a table. There are a decent amount of seats. A lot of communal seating for the larger groups and a lot of single tables for couples. We decided to sit inside and it was nice and cozy. I know it would be a great date spot for you looking for a date spot. <br><br>Server helped us with some recommendations and we went with the beets, cauliflower, turkey leg, pork shoulder and the bone marrow. The beets were excellent. The pistachio sauce had a funny color but it was amazing. The flavor and the texture of the sauce was unexpected and memorable. The whipped goat cheese was smooth and it enhance the plate. The beets were perfectly cooked and not too crunchy and soft. I would highly recommend this dish. <br><br>The cauliflower was good. The flavor was good but nothing out of the ordinary. The bone marrow was pretty good. I haven't seen a bone that big! It was nice to see and a really good portion. The herbs on top was nice and enhance the flavor. The bread was perfect, not to crunch and each to bite into. I would definitely get the bone marrow. The pork shoulder was great. Sooo soft and had the nice meat flavor. The mashed potatoes that came with it was like smooth and really blended. It was interesting. Last we had the turkey leg cooked in fat. It was amazing how the meat just fell off the bone. It was very tasty. I would recommend the shoulder over the turkey leg. <br><br>There is some street parking along Wabash if you are lucky. You can also do Spot hero. I was able to get a spot right across Eataly for 10 bucks. It's a nice short walk. The service was excellent and friendly.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/2_uUe6g_Il5laVQlVVY1-g/348s.jpg", "caption": "Salt - roasted Beets"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/d5IULASRIP7Fg0a7YmEt3A/168s.jpg", "caption": "Charred Cauliflower"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/L1qdHo7oTEf-LKJmsgs8pw/168s.jpg", "caption": "Turkey Leg Confit"}]}}, {"review": {"des": "Very good, but be prepared to wait. My friend came by and put our names down first, and even on a Monday night, there was a 1-hour wait at 8pm. <br><br>I came with one other person, but I'd recommend coming here with at least 4-5 people. The dishes are all small portions, so coming with a bigger groups allow you to try more dishes without breaking the bank too much. <br><br>Food: Octopus A La Plancha, Milk Braised Pork Shoulder and Chicken Thigh Kebabs<br><br>Drinks: Colombian Old Fashioned -- which was bomb!<br><br>I think my favorite was probably the octopus, it was super flavorful -- not too chewy or tough. I heard you can't go wrong with anything you ordered, so I definitely want to come back and try other dishes!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/QncIk1f0_0Gmxm3NFKJstg/348s.jpg", "caption": "Chicken Thigh Kebabs , Fried Smashed Potatoes & Tzatziki"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/peuB2ZYVtte7CcLheTef1w/168s.jpg", "caption": "Milk Braised Pork Shoulder"}]}}, {"review": {"des": "So this place has been on my list forever, just never made it since they don't take reservations until recent.<br><br>So when our table was finally ready and we approached the stand the hostess was quit rude about getting in line behind ppl putting their name in. The line part isn't a problem but she was very abrasive about it and yelled at us. This place is also way smaller than I expected. <br><br>Tapas are always hard I feel like we always order the suggested amount and it's either way to much or to little. <br><br>We ordered the<br>Octopus A la Plancha<br>English Muffin and Truffle Sausage<br>Lentils<br><br>and some of the specials which obviously change constantly. I believe the menu also changes with the season. <br><br>Everything we ate was good, however for a tapas place not the most sharable of plates. Overall I thought the food was good, but the wait time and price are not really worth it in my mind.", "pics": null}}, {"review": {"des": "Was in Chicago for a conference and came here on a busy Friday night. They told us the wait was 2-3 hours which was disappointing but we put in our name anyway, had a drink at another bar, and got in after 45 minutes. SO GLAD WE WAITED. <br><br>Our waiter was awesome....very friendly and happy to make recommendations. We ordered a wine for the table. Started with a few appetizers- I got the huevos rotos and nearly died of ecstasy they were so good and my friend ordered the grilled broccoli which was top notch. I also ordered the recommended smoked pork tongue which was like a savory chewy bacon (great choice) and the pork belly which was so tender and well prepared with the mix of flavors from the carrots and ginger glaze. I also appreciated that at a place that advertises pig, they had a lot of actually tasty vegetarian options. <br><br>I will say that we were seated at a table right next to a door that opened to the outside that everyone kept coming in and out of which made for some intermittent chilly spells. The food and company was so good, it made it worth it. <br><br>Would definitely come back to try more on their scrumptious menu!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/68GZiJ0z67szdzr0Z3KYIQ/168s.jpg", "caption": "Pork belly"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/fiJjX9AOgHQVY1wjjUSzCw/168s.jpg", "caption": "Huevos rotos- soooo great!"}]}}, {"review": {"des": "Waited for 30 minutes, but they do text when the table is ready. So we were able to shop around the area to Kill some time. We were seated quickly and had the pork shoulder and bone marrow. Both were absolutely delicious and enough for two hungry people! We would absolutely come back to try more entrees!", "pics": null}}, {"review": {"des": "Another place in Chicago where the wait is long, so here's my tip: GO TO THE BAR and see if anyone is leaving or is on their last course/paying bills and wait nearby for them to leave and get in contact with the server who is taking orders for the bar- she will help you grab those seats after! When you only have a few days to spend in Chicago- time is important- we saved an hour of waiting by doing this! <br><br>Wonder why the wait is so long? Because the food is marvelous. Yes- everything we had was delicious and we enjoyed it better than the 3 star Michelin restro in the area...and we pay a fraction of the price! <br><br>We sat at the end of the bar where all the food were coming out. We saw how chaotic the kitchen was, but a beautiful chaotic where they all worked in harmony to spit out great food in a matter of minutes. The young chefs also tried everything that came out to make sure taste is on point. It was like watching Hell's Kitchen but no yelling! We got the pork belly, roasted duck, octopus and a couple of drinks. The portion fit the price, so you won't be getting ripped off here or leaving hungry. The pork belly was nice and crispy and tender. Perfectly seasoned. The duck... good style of cooking duck- it was by no means dry at all. Plenty of meat and literally fell off the bone tender. I also LOVE the trout roe on the yogurt-like sauce...so good. And the last... octopus with green beans, potatoes and this lemon, basil oil- like a chimichurri, went so well with the charred octopus. <br><br>Definitely worth the wait...and I can see why people wait!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/4GrpXEdooDwdFea2iN09Iw/348s.jpg", "caption": "Octopus"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QlX0JozPFCSAiLRNUM9LlA/168s.jpg", "caption": "Bread"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cmoxi3z5qXngWKrPF4P8Ew/168s.jpg", "caption": "Duck"}]}}, {"review": {"des": "WHAT TO TRY?!<br><br>The deep fried pig ears, pork belly, cuttlefish, duck confit and the steak. I think the seafood options looked good too. Dessert wise, the chocolate, lime, matcha and banana bombé is a good choice. The peanut butter and marshmallow fluffy cake is another good choice to choose too! <br><br>Other than the deep fried pig ears, I didn't try anything I mentioned above, but from the looks at other tables, it seems like they looked good. <br><br>What I can tell you is what NOT to order. The turkey leg and the milk braised Berkshire shoulder was just overly dry. The turkey leg was also quite salty. It was salty from smoking the meat already but on top of that the sauce to make it more juicy just went over the top in terms of salt though. For the pork shoulder, the mashed potato tasted delicious but the meat itself was just overly dry. <br><br>The experience here is meant to tapas style meaning you share a couple dishes with your guests. Some of the meat dishes are bigger in portion so just gauge how much you want to eat. <br><br>LAST TIP?!<br><br>Be prepared to wait in line during prime hours for lunch and dinner!! You can leave your phone number and they can text you when a table opens up though! The best option to get seated right away is to either come after lunch hours or right before dinner (ex 4:30 pm). That way, you don't have to wait in line!!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/PUNft0C0F3gyiwa1M2GUjA/348s.jpg", "caption": "Turkey Leg Confit, Crispy Lentils, Napa Cabbage + Agrodolce. Huge turkey leg! However meat was dry and it was on the saltier side."}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/lUgowgWPtuDavQ8_U_gCaA/168s.jpg", "caption": "Matcha, lime, chocolate and banana bombé on shortbread crust. Don't really think the matcha stick on top was really needed. Bombé taste good"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/0z0yDWvEZOezg5qtHTigSg/168s.jpg", "caption": "Milk Braised Berkshire Shoulder, Mashed Potatoes + Puffed Farro. The pork was overly dry though. Mash potato tasted good though!"}]}}, {"review": {"des": "Yum. Several people recommend I check out this place when visiting Chicago, and I'm so glad I had the chance to drop by before leaving!<br><br>We came here about 10 minutes before their weekday opening lunch time and were the first in line. Soon after, the restaurant began filling up with lunch patrons - a mixture of families and business people.<br><br>As many others have mentioned, all of the plates are meant to be shared tapas-style, so bring a dining buddy or five so you can try more dishes! My friend and I shared:<br><br>+ Salt-Roasted Beets: FAVORITE DISH, no questions asked. All-caps because it was really that good. The presentation was lovely, and the flavors & textures all worked together so well - sweet, savory, a little acidity; tender beets with some crunchy pistachio bits and creamy, fluffy whipped goat cheese... Okay, maybe I just really like beets, dairy, and nut butters, so this was like the perfect dish to me haha. As long as you don't outright hate all of the above (or even if you do, have someone else order it and snag a bite - maybe you'll change your mind), give this dish a try!<br><br>+  Eggplant Caponata: close runner-up to the salt-roasted beets. Again, all of the flavors worked really well together; the bread was delightfully crunchy, and the olive oil added a nice freshness.<br><br>+ Octopus a la Plancha: this was highly-rated by a lot of people, but honestly I've had better octopus elsewhere. Nevertheless, it was nicely grilled and very meaty. Green beans were meh. I didn't really like the salsa verde; it had a strong mint flavor.<br><br>+ Milk-Braised Berkshire Pork Shoulder: the meat was super tender for sure, and overall this was a good dish but it didn't wow me like the beets and eggplant caponata. My friend commented that it reminded her of Thanksgiving dinner flavors, especially with the mashed potatoes.<br><br>Also, I'm not sure if it was just our table, but the service was pretty brisk for it being a pricier restaurant. Is shoving aside plates and water glasses upon bringing a new dish typical? At least the guy refilling water smiled. Not basing this review on the service, but it would be a 3 or maybe even a 2/5 when I look at our meal's bill.<br><br>I'll still recommend this place to others because the beets and eggplant were ah-mazing, but perhaps not the octopus or pork shoulder. The scallops at the table next to us did look tasty though (and the two ladies raved about how good they were)!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/PheHQfxiK4hgdP0n0lF6LQ/348s.jpg", "caption": "Milk Braised Pork Shoulder cut in half"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/B5ejbqtN6pfy8mOWdu-OTg/168s.jpg", "caption": "Milk Braised Berkshire Pork Shoulder with mashed potatoes and crispy lentils"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/jtDeyoslzqsFC0RgqbDTyA/168s.jpg", "caption": "Octopus a la Plancha with green beans, fingerling potatoes & salsa verde"}]}}, {"review": {"des": "A-mazing, a must eat place in Chicago!! I had heard a lot about this place when researching for our visit to Chicago and planned it out so that we could eat here one evening. The other reviewers were correct in that they do not take reservations and it is important to get their early and put your name down. At 7:00pm on a Saturday there was an 1.5 hour wait and we were seated at our table around 8:10.. so off to a good start! <br><br>When we sat down the waitress was quiet and the restaurant was noisy so we were a bit confused about how the restaurant worked, but we quickly figured it out. You order \"small\" plates to share, typically 3-4 plates for two people and then the servers bring them to your table to share as the chef makes them. We decided to try different dishes from different sections. Delicious!! <br><br>Okay so now the important info on the food- we started with Kerry Gold cheese and pino noir jelly. It was very good but \"least\" favorite of all the dishes. The second dish was the grilled broccoli in an amazing sauce and this broccoli was unlike any I had ever tasted. The best broccoli I have EVER had!! The broccoli and scallion garganelli tie for my favorite. The homemade pasta and sweet flavorful sauce were something my taste buds will never forget! Finally we shared the pork blade steak with arugula salad. It was the perfect finish to our evening but we couldn't finish it all after our three other dishes (we had LOTS of broccoli). Next visit to Chicago we will be back to try more of their food! Hopefully they can too our amazing experience!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/JttWGDrQKDnz4rQ1X8u0iA/348s.jpg", "caption": "Menu for 8/5/18"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HlUQtgrCOZrskSKEpHPRsg/168s.jpg", "caption": "Pork Blade Steak"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/7QU0xdxHH0tJ2GWDe7zxWQ/168s.jpg", "caption": "Grilled Broccoli"}]}}, {"review": {"des": "The 6000 Yelp reviews are what brought us in to dine at The Purple Pig. Although they claim to be tapa style dishes, the portions are big and one dish can definitely satisfy one person. I got the sweet corn polenta (they seem to switch up the vegetable for the polenta depending on what's in season). The flavours were great and everything complimented one another very well. The cherry tomatoes were the sweetest and freshest tomatoes I've ever eaten! The grapefruit purée was really overpowering, which was the only downside to the dish. I didn't give the restaurant 5 stars because I think the price is a bit much considering the taste of the food: great, but not worth the price point associated with it.<br><br>If you're coming during peak times, be prepared to wait! We put our name down and our wait was supposed to be 1-1:15 hours. The wait was cut a bit short because we indicated that we don't mind sitting outside. Although the wait was long, the service did not disappoint. We had a super bubbly waiter, and he was really helpful with walking me through the vegetarian options on the menu. The atmosphere is also very cozy at night, with dim fairy lights strung around the patio.<br><br>Verdict: You should definitely check this place out, if only to be able to say that you did. Worth the first trip, not sure if it's worth further trips after that.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/z-sfIujU0xidJZnKAPuuPQ/348s.jpg", "caption": "Sweet corn polenta"}]}}, {"review": {"des": "You know when you enter a place and the line is packed inside and out that you're going to experience something amazing! Well this tapas place was one of the most amazing experiences I've ever had. Needless to say everything tasted fresh and every plate made was beautiful! I decided to try the Grilled Octopus, Seafood Saganaki, Jamon dish and  the chilled calamari! Every single one of these dishes were flavorful, tasty and just outright amazing! I also want to say the Grilled Octopus's was out of this world! Perfectly made, tender and just outright tasty!", "pics": null}}, {"review": {"des": "The most legit octopus dish I've ever had, and I mean ever!!! I usually don't eat seafood in land locked states, but the pictures from my fellow Yelper's made me try this dish, and I'm so glad I did. <br><br>Decor-first this place is located in the Magnificent Mile which is a super cool location. One other note, location is not easy to find, but that makes it fun. Large bar, large outdoor eating area, and communal tables describe this place. Upscale everything and I loved the open kitchen so you could see them cook your food. <br><br>Service-I sat at the bar, and staff behind bar were great! They were attentive and seemed to live working there, which is very important to me. <br><br>Food-only tried octopus dish and was amazing!!! Super tender and fresh. Seasoned with a pesto and oil sauce that was packed with flavor. Asparagus and baby potatoes complemented octopus perfectly. Honestly, you could've put this octopus in cardboard and it would've been amazing! Staff mentioned they marinated octopus in wine for 36 hours and then seat it on stove for maximum tenderness. Simply amazing, well done guys!!<br><br>Can't wait to come back and try this dish again along with others.", "pics": null}}, {"review": {"des": "Thanks to my friend's passion about good food. We were there first one in line, waiting for them to open around 11 in the morning, just to make sure we get the kitchen view at the bar. We tried out the crispy pig ear, the Panini, gnocchi, and the bone marrow, which ended up being my favorite. The portion of the bone marrow was generous. It came with toasted bread with pinch of salt and acidic herb on the side. The herb salad was fresh and very well-seasoned and would cut though the fattiness and richness of the marrow perfectly. The assemble process of the perfect bite could be a little bit messy but the rewards you get from it will be well worth the effort. Personally, I am not a huge fun of the crispy pig ear (my friend loved it). It was definitely not bad, but as a Chinese I have my own favorite ways to enjoy pig ears. My friend laughed at me when I ordered the gnocchi, but hands down, it was the best gnocchi I've ever had. Not sure it's my favorite when it comes to the flavor (I like mine extremely rich and creamy), but the gnocchi itself was definitely the fluffiest and softest I've ever tried. Oh, almost forget to mention, the view from the bar was fantastic, also a very interesting experience to observe the food making process. The kitchen is always busy but super organized. Almost wanted to grab every single dish that came out of it.", "pics": null}}, {"review": {"des": "With 6,000 reviews and a 4/5 rating I thought my experience at The Purple Pig would be much more satisfying than it turned out to be. Don't get me wrong my meal was good, but it's not worth it to wait for a long time since they don't take reservations. If I lived in Chicago and recommending friends on where to eat in a short amount of time, this would not be in the top 5 places to eat...<br><br>The place is super cramped everywhere. We walked in around 5pm on a weekday and got seated in 15ish minutes. They have several large communal tables, seating at the bar, and regular tables. We got seated in front of the kitchen area/bar because those were the only seats left. Pretty cramped and loud but it was fun to see the chefs making the food. <br><br>My friend and I ordered 2 cocktails off of the menu. She ordered a basic Old Fashioned and I ordered a House Cocktail (can't remember the name of it but it was vodka based). Our drinks were pretty standard in taste, and the presentation was nice but one of the main reasons why I gave The Purple Pig 3/5 is that if I'm paying $14+ for a drink I expect more than half of my glassware to have liquid in it. The large ice cube they put in my cocktail literally made up half of my drink (see picture). I was pretty shocked because I've never ordered a cocktail where most of it was just pure ice.<br><br>***The menu changes pretty often and I believe the menu I ordered off of back in June has already changed*** Most of the dishes are 'tapas style' so the waiter recommended we ordered 2 dishes each.<br>We ordered the Roasted Bone Marrow (3.5/5 one of my friends favorite dishes and she said this was just standard- but the portion was very large), Roasted Pineapple (4/5 pretty interesting flavors), Asparagus (5/5 the best thing I ate here, it tasted like pasta but the whole dish was just tiny cut up asparagus), and the Milk Braised Berkshire Shoulder (5/5 the meat melted in your mouth and the mashed potatoes were delicious).", "pics": null}}, {"review": {"des": "Being our first visit to Chicago, we asked multiple Uber drivers and locals where their favorite spots were downtown. The Purple Pig came up multiple times in those conversations. My wife and I ended up going twice for dinner in the 5 nights we were in town. It's incredible!<br><br>We went both times at odd dining hours as we were told it is normally packed with long wait times. We didn't have to wait to be seated either time we went. <br><br>Highly recommend the chicken thigh kebabs and broccoli. Service was great and fast both times!<br><br>The Purple Pig is a must do while in downtown Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/RWtlLqZlVnZDSA8lkeWCVg/348s.jpg", "caption": "Chicken Thigh Kebabs , Fried Smashed Potatoes & Tzatziki"}]}}, {"review": {"des": "Definitely a 5 star meal. They don't take reservations, but you can track your progress on the waitlist via Yelp, which is quite helpful. It took about 90 mins to get a table for two this past Saturday night, and it was totally worth it. I ordered a rye whiskey cocktail off the \"original cocktails\" list, and it was delicious. Our waiter provided excellent service. He recommended 3-4 plates between the two of us. We were super hungry, and ordered 5 plates, which was probably a bit excessive.   We ordered the following:<br><br>1. Cornbread<br>2. Beet salad<br>3. Pasta with octopus/red sauce<br>4. Chicken thigh kabobs and potatoes<br>5. Cuttle fish with red pepper aioli <br><br>The kabobs were likely our least favorite, but still quite tasty.  Everything else was exceptional. <br><br>Definitely recommend this place, despite the wait time!", "pics": null}}, {"review": {"des": "This was my first experience with Mediterranean food and it did not disappoint. Three of us ordered different entrees and shared them all. All delicious choices-I don't think you'd be able to find something that wasn't. Give it a try, get out of your comfort zone, you won't regret it. Also, try the cornbread=heaven.", "pics": null}}, {"review": {"des": "This was also another restaurant I was highly interested trying. Party of 2 on a Thursday night, wait was about 90 minutes. This place is very tight, particularly inside. We were seated right in front of the cooks where they prepare their food, so it was a nice view the whole time. They have a very extensive menu so it can be difficult to decide. Fortunately, our server was incredibly helpful.<br><br>Lengua and salami - Started off with this. Salami was ok but the lengua had awesome texture and flavor<br><br>Brussels sprouts - It was cooked with a nice crisp while still tasting fresh. Recommend!<br><br>Bone marrow - Was a bit too rich and fatty for me. Appearance wise, it does not look too appetizing. Spread it on your bread and you're good to go.<br><br>Grilled broccoli - This is incredibly popular here but I just found it okay. I think the sauce was too rich and changed the texture/flavor of broccoli too much.<br><br>Pork belly - Fatty goodness with a sweet/sugary sauce. Recommend!<br><br>Cavatelli - Skip it, wasn't a fan. Octopus flavored pasta did not really do it for me.<br><br>Octopus a la plancha - Flavor good. Texture - meh. Ocotpus tasted a bit overcooked and had a dry texture to it.<br><br>Creme brûlée - I love me some pomegranate. Combine that with dark chocolate and you have an interesting take on this classic dessert.<br><br>Bootsy Collins - Fruity gin drink. Recommend if you like gin!", "pics": null}}, {"review": {"des": "Absolutely amazing. Everyone who comes to Chicago needs to stop here for an experience. <br>The food is delicious. They're mainly pork but you can also get seafood or chicken . <br>Flavors are very unique and most of their sauce is made in house. <br>Their portions is a little small in my opinion, except for the meat menu. Recommend 5-7 dishes for a group of 5.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/ZTm1fpbntq9iCjb2ETYWvQ/348s.jpg", "caption": "Calimary"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/GWt280R_PUU_Tv3eykhjcw/168s.jpg", "caption": "Turkey Leg Confit"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/NjzVCuV_FktjuRO756fuQA/168s.jpg", "caption": "Crispy pig ears"}]}}, {"review": {"des": "Of all the times I've visited Chicago, this is definitely my favorite restaurant so far. The food was delicious, service was good, and the ambiance is nice. Inside, there are large community tables and some smaller tables on the sides, which is great for groups or smaller, more intimate outings.<br><br>The menu is daunting. There are so many items, and we were informed that the portions varied, which is not listed in the descriptions. We weren't sure how many plates to order, so we took it a few at a time.<br><br>We ordered:<br>1. Whipped Feta - I didn't think I'd be a huge fan, but all the components together in one bite was absolutely delicious.<br>2. Milk Braised Berkshire Shoulder - We got this because it was advertised that it had been on Food Network. Very tender with excellent flavor.<br>3. Chicken Thigh Kebobs - The crispy skins and smashed potatoes were the perfect combination with the chicken.<br>4. Pink Guava + Fromage Blanc Mousse - OMG. I did not know I would like guava and raspberry so much!<br><br>Everything is so different and yet perfectly combined and balanced. I would fly back to Chicago just to eat here. (Or, Mr. Owner if you're reading this, please open a location in Houston. Thanks!)", "pics": null}}, {"review": {"des": "Be prepared to wait in line! I went on a Saturday ~2pm, and waited for an hour. But the food made it well worth it! The service was great as well. We started out with the meatballs, and the combination between the meat, sauce, and garnishes were amazing. Though it was pricey, it felt nice to treat myself with these. I wouldn't come here regularly, though<br><br>The octopus pasta was delicious as well, but my personal favorite was the milk braised pork. The meat was very tender and the added on mashed potatoes all melted in your mouth. <br><br>* these three dishes were shared between 3 people, and we left feeling satisfied.", "pics": null}}, {"review": {"des": "Melts in your mouth pork shoulder.  The bar tender recommend the hot dog and pig ears. The service was super fast as well.", "pics": null}}, {"review": {"des": "Hype smype. I was a tourist. I went to check it out. Staff is pleasant and kind- even to a single diner at the bar such as myself. Alcohol list (or book) was impressive with a section (!!) for gin and tonics. I was alone, unfortunately, so didn't get to try a ton of stuff. But I did get the octopus, which was SO GOOD. Also, tried the broccoli- which was good (rich, umami, salty, goodness), BUT- I wouldn't recommend ordering if you're dining alone. It's just way too much of one single thing/flavor, whereas something like the octopus had octopus+veg+carb, so was perfect to eat alone.", "pics": null}}, {"review": {"des": "Delicious, creative flavors and generous servings of small plates. <br>The entire dessert selection is amazing!!", "pics": null}}, {"review": {"des": "Ambiance<br>The Purple Pig is right at the hotbed of Michigan Avenue.  Do some sight seeing and shopping and then head to one's reservation.  One may be waiting outside as the inside is pretty tight quarters inside.  It's a very intimate restaurant and be ready for a lot of general background noise given how much traffic they get. <br><br>Food<br>Very cool tapas style dishes.  We love everything we ate.  The portion sizes are very generous for tapas.<br><br>Dishes<br>Pigs ear with crispy kale, pickled cherry peppers & fried eggs: <br>    -Crispy like it's fried food.  <br>Salt and vinegar beef tendon chips<br>    -Tastes like a pork rind, salty and vinegary<br>Chicken thigh kabobs<br>    -Sauce is amazing.  The thighs are crispy and tender. The potatoes are similar to potatoe wedges.<br>Octopus with green beans, fingerling potatoes and salsa verde<br>    -Chewy Octopus tastes very fresh.  Potatoes finished nicely on the side.  Green beans are salty and cooked to my liking. <br>Milk braised pork shoulder with mashed potatoes <br>    -Fall off meat, some saltiness, pot roast taste<br>Sicilian Iris<br>     -Fried donuts. Tastes like a beignet.<br><br>Service<br>The service is pretty good.  They sat us when they had availability and were attentive the whole time.", "pics": null}}, {"review": {"des": "Overall very worth the hype! Food is creative and generally good, although the ambiance and service could use a little improvement. <br><br>We were lucky to be seated right away at 7 pm on a Wednesday. Although the place is packed, inside the little room and on the patio. The overall turnout of food and service was not too slow at all.<br><br>Food: all of their dishes are going extreme. They're great creative and tasty ones, don't take me wrong. But their spice use and flavor level is very extreme. Like the Chilled Calamari, the calamari itself was so salty that your tongue would go numb for a few seconds if you have 3 bites in a row. So does the Eggplant Caponata, the mixture of sourness and sweetness is the only thing you can taste of the bite. You can't even tell there are eggplants there. Roasted Bone Marrow, same thing. It's like eating warm fat. It's like, the cooks punch you with the pure flavors in the face. I'd appreciate if I can taste some of the textures of food more with lighter flavors. <br> <br>Service: The lady at the front door was very cold and unwelcoming. So does our waitress. You can tell that they are busy and trying to juggle with all the people they have to serve. But come on, at least try to pretend you mean it when you ask \"How's everything\", instead of dropping the question then leave. But the Manager, I believe, is very attentive and nice. <br><br>They have an extensive drinking menu. So if you like spirits and wine, you would for sure appreciate their 30 something page drinking menu. <br><br>Overall a good place to eat and give it a try, but is it worth 2 hours of wait? I don't think so.", "pics": null}}, {"review": {"des": "A lot of people come here for the wine and cheese! The wine menu is extensive and there is something for everyone here. I came for the food and I thought it was delicious! The food here is meant to be shared and that's what we did!<br><br>We started with the calamari. For once, we got calamari that wasn't fried and I wasn't expecting to like it, but it was one of our favorite dishes! It comes cold and with plenty of flavor. It's a very refreshing dish and I recommend it. <br><br>The roasted bone marrow was tasty! It comes with an herb salad and sea salt on the side. I like that we can add our own salt to the bone marrow and the herb salad wasn't bad! It had a lot of cilantro, which I'm not too fond of, but the sauce really overpowered the cilantro so I couldn't taste much of it. <br><br>Next was the milk braised Berkshire shoulder. It was soft but way too salty for us. The taste was a little heavy, especially with the mashed potatoes. <br><br>Lastly, we had the turkey leg confit- one of our favorites! It was delicious and the portion was huge! It didn't have a bone in it and was so tender. The seasoning was delicious. <br><br>Overall, I enjoyed the different flavors here. It was unfamiliar yet delicious. I recommend if you're in the area!", "pics": null}}, {"review": {"des": "Upon getting here we checked in  with the hostess and she quoted us a 45min wait, we then went to the small waiting areas with the amazing outdoor heaters. Someone greeted us and we ordered some wine while we waited for our table. We were seated within 30min. <br>I highly recommend the beets with whipped goat cheese, the octopus and the croquettes. Each were simply amazing and flavorful. Definitely put this on your list if you're coming to Chicago!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/kyVMBMVc_K9bqpyrhjQr9A/348s.jpg", "caption": "Octopus"}]}}, {"review": {"des": "Overall, I'll give this place 5 stars primarily for the taste of the food. My only issue with places like this is I spend a lot of money but still leave hungry, which was no different here. I guess my suggestion would be don't come here if you're starving, or plan on emptying your bank account. The food, however, is always high quality.<br><br>I came here on a Thursday night around 7 and there was a ~45 minute wait for a party of 2. The place is very crowded and tight as most people have mentioned, but it makes sense because the place is very popular so I'd prefer that over an extra long wait. After I got the text notifying me of my table being ready, we were seated right away and our waiter was there quickly.<br><br>I ordered the double IPA on special (don't remember what it was) and it was pretty good, but as you'd expect for this kind of beer it was a pretty small glass and cost $8.<br><br>For food, we ordered the deviled eggs, octopus cavatelli, Greek sausage, and steak. In order of preference:<br>1) steak - I cannot remember what kind of steak this was, but I know it was served with green garlic and breadcrumbs. This was definitely my favorite dish. The meat cut easily with a butter knife and it was so flavorful. There were about 4 slices on the plate, each slice being roughly 2 bites.<br>2) sausage - this was very tasty as well. No complaints, and the portion wasn't too small.<br>3) deviled egg - this was the best deviled egg I've ever had, but I was a little disappointed that the order only came with 1 egg for $8.<br>4) cavatelli - this dish was a decent portion size but I thought the sauce lacked flavor.", "pics": null}}, {"review": {"des": "Fantastic place for lunch. It's got great energy. Superb wine list by the glass. Would be great for dinner too. Awesome with a friend or even a group of friends. Foot was amazing. Tartufo cheese was excellent and the accompaniments were even better. Calamari was AMAZING. The calamari was AWESOME. It was light and refreshing and not fried. So awesome.", "pics": null}}, {"review": {"des": "I was staying across the street and decided to pop in for dinner with a few coworkers, not realizing how popular this place is. We were able to get seated in the back, at a bar-top overlooking the kitchen/prep area, which ended up being pretty cool because we got to see just about everything on the menu. The bone marrow is a pretty popular choice here, however we opted for the pork belly, \"pizza\" and ribs. Everything was great, despite service being a little slow. Highly recommend!", "pics": null}}, {"review": {"des": "mediterranean food. This place is pretty good. We got lucky since it's a weekday and this places doesn't take reservations, we didn't have to wait so long. Prob around 20 min. The service is great and food is good but of course not all the food. My lease favorite was the chicken skin with beans on top. It's very salty. My favorite was their salmon sashimi ( special of the day) and bone marrow. Overall we had a blast.", "pics": null}}, {"review": {"des": "As you can see I have been here several times before where I enjoyed my prior lunches. My party of 4 decided to return here again for lunch. Because this place is noted as a tourist trap, I really don't mind being trapped here in this particular restaurant. We knew to arrive here early around 11:30am when they first open because there is always a line outside to enter this restaurant for lunch. We waited inside the adjacent office building. We were seated almost immediately again in the adjacent tented area.<br><br>I started and enjoyed my rebel scum cocktail for $13 and my speckled hen draft beer for $8. A 8 ounce glass of Tasca Leone is an expensive $19 each. My guests enjoyed 4 of those glasses. <br><br>My #1 favorite shared plates here is the Saganaki seafood for $22, (which I enjoyed last time). This time we also enjoyed the shared Caesar salad for $10 and the calamari for $14. I felt the pizza for $14, bavette steak for $20 and meetballs for $13 were not as unique or as tasty. We all felt the saltimbocca for $16 was tough and our least favorite shared plate. The four of us agreed.<br><br>Heriberto served our table needs well. My total bill was $244 less gratuities. We will definitely return here again for some more of our favorite shared lunch plates.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/Qv9o85_fqAUpmA7Dum9cMQ/348s.jpg", "caption": "My Morland Old Speckeled Hen Nitro Draft beer"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/KXPTRepT5CJNmRtnmHtdxw/168s.jpg", "caption": "Draft beer  menu"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/rZ9ob6L5DO1mT4rlRDQpHA/168s.jpg", "caption": "My rebel scum"}]}}, {"review": {"des": "I love The Purple Pig. I love this place so much that I still wear their souvenir t-shirt to sleep when I bought it five years ago during my first visit to Chicago. Although the server waiting on us could have been better at acting like he wanted to be there, and they could have opened their door a few minutes early especially when they can see a few of us were literally standing in the torrential downpour, I'll excuse their behavior because their food was that good. Below is the breakdown of our order:<br><br>- Beef Tendon Chips: 5/5; strong salt and vinegar dusting made chicharron-style. So, so good!<br>- Grilled Broccoli: 5/5; light and creamy anchovy vinaigrette really brightened up this dish.<br>-Neck Bone Gravy: 5/5; tasty meat sauce with creamy ricotta served with toasted bread.<br>-Grilled Octopus: 4/5; love the salsa verde and crunch of the green beans, but we preferred the firmer part of the tentacles versus the spongier part of the body that was served. Just a personal preference I suppose.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3JcM987KdbiriQYR3Ghsrg/348s.jpg", "caption": "Grilled octopus"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/N0g0RgW4xLJskaPJhGHyig/168s.jpg", "caption": "Beef tendon chips"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/EXgYR1g5N2-LNE5w-oCl8A/168s.jpg", "caption": "Grilled broccoli"}]}}, {"review": {"des": "While its been well over a year that I visited I still remember fondly the focused and delicious food coming out of this kitchen.  The service was on point despite the fact that they were super busy (as is often the case I have been told) - this shows great attention to customers.  The food was so incredibly satisfying and even over a year out I can remember enjoying the sardines on toast (I believe its still on the menu...I sure hope so).  <br><br>The biggest drawback is no reservations - but fret not I have a solution for everyone.  Put your name on the list and walk two blocks to Eataly.  It is here you can go to the wine bar and enjoy a glass (or two) of wine while you wait for them to send you a text message.  Maybe pick up some pasta and a bottle for later in the week and before you know it you'll be enjoying truly wonderful food at purple pig.  Your welcome!", "pics": null}}, {"review": {"des": "So really this is a 4.5 but I have to give them 5 stars as it's Jeremy C's fave place in the city.  Food here has been consistently excellent, we often recommend this place for out of town guests, partly because of the excellent location. It's on Michigan Ave, not far from the Chicago River, and you can walk to Millenium park if you're up for it.<br><br>There's no parking, I'd recommend spothero if you're driving, there's a few underground garages nearby. Otherwise Uber/Lyft/Taxi or use public transport.<br><br>Onto the food!  The menu is constantly changing but one dish we ALWAYS order is the Chicken Thigh Kebabs with smashed fried potatoes and tzatziki.  So much yumminess!  Their veggies are also surprisingly good, and the grilled octopus we had the last time we went was also very tasty. Food is served tapas style, so it's technically smaller, shared plates, but priced a little higher than typical tapas.but it's so good it's worth it!<br><br>It can get very busy, with a wait.  And they have both outdoor and indoor seating available.  You may find yourself squeezing into a table with other people.  It's definitely an experience!<br><br>Anyways, come here, enjoy the food, and then take a walk and enjoy the sights of downtown Chicago.", "pics": null}}, {"review": {"des": "this place really did live up to the hype! I came here with two others and were able to be seated within ten minutes - which was very lucky. The staff were all so attentive even though it was incredibly crowded. Even though you may have to share at ling tables it's not too bad and there's definitely enough arm room. I loved all of our dishes but especially the crispy pig ear with kale and an egg. Also the broccoli was very very good.<br><br>Yes, it's pricey but definitely worth a try. The couple next to us was eating the bone marrow and baguette and I'll be sure to try that next time!", "pics": null}}, {"review": {"des": "Fantastic experience.  We came at 3 pm, yes 3 pm. And it was a 30 minute wait.<br>We got the octopus, which was the most perfectly cooked octopus I've ever had.  Crispy on the outside yet nice and tender inside and soaked up all of the flavorful pesto-like sauce.  And the pan-fried potatoes were the perfect accompaniment.<br>The broccoli was as good as advertised thanks to the anchovy sauce.  Soooo good.<br>And we couldn't go without the pig.  So we did the braised shoulder.  A. Maze. Ing.", "pics": null}}, {"review": {"des": "I'll start by saying the review is not based on the food.  It's based on the experience I had last night at the restaurant.<br><br>They don't take reservations or wait lists.  I understand that about a place - not that I love it b/c it's then hard to get in.  Last night - a little before 5 pm, we were five blocks from the Pig and called to ask how long a wait would be for two people.  If it was too long, we were going to veer directions and walk to another dinner place.<br><br>The person who answered the phone told us, there was no wait and they could seat us now - subject to us arriving.  She repeated that twice to us.  So - we walked the five blocks there.  We were there in less than 7 minutes from our phone call.<br><br>We get there...and we're told it's 35-45 minute wait for two people.  I look at her (and I'm pretty sure she's the one we spoke to on the phone) and ask her \"how in 7 minutes, it went from no wait to almost 45 min?\"  I was guessing a 10 min wait tops.  She said \"we had a line out the door.\"  Why didn't she tell us that on the phone???  What did she hope to gain by lying to us on the phone?<br><br>We will not be back.  We've had the food before and it's not worth that frustration.  So many other restaurants in the city with just as good as food and a much better customer service.", "pics": null}}, {"review": {"des": "This is a hot spot for tourists and we were lucky to be seated right away at a community table with other strangers. The restuarant is located right next to the river with lovely views from where I sat on the patio. Service was good.<br><br>We decided on the grilled octopus (my personal favorite!), turkey leg confit, and grilled broccoli. The octopus was so flavorful and cooked to perfection. It was paired with green beans, fingerling potatoes and salsa verde. The broccoli was really tasty because of the anchovy vinaigrette, roasted garlic, and toasted bread crumbs on top. Such a unique and exquisite way to eat broccoli! The turkey leg was probably the only item that didn't wow me as because it didn't seem much different than the turkey leg I can get at a fair. It was drenched in a sweet sauce, topped with lentils and came with bed of cabbage. I like the tapas style of this restaurant and there are other items on the menu I'd come back to try like the roasted bone marrow.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/pyyqWliI-RYp_kCnwaZLLw/348s.jpg", "caption": "Grilled broccoli"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Hu1Hwq9victhb1qe8mx16A/168s.jpg", "caption": "Turkey Leg Confit"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/cbBZAN5QzRKQBV9ZCIgCpw/168s.jpg", "caption": "Grilled octopus (favorite)"}]}}, {"review": {"des": "I came to visit as a tourist staying at one of the hotels near here. The place was over crowded Friday night and we (party of 2) had to wait 1.5 hour for us to have seating. The food is decent but I still don't know what the hype is about. Overall it was a pleasant visit but I would not return here / I would be hesitant to suggest this place because of the long wait", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/QuwxBiSbFBu86gvurSy1zg/168s.jpg", "caption": "Brussel sprouts !"}]}}, {"review": {"des": "Won't lie, I always thought this was a burger place and just never walked in (not that there's anything wrong with burger places, I'm just generally not in the mood for burgers). What a delightful surprise when I found out this was one of the more popular downtown, small plate, locations that is notoriously hard to just walk-in to.<br><br>Good news was that me and my plus one were immediately seated when I walked in. The place was already packed. The air smelled amazing with the food that had already been served. All good stuff.<br><br>The server highlighted some menu items and then put in our appetizers requests while we considered the rest of the meal. The one problem was that the menu switched and our server didn't warn us about it. Generally the dinner service menu had more options and very few things were removed - but of course- one of the items I had wanted WAS one that was stopped for dinner service. Oh well.<br><br>The food ordered: polpo, duck, roast, meat and cheese board, and a couple of others; was truly fantastic. The duck was incredibly memorable as one of the most well done I've ever had.<br><br>Good food. Good ambiance. What more could you ask for?", "pics": null}}, {"review": {"des": "Ok, I am in LOVE with the Purple Pig! Situated in the heart of downtown, the Purple Pig boasts a fabulous tapas-style menu. While they take no reservations and can subject their guests to quite a wait. Miraculously, at 5pm on a Thursday, my sister and I were able to be seated right away.<br><br>The Purple Pig offers communal seating and is a hot spot for tourists. Everyone at my table was very nice and friendly and chatted with us for a bit. <br><br>I had an old fashioned to drink, which was definitely on the strong side, but no complaints here. My favorite dish was the sweet potato polenta because the blend of flavors was sheer nirvana. The milk-braised pork shoulder is also fantastic and basically falls apart as soon as you dive in. I did order the broccoli but thought the portion was way too big in comparison to the sizes of the other dishes. Definite broccoli overkill--I'd try the beets next time. The desserts are all pretty darn godly. Looking forward to my next visit!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/zelhGso4kWbYLa-irvmmFw/348s.jpg", "caption": "Dessert"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/Fhg8F8WS6r8GU6JFJzTicA/168s.jpg", "caption": "Sweet potato polenta"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/yCeD4hXLLJWT9r9XUxhuag/168s.jpg", "caption": "Sweet potato polenta"}]}}, {"review": {"des": "I believe this pl  is overrated. I would rather go across the street to MJ's steakhouse.", "pics": null}}]}