{"name": "wildberry-pancakes-and-cafe-chicago-2", "reviews": [{"review": {"des": "Extensive menu and incredible crowds. It was truly difficult to squeeze by people on a rainy Chicago Saturday and we had to catch a flight. Can't recall the wait time, but it was significant and we knew heading to another establishment would result in waiting plus travel time any way.<br><br>Nevertheless, we made it in. Grabbed the regular two eggs any style breakfast with eggs overeasy and Applewood bacon. I wanted those specialty pancakes, but not just on its own. So chose the signature berry bliss.<br><br>When it came, I was pretty sure I wouldn't finish the whole meal. The bacon was crisp and the eggs done as ordered. Then the indulgent magic of the berry bliss. Wow. Jam-packed with flavor. I had to bow out after eating barely half of it. So good. Would come here when I'm in town again.", "pics": null}}, {"review": {"des": "I think Wildberry gets a lot of hype because of its central location near Millenium Park. While the food was good, I'm not sure if it was worth the 45 minute wait.<br><br>We got the Slow Roast Brisket Hash (brisket, roasted red peppers, onions, and sausage gravy served with two eggs on a bed of potatoes and a side of toast) and the Mexicana Sizzlin' Skillet (hashbrowns, cheddar & peppejack cheese, two eggs, chorizo sausage, roasted jalapenos, avocado, cilantro, and onions). <br>The skillet came with a side of pancakes, so we substituted for a specialty pancake for an extra $2. The Signature Berry Bliss pancakes (fresh berries, jam, and marscapone cheese) was so worth it! <br>We weren't too thrilled with the brisket hash, but the skillet was really, really good.<br><br>For coffee, we got the Honey Toffee Nut Latte and Vanilla Berry Latte. Both were too sweet for our liking, and they served them to us in paper cups so there was no latte art. I'd recommend skipping the fancy lattes and just going for regular drip coffee here.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/WNM_V9pDhDV9AVMasmcQEQ/348s.jpg", "caption": "Mexicana skillet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/nFu2MOjh36O9A8amWNkfpg/168s.jpg", "caption": "Berry Bliss specialty pancakes"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/uIQ8ynuz_Klv01RGxhtrPg/168s.jpg", "caption": "Brisket hash"}]}}, {"review": {"des": "Came here for a Sunday brunch and waited for nearly 2 hours before we were able to be seated, as do most people! Overall, the pancakes were delicious but the skillets left much to be desired. We ordered the Barbacoa Chilaquiles skillet, the Garden skillet, and a side of wildberry and blueberry pancakes. The Barbacoa was flavorful, but some bites were EXTREMELY spicy. They may have unevenly spread the spices and it became a bit unbearable to eat without taking water breaks. The Garden skillet, however, was entirely opposite. I'm talking NO spices what so ever. It left me extremely confused... they were sautéed veggies with an egg on top. That's quite literally it. It was as bland as you could get. Do not recommend!<br><br>As far as pancakes, they were both rich, creamy, and not overpoweringly sweet. Great choices. There's a reason the restaurants name isn't Wildberry Skillets, so choose accordingly...", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/DIjJp4cwQaV_ISwW_GeVaQ/348s.jpg", "caption": "Wildberry Pancakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/GBTtGNNdeS5ODmFzzcB92w/168s.jpg", "caption": "Barbacoa Skillet"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/WYamsO9e2uAtMiFOviz8zw/168s.jpg", "caption": "Garden Skillet (do not recommend!!!)"}]}}, {"review": {"des": "Wildberry's has several locations in Chicago and this was super close to Millennium Park. Definitely a place for diabeetus overload ;) <br><br>I ordered the Red Velvet French Toast and it was an absolute dream. Very sugary and has cream cheese frosting drizzled all over. Don't come here if you already had your sugar intake of the day. It did feel more like a cake roll than French toast though. It's also rather sweet enough already without the extra syrup.", "pics": null}}, {"review": {"des": "I finally tried this brunch spot on Sunday. They close at 2:30pm and we barely made it just before 2pm. I ordered the Wild Mushroom Omelette which was really good. I upgrade my pancakes for just $2 to the Signature Berry Bliss pancakes. I don't usually get pancakes at brunch but this was a good decision ! My boyfriend got the Homemade Corned Beef Hash Skillet which he really liked. He upgraded the pancakes for the Chocolate Banana Bread French Toast. We both really liked this as well. It's definitely on the sweeter side but since it was just half an order, it wasn't too overwhelming. I also tried a little bit of the Oreo S'mores Pancakes and that was way too sweet for me. <br><br>The service was phenomenal here. Our waiter constantly checked up on us and refilled our drinks. He was very energetic and friendly towards us which I appreciate. I will definitely come back here for brunch!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/wdLuURKXPhkUUnFkJP00fg/168s.jpg", "caption": "Homemade Corned Beef Hash Skillet"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XtVamkfwtjQI7ycoG2trJQ/168s.jpg", "caption": "Signature Berry Bliss Specialty Pancakes (+2 upgrade)"}]}}, {"review": {"des": "Incredible. Simply incredible. <br><br>First things first, hop in line on the Yelp app and make your way there around that time. And then wait a little longer..You can even wait in a building adjacent to them to stay warm/dry during inclement days. They have four friendly faces to greet you inside the door and then shoot you a text when you should come inside to wait and then holler your name when its time to be seated. We were shown to our table ana greeted by our waitress promptly. She took our drink order and quickly re-appeared with some of the best coffee I have had at a breakfast restaurant. <br><br>I inquired with her about which pancake they were most known for and she immediately retorted with the wild berry and cinnamon roll.  With that knowledge in mind I ordered the Mexican Skillet and the Wild Berry Pancake on the side. My sister ordered an omelette with the cinnamon roll pancakes so we could all try each others. <br><br>My skillet was to die for. I ordered it without jalapenos and it was incredible. The chorizo was so flavorful and everything was mixed just perfectly. The melted the cheese, the avocado...YUM! And not to mention it fed me breakfast for TWO days because it was massive. And I am happy to report it is equally as good on day two. My mom and sister both really enjoyed their omelettes and the fruit that came with my moms was very obviously fresh which is a nice change. And none of us could decide which pancake we liked more. So all in all we got to try so many things and everything was hot, fresh, and delicious. I cannot wait to get back and try even more!", "pics": null}}, {"review": {"des": "Wildberry Pancakes was recommended to me by multiple people so I knew I had to try! We signed up to get on their wait list and were seated in 45 minutes on a Saturday late morning. Instead of waiting outside and getting hangry, we decided to spend that time hanging around the bean, which was very close - so I suggest doing that if you have a long wait!<br><br>I shared the Mexicana skillet served with a side of\"signature berry bliss\" pancakes! I absolutely loved the Mexicana skillet - the saltiness of the chorizo and spicy/freshness of jalapeños were really good with the hash browns, which were on the blander side. Having the eggs cooked over easy was the right move because the yolk running through all the components in the skillet really made this dish! <br><br>The berry bliss pancakes on the other hand, were a little disappointing. I thought the pancakes were a bit tough and I didn't like the drizzle on top. It tasted too tangy for me. <br><br>Overall, my friends had a great experience at Wildberry. The staff was very friendly, food was great, and portions were HUGE. Come hungry!", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/AONyQ_oXs5Xwl4yhdGvs3Q/348s.jpg", "caption": "Berry bliss pancakes on the side, came with 2"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/3D58p1MdoPvn1iXlW-fw7Q/168s.jpg", "caption": "Mexicana Skillet"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2--HpKyA2e2qdCxqaETPDA/168s.jpg", "caption": "Huge portions"}]}}, {"review": {"des": "Wildberry benefits greatly from having a prime location in Chicago. Across the street from Millennium Park on Randolph is tough to beat. This place is always jammed packed with tourist. <br><br>I worked in the same building as Wildberry for 6 years and was a regular because of the convenience. I've tried just about every item on the menu. To avoid the long wait, we'd often place to-go orders.<br><br>While I'd never had a bad meal, I think Wildberry is on par with just about any slightly above average breakfast restaurant. I guess it depends on what you like. I'm not a big fan of Yolk or The Bongo Room. Wildberry is on the same plane.<br><br>I actually prefer the lunch options over breakfast. The burger is seraphic when not overcooked. The havarti cheese and onion jam are the perfect accompaniment. <br><br>Long story short. .. Wildberry is fine, but there are better options in the area and countless more if you explore other neighborhoods.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/VfwHCD26_qaUzFxD-5KNUg/348s.jpg", "caption": "Havarti Cheeseburger - Angus beef, havarti cheese, red onion marmalade, applewood bacon on a pretzel bun."}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f3wmw2PQzZlIpy1SuToGtg/168s.jpg", "caption": "Thick cut bacon, hard scrambled eggs & hashbrowns"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/R-uLZcfE7jJ0kycEObhkww/168s.jpg", "caption": "French Toast"}]}}, {"review": {"des": "Sometimes Yelp reviews should be taken with a grain of salt! Oh no, that's always the beginning of some angry Yelpers review. I am not angry though, I am just kind of......meh, for lack of a better term of what I feel for Wildberry. <br><br>I read all the raving reviews and saw the waitlist and I knew I had to check this place out. Kudos, to my fellow Yelpers for letting me know about the waitlist. I literally put myself on it from the comfort of my hotel and went there when only 30 people were ahead of me (I started the waitlist at 145 people ahead of me). When we arrived we waited about five minutes before we were seated! That was awesome, because the line to get in this place was insane! I felt like VIP cutting the line. \"Move out the way, the Queen is here\" is something I may or may not have thought while being seated.<br><br>Once we were seated I was immediately disappointed. This is a no frills diner. Equivalent to IHOP or Denny's. I was expecting a little more but whatever, I figured the food is why the people are lined up to get in this place. <br><br>The food arrives and while it looked good, it was just....meh! Actually I take that back, the pancakes were amazing! However, the rest of the breakfast left no real impression. <br><br>I suppose that is the downside of being a Yelper. You read all these amazing reviews and set high expectations only to be disappointed. I think this place is overrated. I wouldn't bat an eyelash at the thought of coming back here.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/f66FBAxVd69k9zMu0sIUwg/348s.jpg", "caption": "Corned Beef Hash"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/djid57hSfZadQ8zErkPJWQ/168s.jpg", "caption": "Los Altos Eggs Benedict"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/bHczBZR9m0OiF6IKYvcaWQ/168s.jpg", "caption": "Buttermilk Pancakes"}]}}, {"review": {"des": "Tried the butchers block, which was full of meat<br>this was ok<br>ended up taking leftovers home <br>i feel like it tasted better later<br>we added a side of specialty pancakes for +$2 or something<br><br>I'm not the biggest fan of pancakes (I usually prefer savory breakfast foods)<br>but they were damn good here<br>The signature berry bliss pancakes were SO GOOD!<br>I don't normally like pancakes but these were y u m m<br>I'm sure the waffles would be amazing as well<br><br>it's a plus that you can add yourself to the waitlist on yelp to minimize your wait time too!", "pics": null}}, {"review": {"des": "This is my new favorite brunch place! My all time favorite has been tre kronor but I think Wildberry is getting up there. <br>We came on a Sunday morning and it was 30 mins wait by 8 am. Glad we used yelp to be on the waitlist. It's worth the wait! They have amazing pancakes with creative topping/cream. The skillets and eggs are done well. Oh of course, they serve the intelligentsia coffee! <br>I'm glad they have a few locations that we can go to. Otherwise, I'm going to dream about these amazing pancakes every weekend.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/8QLBVYN46HTAXxSaBak_Ig/348s.jpg", "caption": "Egg and bacon with a side of specialty pancakes (very berry)"}]}}, {"review": {"des": "A good breakfast place isn't just about the great food, but also about the great variety. I loved coming here because there was something for everyone with such a large menu. More importantly, everything was superb regardless of what we ordered!<br><br>I was told to try the berries pancake and it did not disappoint. Look at that sauce! It was decadent and filling - and oh so pretty :)<br><br>I also tried the eggs benedict and for the first time in a while, i got two perfectly poached eggs. The hollandaise sauce was great as well - honestly the large portion of everything also meant i was stuffed and still wasn't able to finish my plate.<br><br>We also tried the smoothies, juices, and latte. All of which were up to standards for my friends and I.<br><br>If you're looking for a great breakfast spot to hit before checking out cloud gate (right across the street!), this is definitely it. Might even have a bit of a wait, but it was worth it for a great way to start the day!", "pics": null}}, {"review": {"des": "Update: you know how you update your review and either raise or lower your score? Well I'm going to leave Wildberry at a five because that's how awesome it is. Actually, take my previous five, add my current five and make it a ten. <br><br>I went back the following day like I said I would and was greeted by the lovely hostesses with \"you're back!\" Of course, I can't get enough. <br><br>So this time I wanted both breakfast and lunch. I ordered the turkey pepper jack panini with sweet potato fries and a \"little berry\" order of the berry bliss pancakes. <br><br>The berry bliss pancakes will change your life and have you second guessing if you should order any other type of pancake. Don't get me wrong, I'm sure all of them are great. But this was is extra extra great. And so was my turkey panini! I was stuffed and couldn't finish it all. <br><br>Just wishing I could pack up Wildberry and bring it back to Baltimore with it. <br><br>------------------------------------------------<br><br>Currently kicking myself for ordering the most basic item on the menu: egg white omelet with pepper jack cheese, plain pancakes and turkey bacon. Don't get me wrong, everything tasted great. Actually more than great. Actually so good, I'm planning my visit back before I leave Chicago. <br><br>I got there a little bit before closing and the restaurant was packed but I was still seated within 15 minutes. <br><br>My server was great as well. Can't wait to come back!", "pics": null}}, {"review": {"des": "There are many locations throughout Chicago but this one was the closest to me. I ordered the Red Velvet French Toast and it was definitely for a sugar rush. The French toast was amazing with cream cheese frosting that was drizzled all over them. I poured a little syrup over the toast because they were already sweet for me. <br><br>In order to speed up the process of waiting in line, I would check into line on the Yelp app which will give you an exact time of how long it will take for you to get a table. Just be ready to wait on the weekends since this place gets packed.", "pics": null}}, {"review": {"des": "Lets me start off my saying this place was all the reviews raved about!<br><br>From good service to amazing food, I would not second guess myself on giving this place 5 stars. My only tip to people planning on visiting this place for breakfast is to get there early or put yourself on the waiting list before you leave your hotel. <br><br>My girlfriend and I got there at around 7:30. Upon arriving, we made our way through the revolving door and was welcomed by a huge amount of people waiting by the entrance to escape the cold, brisk morning air. After putting my girlfriend and I on the waiting list, I received a text confirming that we were added to the list and would be notified when to come back to the restaurant. Considering this place was across from Millennium Park, we walked over to kill time -which in my opinion was great because there was no one at The Cloud so it was a great time to take pictures.<br><br>About 40 minutes later, my girlfriend received a text to make our way back to the restaurant. Once we checked in with the hostess, we waited another 5 minutes. Once we were seated, we were greeted by a very nice waitress who asked us what we would like to drink as we also asked what she would recommend. She was very knowledgable in terms of product knowledge. <br><br>Okay- lets get on to the food. All you need to do is look at the picture attached. It says it all. The food looked as good as it tasted. <br><br>Highly recommend upgrading your side to the speciality pancakes! They are delicious!  Everything about this place was great from the service, to the food, to the turn over time (the waiters are so quick to clean tables and take away your empty plates).<br><br>Thank you Wildberry for an amazing breakfast experience in Chicago.", "pics": null}}, {"review": {"des": "Well worth the wait and hype! ***GET ON THE WAITING LIST VIA YELP before arriving.*** normal lunch wait for two is 1.5 hrs!<br><br>Ok with that out of the way, the bf and I came here for lunch. On our way over we joined the wait list via Yelp, wait time? 1 hr 45 minutes, holy...<br><br>Took us 20 minutes to get there, squeezed past the crowds to check in, and the hostess told us they will text when ready. Luckily, you have the beautiful Millennium Park across the street to sight see, play tourist, work up an appetite, and kill time.<br><br>Text came in which gave me 5 minutes to get to the front. Little did they know, I was already there. LOL Checked in once again and stood there waiting to be seated- 3 more parties ahead but all got seated quickly.<br><br>Service is fast, there are many servers, bus boys, and hostess. Workers are very efficient and good at their job, which keeps the patrons flowing.<br><br>Now to the juicy part, the FOOD:<br><br>1) Corned Beef Hash Skillet- 5 stars! The corned beef is homemade. Comes with hash browns or fruit, toast or pancakes (but sub with the Berry Bliss Waffle +$5 but well worth it bc a seperate waffle order will cost you $13).  The corned beef hash was so deliciously flavored, tender, minced, and yet still had a little crunch factor from the mixed in hash.<br><br>2) Berry Bliss Waffle- 5+ stars, this dish beats most waffles I've ever eaten. I was very full after finishing my benedicts, but knew I needed to try this beautiful waffle. I ended up eating half the waffle and wanted to order more regardless of how full I was. My boyfriend talked some sense into me and I sadly agreed.<br><br>2. Florence Benedict- 5 stars, loaded with spinach and bacon bites, topped with a perfectly poached egg, and dressed with a very nice, creamy hollandaise sauce with a hint of lemon.<br><br>Double espresso-strong and flavorful<br><br>Orange juice- freshly squeezed!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Pnkk5VWLIAouFU0YcdvoJA/348s.jpg", "caption": "Homemade corned beef hash"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/XWgOInRIK-JEFg_G2uEVBg/168s.jpg", "caption": "Interior"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Bkup-_G_SdSrUIAjuct8xQ/168s.jpg", "caption": "Yummy eggs Benedict Florentine"}]}}, {"review": {"des": "Despite the inevitable wait (due to its location downtown) you'll have here, DO IT. You won't be disappointed. I recommend you get on their text check-in in advance. This establishment serves breakfast, brunch, and lunch, closing at 3pm. The portions are VERY filling/hearty, and considering the location, the prices are excellent. Very attentive and friendly staff. Great pancakes!", "pics": null}}, {"review": {"des": "Bottom line: great breakfast/ lunch spot, go<br><br>Long line: had a great time here. The lines are long for good reason. The food is absolutely delicious. I forget the name of my dish, but as pictured it was huge and had hashbrowns, eggs, the works. My friend got their special pancakes and they too were amazing. Service was quick and friendly. I would definitely return.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/X8XRKJWEwV-K8fp6kbSiLQ/168s.jpg", "caption": "Seriousness"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/w5PdzkexHd6T4x7I2PZnTA/168s.jpg", "caption": "Eggs and hashbrowns"}]}}, {"review": {"des": "Wait Time Review <br><br>The breakfast is exceptional but the wait time on a weekend is outrageous. The downtown location does not allow customers to stand in the commercial building the restaurant is connected to. With that being said, customers are supposed to wait outside if there is no room in the restaurant. Waiting for food in cold weather is not fun at all. So imagine standing in the commercial building being yelled at by security to stand outside. Not fun, not fun at all. <br><br>However, once you get a seat the food and service is great.", "pics": null}}, {"review": {"des": "I went here for an early breakfast while visiting Chicago. I think it's going to be a regular spot for me whenever I'm in town. <br>I unfortunately can't remember our waitress's name but she was really good, quirky and attentive without being annoying. <br>On to my favorite, the food!<br>I ordered the corned beef hash, made in house along with two over easy eggs and a berry bliss crepe. It was so good I'm actually thinking about driving back to Chicago right now as I write this review. <br>I could eat like this everyday! It was a perfect meal, savory and crunchy from the corned beef; sweet and fluffy from the crepe. I left happy and can't wait to return.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/7GavSOSnew31IZDrqTpWaA/168s.jpg", "caption": "Signature Berry Bliss Crepe"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gn2PRoCmdsS1dcdISz2lxA/168s.jpg", "caption": "Homemade Corned Beef Hash"}]}}, {"review": {"des": "We waited 45 mins for brunch here and it was worth it!!! <br>I was very happy with my experience here. <br>I got an Florence egg Benedict and my bf got a Mexicana skillet and a PSL. The Wildberry pancakes came as a side dish with the skillet.<br>The pancakes are pretty and have strawberry bitten, which was very delicious.  The portions are huge and we had to bring home some extra. Everything was flavorful.<br>The service was fast and friendly. <br>I'd totally come back here again. <br>Highly recommend!!", "pics": null}}, {"review": {"des": "OMG! If you are in Chicago and love pancakes, you need to come here! And if you do plan on coming here, know that this is a popular place and expect to wait (the time of course will vary depending on the group). I came with a group of 3 adults, 1 child, and a baby. The hostess informed us it would be about 30 minutes for the wait but we were surprisingly notified that our table was ready in about 10 minutes.<br><br>As soon as we sat, our server came to greet us. She was super friendly, but I forgot her name. However, everyone working there seemed very nice and helpful. <br><br>I'm giving this place 4.5 stars because our group ordered a variety of breakfast food - both savory and sweet. The savory dishes were good, but nothing extraordinary and we each added a special pancake to breakfast order.<br><br>The pancakes though... are amazing! They have a wide variety of flavors with different toppings and I swear, my blood sugar levels were probably off the roof because I couldn't stop eating the pancakes even though I was already stuffed.<br><br>Pancake ratings on a scale of 1-10<br><br>Blueberry Cream Cheese Pancake- 10!!!<br>I usually don't add berries to my pancake, but hands down - this was the best pancake I've ever had in my life. NO EXAGGERATION. This pancake was layered with blueberries and cream cheese in the middle and cake with a side of blueberry jam. Who would've thought a simple (not so simple) blueberry pancake would be so magically delicious? This was the perfect balance of sweet and fruit and creamy and everything else in between. My mouth is literally watering as I type this review. So... if you like blueberries, cream cheese, and pancakes. Order this. <br><br>Oreo Pancake - 8.5<br>Very good, super sweet. I would recommend asking for the marshmallow and chocolate syrup on the side so it's not so overwhelming. I love sweets to the extreme, and even all of that was a little overwhelming for me.<br><br>Banana and Chocolate Pancake - 8<br>Also good, but nothing special. It was just your basic pancake. <br><br>Wildberry Kids Pancake- 8<br>Smaller pancakes for the kiddos. Good as well, but again, your basic berry pancake in mini form. Still a large portion for a kid size dish. <br><br>Tip - If you order just the pancakes, it comes a very large portion. I recommend ordering a savory breakfast/brunch dish and then adding a special pancake to your order (still a lot of pancake for a side order). This way, you get the best of both worlds.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/o8HTFdzBh0ug_duSCZGnmA/348s.jpg", "caption": "Blueberry and Cream Cheese Pancakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/6gbBPMg0kP9H2ZJA3JSEFw/168s.jpg", "caption": "Banana and Chocolate Chips Pancakes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/3JLH5407LYOZXQY7CYMM2g/168s.jpg", "caption": "Customized Omelette with hash"}]}}, {"review": {"des": "WOW WOW WOW - The hype is real. I went to have breakfast here with my family for my birthday.<br><br>All I will say is, you must come and have breakfast/brunch here when in Chicago. <br>The location is perfect, the service is AWESOME all across the board.<br>The food is to die for! They have everything under the sun and for very reasonable prices. <br><br>The wait is long however you can out your name down through the yelp app beforehand and then you will be notified what time you should go and check in. They have a little coffee shop inside where you can grab a drink while you wait to be called.<br><br>The food and entire experience was just fantastic. We went to see the famous bean while we waited to be called, it is just up the street. <br><br>The pancakes were all amazing, the coffee was excellent  - try the iced mocha or the hot coconut mocha! The skillets are all to do - the Denver , the Chilaquiles and Mexican scramble with chorizo - omgggg out of this world! I wish they had one here in LA.", "pics": null}}, {"review": {"des": "Pancake machine house! If you like pancakes this is the place for you. They have a ton of other items on the menu like eggs, skillets, sandwiches, but the pancakes is what keeps this place rolling. I've literally never seen so many pancakes in one place. All different tops and HUGE portions!! Definitely not a place to go to if you're on a diet! <br><br>Wait times are insane, but luckily you can add yourself to the waitlist so it goes faster. It's also a huge place with indoor and outdoor seating so don't fret. We decided to get good ole fashion brioche toast which was a miss. It wasn't bad, but definitely not memorable. The guy next to me ordered the famous berry pancakes. Amazing looking, but definitely will put you in a sugar coma! <br><br>This place is a must go for insta worthy food photos. Other than that, you are better off hitting a diner where the food is cheaper, less wait, and much better quality.", "pics": null}}, {"review": {"des": "Hands down the best pancake restaurant I've ever been in! It was super busy.. we went at 8:30 and still had to line up for 30 mins. But turnover is fast.<br><br>Most of my party ordered the seniors breakfast since they didn't have such a big appetite in the morning, but my hubby got their corned beef skillet and upgraded to lemon blackberry pancakes. I ordered the corned beef Benedict and it was just AMAZING. Mine came with plain buttermilk pancakes on the side and even that alone was so fluffy and delicious with just some simple syrup.<br><br>The lemon blackberry pancakes were sooo good. It taste just like the dessert but in the form of a pancake   <br><br>The Benedict was perfectly cooked and went amazingly well with corned beef. The skillet was so good with fried potatoes and corned beef. You seriously can't go wrong with so many choices on their menu.<br><br>Service was fast but I can see why since it's so busy. But it was definitely worth the effort!", "pics": null}}, {"review": {"des": "Trying out this place was totally worth it. The place is pretty pack however long or short wait wouldn't matter given the location being by Millennium Park, that has so much for you to tour and see.<br><br>Once we were seated, our waiter immediately greet us and provide drink recommendation. The drink came out pretty fast and there were plenty of offer to order by from waffles, pancakes, eggs benedict, sandwiches, to salad. And not a single of those foods failed at all.<br><br>The food were delicious that definitely made the long wait worth it and explain why it is very pack. Definitely recommend here if ever around Millennium Park. Great services and amazing food.", "pics": null}}, {"review": {"des": "Yum!!! Huge portions, delicious fresh food and great service! Loved our breakfast here. Tip: ask for a cup to take your coffee to go and then walk over through the park.", "pics": null}}, {"review": {"des": "Okay folks, Wildberry is worth the hype you have heard from locals, and it certainly was for me! They were packed for breakfast on the Wednesday morning of my visit, but luckily, my co-worker and I only needed to wait around 10 minutes to be seated. While we waited, we looked over the menu. I was immediately hooked on the idea of their corned beef hash and since the waitress mentioned I could up charge my side of pancakes for one of their more specialty ones, I knew I could not go wrong with the signature berry bliss. It was a lot of food, but the leftovers were still very good! The fluffy pancakes were so sweet (so no need to add syrup) and the accompanying fruit was fresh. I loved the berry cream in between the stacks. <br><br>The corned beef was big enough to share among two diners, so I split it into two meals myself. It was crispy on the edges and soft in the middle. I don't think I could do canned corned beef again after having such a fresh batch at Wildberry's. The eggs were lofty and I liked mine scrambled since I went with the pancakes over the toast. <br><br>Oh, since the fall menu was out, I also ordered an apple cider. It was warm, tart, and delicious. It's too bad it did not come with free refills. I also never tried it with whip cream, but it was an added layer to this whimsical breakfast treat.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/AGwFOKuRxZ4wmCeL0vmwIQ/348s.jpg", "caption": "The famous Signature Berry Bliss Pancakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Rn_8b8iWGRd3Jns02zKvxQ/168s.jpg", "caption": "Scrambled eggs, Homemade Corned Beef Hash"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/5SK-3XNnIo5M1pgx6M0cJQ/168s.jpg", "caption": "The apple cider with whip!"}]}}, {"review": {"des": "This place is simply amazing!  Their wait is outrageous to say the least but I rsvp'd on yelp and was able to wait very little. The portion size is huge but since every single dish looks and sounds like you must eat it it is pretty much impossible to order only one item off the menu. I can personally vouch for the Oreo pancakes, the Butcher Block skillet, and Spinach eggs Benedict. <br><br>Will definitely recommend and revisit next time I'm in Chicago.", "pics": null}}, {"review": {"des": "This is the most popular location -- I definitely see why! The staff was amazing, the entire restaurant was clean, and my pancakes were out of this world. This location is situated to the right of The Bean (not directly) in the heart of one of the popular tourist spots of the city.", "pics": null}}, {"review": {"des": "Fantastic - Great food, great service. Definite must try when in the Chicago area.<br><br>Food Order: Veggie Omelet (with cheddar cheese and no mushrooms), the Mexicana Hash (with scrambled eggs, no meat), and a side of cinnamon roll pancakes.<br><br>Environment: typical cafe setup with a lot of people waiting to get seated.  They have some outdoor seats as well.<br><br>Verdict: The Mexicana was absolutely fantastic.  Great flavors, perfectly cooked and had all the aspects of a breakfast that we wanted (eggs, hash browns, veggies, cheese, etc). Customer service was phenomenal and their suggestions were on point.<br><br>Reservations: You can reserve a spot on the Yelp App. It was pretty amazing and an accurate estimate for the wait time. We had a 90-minute wait and were able to explore the Park and come back 10 minutes prior to our estimate and were seated rather quickly.<br><br>Tips: Reserve space with the Yelp app and just relax until your time!<br><br>Next Time: would try their top rated waffle and berries pancakes.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/PSnRy9KLnaVD_AJzzOC9MQ/348s.jpg", "caption": "Entire meal"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/d-lAleGMJVh6CCmskc-2Lg/168s.jpg", "caption": "Veggie omelet"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/mMdSGUkv0pSYuRtUKOYz_A/168s.jpg", "caption": "Mexicana Hash (no meat with scrambled eggs)"}]}}, {"review": {"des": "Food is really good here! They have a large assortment of breakfast items. You can put yourself on the waitlist from yelp as there will likely be a wait for Saturday or Sunday morning. Once they said the table was ready & we would have had another ~10 min wait or so to sit inside. However, they had outdoor seating available immediately so we did that. <br><br>I got the breakfast burrito which I really enjoyed. The various pancakes, waffles, crepes that other people got around me also looked good.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/m3N-G-mNrU5Ck16SeWBxGA/168s.jpg", "caption": "Keylime pancakes & skillet"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/rRDh_GZCe8RHrD9XDWFOIQ/168s.jpg", "caption": "Breakfast Burrito"}]}}, {"review": {"des": "Like many other reviews, this place was underwhelming. It's diner food that are instagram worthy at best. The food is tasteless and bland. I cannot believe the hype about it and I'm starting to think my palette can't handle greasy fatty food like this anymore. <br><br>We ordered the skillet, egg burrito, classic pancakes and brioche French toast. Never again. I didn't even take photos which screams volumes.", "pics": null}}, {"review": {"des": "Hey this place is definitely worth a visit! <br>Plenty of seating and the menu has everything for breakfast and brunch lovers! Most \"egg\"or \"omelette\" dishes are served with a choice of toast or pancakes. A great selection of pancakes with endless topping choices. And who can resist a place that serves soft whipped butter, not those frozen little  packages of butter so common in most restaurants! Kudos to this place for hiring great servers and keeping the place clean and appealing. <br>See you next time I'm in Chicago!", "pics": null}}, {"review": {"des": "OMG!!!!! I'd move to Chicago for these pancakes! Tip: RSVP your table on Yelp and thank me later! This place is busy busy busy so be prepared to wait if you're a walk in. On the plus side you are served amazing food fast...and hot!  Let's start with what I think are the best pancakes I've ever had...The Berry Bliss pancakes. A Huge fluffy stack of piping hot pancakes drizzled in three yummy berry sauces. I can't honestly remember the sauces but they were decadent and worthy of licking the plate, so hope that helps. The fresh blueberries, blackberries and strawberries were a perfect combo too. I also ordered their thick cut bacon which was great! They do have seasonal coffees as well. I ordered their pumpkin spice latte, which was a huge mug of goodness. Wildberry, can you open in Miami pretty please????", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/2-ypc0XQtTswU1nvMZ-fqw/348s.jpg", "caption": "Pumpkin Spice Latte"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/pp_mj1F57PrHUstDJM4kUA/168s.jpg", "caption": "Restaurant Interior"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/GIpZwWPCpeaX_hHrlWG5cw/168s.jpg", "caption": "Berry Bliss Pancakes"}]}}, {"review": {"des": "This place is the real deal!  If in Chicago, this is where you want to go for breakfast or brunch.  I had one of the skillets and it was delicious.  I had the butcher block skillet which is expected to be heavy on meat, but wow, they had a lot of meat in there!  The specialty pancakes are sweet.  I had the blackberry key lime pancakes.  There were more berries than I expected.  Between the pancakes and the skillet, there was truly a lot of food.  <br><br>The only downside is that there is a long wait.  Here is a pro tip for you.  Use the Yelp app to put your name on the waiting list.  I think this is the only way to get on a call ahead/waiting list as they do not take call ahead seating on the phone or reservations.  To give you an idea, my guest and I put our name on the list and we were 128th in line.  The line goes quickly all things considered, but it was still about a 90 min wait which we spent doing other things.", "pics": null}}, {"review": {"des": "Be prepared to wait in line but wow is it worth it!! We are early risers so we're there Sunday by 8:30. Waited about 10 minutes but when we left an hour later, it was insane. They hustle you through so that was good. On to the food: I had their famous dish the berry bliss in crepe form instead of pancakes - get it!!! It's to die for. Loved every bite. Hubby had the butcher block skillet and he really liked it; full of meat and potatoes. We will return!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/CayXx_po-2yXoCREI8NtkQ/168s.jpg", "caption": "Berry bliss crepes"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/sBgGsbt4dOkX3QStlrL21g/168s.jpg", "caption": "Butcher block skillet"}]}}, {"review": {"des": "Super fancy IHOP!! What is IHOP? Another pancake house. Hahaha Ok back to Wildberry. I love the cafe name and the colors and the decor! The inside is bigger than I expected because the wait was about 1.5hrs!!! There is also outside patio seating. <br><br>Ordered the brisket thing with pancakes and a pure belgian waffle. Loved the taste of the waffle!! The brisket thing was pretty damn good. The pancakes that came with it was my least favorite. It had an artificial sweet taste that I don't like. And they top off your coffee if it's not too busy and see you low on coffee.<br><br>The price of a regular coffee and the specialty coffees are practically the same price!!! I should have gotten a specialty one... oh well<br><br>Will come again and try their chicken and waffles.", "pics": null}}, {"review": {"des": "Everything about this place was completely worth it. I knew that there'd be a long wait, but thank goodness for the Yelp feature where you can get in line for seating. This completely saved us and it made our morning so incredibly enjoyable.<br><br>The wait was about two hours, but this was PLENTY of time for us to walk from our hotel to Millennium Park, explore, take tons of pictures, and still come in and get seated on time. What an amazing feature! Anyhow, once seated, we were immediately greeted by our fantastic waiter who was so full of energy and recommendations, and overall, the dude was a BLAST. <br><br>I ordered the Southern Eggs Benedict (YUM!) and my bf ordered the Barbacoa Chilaquiles, which were almost life changing. The chilaquiles come with Chihuahua cheese (named after a region of Mexico) and that cheese put the meal over the top! The meat was perfectly \"melts in your mouth\" good. My benedict had an amazing sausage gravy, and being from the south, I'd say the flavor was spot on. <br><br>There is nothing wrong with this place. I'm so glad we came here, and I'd recommend it to anyone in the area. Just remember to use the Yelp \"wait in line\" feature and you're all set!", "pics": null}}, {"review": {"des": "Loved it. The food was delicious. I ordered the brisket hash. So savory and tender. <br><br>The wait wasn't bad at all, probably because it was a little after the rush. <br><br>The service was great as well.  I will come back next time I'm in Chicago.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/LmvGQ6FQT7-rZWgl1aZHxw/168s.jpg", "caption": "Brisket hash with a side of french toast."}]}}, {"review": {"des": "Love the ability to jump on the waitlist straight from the Yelp app, definitely made the arrival experience easier!  <br><br>Our server was very friendly and helpful and the food was brought out in a decent time for how busy they were!<br><br>Avocado toast (gf) was delicious! <br><br>I didn't get to the pancakes but I saw from afar and it smelled and looked delicious (huge portions!) <br><br>Would visit again to try the pancakes and waffles, love the gluten free varieties, so nice to have options!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/6KwtBuTWxaS45Bqc1CXjuQ/348s.jpg", "caption": "Avocado toast on gf bread, delicious!"}]}}, {"review": {"des": "I am always appreciative to see a creative vegan breakfast option.  The servings are huge!<br><br>Justine was a great server.  Everyone was on it there!<br><br>It is definitely worth the wait!", "pics": null}}, {"review": {"des": "Four stars for an excellent breakfast that is worth the wait! I used Yelp to secure a place in line and avoiding waiting nearly an hour outside the restaurant with the large, hungry crowd.<br>When I arrived at the restaurant, I only had to wait about 10 minutes to be seated. Service was friendly and not at all rushed, despite the fact that it was obvious they needed to turn tables over to accommodate everyone who was waiting.<br><br>The corned beef hash was fantastic! I got a side of hollandaise (which was a bit more like bernaise). It elevated my entire breakfast! I'd highly recommend this popular breakfast spot and can't wait to go back.", "pics": null}}, {"review": {"des": "WOW! I was very impressed by this place. The location is near Millenium Park. We were greeted and seated immediately by the staff. We came in at 9:30am and the place was already filling up. <br><br>We decided to share an order of the hash brown skillet but with scrambled eggs. I should have ordered it with a over easy. We also opt for the banana coconut pancake with a side of bacon and sausage link. <br><br>The service is very efficient. My coffee was filled immediately. The food came in fast! Our server Dylan was very pleasant and thorough. The serving positions are HUGE! We had plenty of left overs even after sharing the meal.<br><br>This is a must go to spot when you're in Chicago.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/lQO2SglkdCf2RfEGiboCKA/348s.jpg", "caption": "Side of sausage links and bacon"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ufsyjbFasBUrLQjkAJN7dg/168s.jpg", "caption": "Banana coconut pancakes"}]}}, {"review": {"des": "Not a breakfast/brunch person...this place is incredible wish i lived in Chicago so i could eat it more often......super accommodating especially to vegetarians. Friendly service and everything we ate was good.", "pics": null}}, {"review": {"des": "Brunch brunch brunch!  Who doesn't love brunch?  The cool thing about this place is that you can check in on yelp.  So it's super convenient!  <br>So my friends and I were at our hotel and we put our name on the list.  Walked there and let the hostess know.  We still had to wait about 20 mins but it wasn't too bad.  The weather was nice so we sat outside and waited.   Then we received a text that told us to go inside.  So we did and waited about 5 minutes then we got seated.  Our waiter came to out table (super friendly guy) took our drink order.  Then he came back and We ordered a bbq chicken salad, eggs bene, and an omelette with pancakes.   I don't eat bacon so the waiter offered me turkey bacon.  Which was super nice of him. They brought out my eggs bene and then he realized the kitchen forgot the bacon so he brought me a new one without me even asking!   <br><br>The food was amazing, the service was amazing!  If I'm ever in Chicago again.  I DEFINITELY WILL BE BACK!!!", "pics": null}}, {"review": {"des": "Oh my god..I can't remember the last time I had such an amazing brunch. Wildberry literally had me dumbfounded by how good it was. <br><br>~ Mexicana: hash browns, two eggs, cheddar & jack cheese, Chorizo sausage, roasted jalapenos, avocado, cilantro & onions. This skillet was incredible..perfectly crisp hash browns, melted cheese mixed with hearty <br>Chorizo topped with roasted jalapenos for a nice kick. If you're looking for something with a slight kick in spice, I'd recommend this one!<br><br>~ Butcher Block: hash browns, two eggs, cheddar & jack cheese, ham, sausage, turkey sausage, chicken sausage & bacon. If you've ever watched Parks & Rec, this is literally a breakfast that Ron Swanson would be pleased to eat (it's a meat lovers galore).<br><br>~ Signature Berry Bliss Pancakes: soft & fluffy pancakes topped with some beautiful berry concoction. This was sweet & delicious. I was honestly kinda sad when I had my last bite because this was so good..<br><br>PLS JUST COME HERE TO EAT.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/_1aG44UODlD_azY8qapNBw/348s.jpg", "caption": "Signature Berry Bliss Waffles"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/paQevfeF3P_8V_1hyQGgXw/168s.jpg", "caption": "French Toast"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Yj6CovpvRcCxUc8NOXgdRA/168s.jpg", "caption": "Cinnamon Roll Pancakes"}]}}, {"review": {"des": "Food: Wow the food here is amazing. Not only is there menu well put together and innovative, but you can tell that the quality of the food is on a nother level compared to normal diner breakfast food. All the dishes all well thought out and wonderful, I got the brisket hash and tried some other dishes as well, however the best part of wild berry is by far their pancakes. I would recommended any of their speciality pancakes hoe aptly. Although the the pancakes look super heavy and sweet they are actually extremely light fluffy and not too sweet. They create a sweet dish that doesn't tire you out and makes you want to come back for more. Definitely the best brunch/breakfast place I have been to.<br><br>Atmosphere: very open space and usually super busy. On a Sunday morning we had to wait around 2 hours however the location is right next to millennium park and matey Daley park, so you can walk around to pass the time.<br><br>Price: definitely not on the cheap side, but you get what you pay for. I paid $20+ for breakfast, but as you could see it definitely was worth it.<br><br>Overall: Must go to if you are vacationing in Chicago. Warning, me and all my friends were extremely full after coming here. We could barely eat dinner", "pics": null}}, {"review": {"des": "Quaint breakfast spot right next to Millenium Park with great pancakes and coffee, as well as a large selection of breakfast and lunch items.<br><br>We arrived at 11:00 am and had about a 30 minute wait for a table. My husband ordered breakfast and I opted for lunch.<br><br>He had the corned beef hash skillet with two eggs and hash browns and upgraded to the cinnamon roll pancakes. <br><br>I ordered the chicken salad sandwich with fresh fruit. The sandwich was served on fresh whole grain toast and I had the option of choosing chips, fruit or French fries or sweet potato fries, additional sides choices were soup or side salad for an extra $1.50.  The chicken salad was very flavorful and made with grapes, apples, cranberries and raisins. <br>The fruit was a small serving of fruit salad consisting of cantaloupe, pineapple, strawberries, grapes and honeydew melon. <br><br>I also had a bite of the cinnamon roll pancake which was awesome! I would probably order that if I ever went back.<br><br>Excellent service and the food was fresh and flavorful. Great location next to the park!", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/41JzUH7rEFqTg8HXUHNEfQ/168s.jpg", "caption": "Chicken salad sandwich"}]}}, {"review": {"des": "My face when the hostess said 45 minute wait....<br><br>I stood outside ready to sulk... then like an aberration the man on the patio said he had a table for any party of 4 or less.  He said anyone!  Yay!  No waiting an hour for food :). <br><br>Corned beef Hash skillet with pumpkin pancakes...shut the front door...<br><br>The hash had a crispy bottom..(my favorite kind of bottom). And the eggs were over easy with a perfect runny yolk to bathe my potaters in.  <br><br>Falls on floor from carb coma.   <br><br>Wakes up and finishes off the pumpkin spice pancakes.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/zb1gIOe8RLjKWF_DMNejsA/168s.jpg", "caption": "Cinnamon roll pancakes"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/Ij_TVceHJBFd9xeF85-MqQ/168s.jpg", "caption": "Corned beef hash skillet!  Pumpkin pancakes :)"}]}}, {"review": {"des": "Don't be surprised to see a long line - if you're a SMART YELPER - you'll get on the list from the YELP app and save some wait time. We got on the list, walked from our hotel, and our wait was minimal. #smartYELPer<br><br>I went with the corned beef hash skillet ($14). A pile of hash browns, topped with corned beef, cheddar and jack cheese, and 2 eggs - served in a skillet. The meal includes a side of pancakes and I upgraded those from buttermilk to the cinnamon roll flavor for $2. #worthit #nosyrupnecessary<br><br>Great stuff - this place is close to Millenium Park, just a block from the AON center and two blocks from the Bean (Cloudgate). Seriously a prime location with great food means they need to run like a well oiled machine to keep up with demand. They are and they do. There are 3 other locations and if they are run like this one, kudos to them.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/PUckvldxUOPg4hHbk-1Fog/168s.jpg", "caption": "Upgraded to Cinnamon Roll Pancakes #worthit #nosyrupnecessary"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/EPlfgdIxgJiIRyGEdAtmGg/168s.jpg", "caption": "Homemade Corned beef & Hash Skillet"}]}}, {"review": {"des": "My favorite brunch spot in Chicago! The portions are huge (take your leftovers home), coffee is La Colombe, and best of all now you can get on the waitlist via Yelp!  Tip: upgrade to specialty pancakes or french toast with your egg entree to taste both!", "pics": null}}, {"review": {"des": "I enlisted on the waitlist before my friends and I walked over. It being a weekend it took about 45 min to seat us. Beware, they won't seat you if your party is not complete! We ordered and the order came out fairly quickly. The waiter had ordered me a side of white toast instead of pancakes and he could swear I had said toast, yet he still corrected it. The pancakes are amazing; very fluffy. I also had a soy latte and an omelette. Everything was very tasty. They do try to get customers in and out because they have a lot of people waiting but it is well worth it, just don't go there expecting to hang around.", "pics": null}}, {"review": {"des": "First time visiting Chicago and I checked on yelp places to eat, Wildberry Pancakes was on the top list to try so I thought why not I can give it a try. I made yelp reservation and it was about 30-40 mins but by the time I walked and got to the restaurant, it was perfect timing. I looked on yelp for recommendations and I saw the Benedict's so I got the Los Altos Benedict, it has the chorizo Sausage and I don't eat there so I substituted it for avocado. So I got my food, and for fresh orange juice. The avocado was dark!! The food tasted disgusting!! The eggs were really runny unlike the way it usually is for Benedict's. I don't recommend it to anybody.<br>I would go somewhere else and try something else, not worth the wait. I also think it's over rated.", "pics": null}}, {"review": {"des": "Amazing, worth the wait, and I am drooling...<br><br>First things first, GO ON YELP AND ADD YOURSELF TO THE WAITLIST! The wait here was insane! I came here on a Saturday morning (8:30am) and the wait was about 2 hours because I didn't add myself to the waitlist prior to coming! Granted I spent that time going to Intelligentsia for coffee and explored Millenium Park (and the bean), but 2 hours!!!<br><br>Alright, so the service and food were fantastic. FANTASTIC. I tried their famous berry bliss pancakes (YES GET THIS), their beef hash, and breakfast torta. Their beef came with a side of regular pancakes, so I just subbed these regular pancakes for the famous berry bliss. There is an upcharge, BUT DO IT.  <br><br>The price of everything was super reasonable and we had leftovers. Whatever you do, make sure you come here for breakfast during your Chicago visit. It will not disappoint if you get their famous berry bliss pancakes.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/n7cl1XHsVttXosMQfPkU4Q/348s.jpg", "caption": "Beef hash"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/imOIhd_HygtL74uQlEyhdQ/168s.jpg", "caption": "Famous berry bliss pancakes"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/oNR0XwDAPVDWeRHDGuK0Eg/168s.jpg", "caption": "Breakfast torta"}]}}, {"review": {"des": "I enjoyed this place a lot.  So much so, we ate here 2 times within the trip.  First and most important (which got us to go here) is their system.  Everything is run smooth from a consumer standpoint.  Starting with a wait-list you can join from the yelp app.  You just need to show up 5 mins before your reservation time to check in.  There is plenty of staff helping and keeping things orderly as it is a very crowded place.  As for service, well, that was great too!  Our servers were both attentive, food was brought out quick, hot and accurate.  <br><br>I really enjoyed both my meals.  The avocado toast was different then what I usually have, but very good.  <br><br>As soon as we were done eating and paid the bill, we were never rushed, but once we got up, there was staff ready to clean off the table and turn it over for the next guest.  They are doing it right!<br><br>Definitely on my list of places to return to.", "pics": [{"url": "https://s3-media3.fl.yelpcdn.com/bphoto/ImJ8I53ChAjjFGpI8FIbcA/348s.jpg", "caption": "Veggie patty, delicious!"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/uNLFK3CW6rwsoSKxuH51Sg/168s.jpg", "caption": "Avocado Toast"}]}}, {"review": {"des": "Wildberry Pancakes Cafe is probably the biggest diner I have ever seen. The line for this place is crazy and it seems like everyone tried or heard of this place!!!<br><br>Service: The service is amazing​ since they have to keep their reputation up to a par. Yup ...<br> <br>Food/price: The food option is pretty big and I heard the drinks are also good. I the wildberry pancake is really famous because the sauce for the pancake is on the side of the pancake and omg it is unreal. It is a must! Also the egg benny is also really good! <br><br>Audience: Anybody will enjoy this place: dates, group of friends, a ​family reunion! <br><br>Recommend/tips: I do have to say since the wait might be long (30 min - 2 hours) I would bring something fun to do while you wait...because it is worth the wait.", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/m4N_DEyb7oszq_dnJ5XsMw/168s.jpg", "caption": "the famous wild berry pancake"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/ja4p3T1U4-V3RXCbc0bTbg/168s.jpg", "caption": "egg benny"}]}}, {"review": {"des": "This has been the meeting spot for years for my college friends. Anytime we come back to the city during our holidays, we always have a reunion at Wildberry. <br><br>This place has so many options, and each one is amazing, from the pancakes, to the waffles, to the omelettes, to the sandwiches.  Keep in mind that on the weekends that the lines are SUPER LONG, so plan accordingly, especially in the winter.<br><br>One thing that I hope can change, is a bigger waiting area, rather than waiting outside, pretty much freezing while waiting to be seated. Despite this wait, i can say YOU WILL NOT be disappointed!<br><br>Keep in mind that the portions are huge so sharing is a good idea, but what I usually do is pick an item, tell the waiter/waitress to pack half of it away, and then give it to a homeless person, as there are many, better than wasting food!", "pics": null}}, {"review": {"des": "Well normally love this place but evidently their closing times are \"well unless we feel like closing earlier\" ... something about maintenance? You close at 2:30 and you can't get maintenance done during down time?. Seems very fishy to me. Probably health department <br>In from out of town and had two choices for my last meal ... chose this place and now I'll end up with neither place.", "pics": null}}, {"review": {"des": "I'm looking at my review from a long time ago and to be honest at this point, if Wildberry isn't top-shelf in the brunch-space, then I don't know who else is. I have tried and tried countless brunch places over the past few years, and nothing quite measures up. I mean, I don't think they have the best waffles or the best veggie burger, but somehow when you look at  it as a package, they're just the best. Even after trying so many options around Chicago, the family always ends up preferring Wildberry. Big-time props to them.<br><br>I have just one suggestion for them - can you please open up a location in the West Loop? That would make this a no-competition choice for us every time.", "pics": null}}, {"review": {"des": "This place is WAY overhyped!!! I do not understand the yelp ratings this place has. <br>Luckily we came on a Monday morning around 830 am so we did not have to wait at all to be seated. We went with the signature bliss pancakes and the corn beef hash. The pancakes were a huge portion of 5 pancakes. Seemed mostly plain with a hidden blueberry here and there. They were topped with some sauces and an abundant amount of fruit on the side. The pancakes were ok, but really nothing special. I prefer my pancakes to be much fluffier. These were more on the side of sticky. <br>The corn beef hash was just terrible. The meat tasted like it came out of a can and honestly just made the whole dish inedible. The rye bread toast that came out on the side was the best part of the dish.<br>I honestly cannot understand all the hype and I would definitely never wait for this place!! There must be better breakfast places in Chicago...", "pics": [{"url": "https://s3-media4.fl.yelpcdn.com/bphoto/jYel8caALVnA19ooHq51CA/348s.jpg", "caption": "Signature berry bliss pancakes"}]}}, {"review": {"des": "This is one of best breakfast place in town, I love stopping here when we I'm in the Chicago area.<br>Can't go wrong ordering anything at this great place.<br>Highly recommended", "pics": null}}, {"review": {"des": "First stop in Chicago after a red-eye flight and Wildberry did just the trick! I was glad to see Wildberry open really early; it's a shame that they don't offer breakfast all day since they close at 2:30 PM everyday. There's bound to be a wait when you go so I would suggest putting your name on the wait list ahead of time via Yelp. I love that feature! We timed our arrival to the restaurant around when our name would be called. Talk about efficiency!<br><br>The portions here are huge. I opted for the butcher block skillet with the signature berry bliss pancakes and I thought it was pretty good. The pancakes were the home run for me. It was like biting out of a cloud! Had I known the pancakes would be that good, I wouldn't just ordered pancakes and nothing else. With that said, I appreciated how the skillet kept the dish warm but wasn't amazed by it. If you're a meat lover, you'd enjoy the butcher block but I thought the dish was alright. There are a ton of different meats where you kind of feel overwhelmed by it.<br><br>Wildberry is a great choice for breakfast. If you're planning to come here, I would highly suggest putting your name down on the wait list ahead of time via the Yelp app.", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/L_L8rHhX2xerxZXZgoNYkQ/348s.jpg", "caption": "Condiments"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/m_-OjDmqEeYYcb2ERbULiA/168s.jpg", "caption": "Homemade Corned Beef Hash"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/whIv9d-Ms3WgiPiFJZYaeA/168s.jpg", "caption": "Butcher Block skillet with signature berry bliss pancakes"}]}}, {"review": {"des": "Their food is amazing and very filling! You can join the waitlist on yelp and you get seated very quickly. Patio seating is also available and in good weather it's amazing!", "pics": null}}, {"review": {"des": "I've been spoiled by the brunch in San Diego so wasn't expecting too much, but this place is fantastic. <br><br>We were (somehow) seated in 15 minutes for a party of 6 on Sunday.<br><br>One great thing about their menu, you can order a savory entree and upgrade the side of toast to specialty pancakes/waffle for an upcharge. <br><br>I shared the Mexicana Skillet (one of the best breakfast entrees I've tasted to date) and the Berry Bliss Waffle ($5 upcharge) and the meal was a perfect size for 2 at ~$22.<br><br>True to their name, they make an amazing berry sauce + mascarpone.<br><br>If the wait is long you can check out Millenium Park across the street and take photos at the Bean. I highly recommend this spot on a visit to Chicago!", "pics": null}}, {"review": {"des": "Knowing how busy this place can be, we put our names down on the Yelp reservations, which was very convenient for us to know exactly when we should head out. <br><br>The environment is very relaxed and cafe style, nothing fancy. We ordered four dishes for four of us and it ended up being a lot of food. We got two of the skillets, Mexican and Garden and the southern biscuits Benedict, Southwestern BBQ salad, and then the pancakes we upgraded with our skillets were the chocolate chip banana and mixed berry. For the value and amount of food, we were happy with our choices. It is heavy and a lot of food but was the perfect brunch spot and worth stopping by if you're looking for a casual spot. Note, they do not have any alcoholic beverages for anyone wondering.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/eXnoUbbEgw5yK6pT4LF_Qw/348s.jpg", "caption": "Southern Benedict"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/wI4IvNNsksUEprW-sB5-6w/168s.jpg", "caption": "Bbq salad"}, {"url": "https://s3-media4.fl.yelpcdn.com/bphoto/tp1lywQSn8EuivxcLbhcPQ/168s.jpg", "caption": "Mexican skillet"}]}}, {"review": {"des": "Love: the queue system via Yelp, which means we didn't have to leave our hotel until we knew that we would be seated, saving us a good 30 minutes of standing in the rain.<br><br>Love: gigantic portions. My boyfriend and I split the brisket hash with a side of signature berry pancakes, and we couldn't finish either dish.<br><br>Like: the brisket hash, though it was a bit underseasoned and the brisket overcooked. The rich sausage gravy and crispy hashed potatoes were perfect, though.<br><br>Meh: the pancakes. How?? Not nearly fluffy enough, and nothing interesting about the toppings. Tasted almost like IHOP.<br><br>Ugh: iced coffee, definitely do not recommend.", "pics": null}}, {"review": {"des": "Fearing the long wait time for a table based on other reviews, we went super early around 7am on a Monday to beat the crowds. There was no wait for a table at all, and we were seat promptly upon entering.<br><br>The berry bliss pancakes ($13) were heavenly, the perfect balance of sweet and tart! Lots of berries included on the side as well. Portion size was big, bf and I shared the pancake plate and an egg/sausages/hash browns on the side, we both left happily full.<br><br>Service was good, bathrooms were plentiful and clean. <br><br>As we were leaving around 8am, there started to be more of a crowded but still plenty of empty tables.<br><br>Located conveniently across the street from Millennium Park nearby Cloud Gate (bean)", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/RFkTN1XURTljC7ZbcQj9Ow/168s.jpg", "caption": "Signature Berry Bliss Pancakes"}]}}, {"review": {"des": "Location, location, location. It matters even for a brunch place but Wildberry is situated right across from The Bean and Millennium Park so it's a great place to grab brunch before going on a day's worth of tourist adventures. I went as a party of two on a Tuesday around 11 and by then the queue had already reached 20-30 when we lined up. SUGGESTION: Join the wait on Yelp beforehand as you walk over so that you don't get there to realize there's a 30-40 minute wait. Definitely check in on Yelp beforehand. Super convenient!<br><br>My girlfriend and I are abnormally large eaters so we ate a meal that could easily feed 3 people. We got their famous Berry Bliss Pancakes and they're a must-eat when coming here. It even says so in their name! it was fluffy and buttery and the sauce wasn't overwhelmingly sweet and came with a generous amount of berries. Definitely would recommend this stack of pancakes for people looking for a sweet brunch option.<br>Second, we got their Los Altos Eggs Benedict and that was delightful as well. It had great flavor with nice spicy additions with some hot sauce. The chorizo was extremely savory and it wasn't too big of a portion but you'll enjoy every bite of it. (Also comes with a side, we got fruit)<br>Finally, we got their Butcher Block Sizzling Skillet to top things off. There were all the different kinds of breakfast meats on a skillet with eggs and hash browns. Definitely eat this with ketchup if you love it as much as we do. A generous amount of heavy meats, cheese, and potatoes but we as a couple eat abnormal amount. This is a very staple American Breakfast dish.<br><br>There were a lot of reviews regarding service and wait time. We were served almost right after we were called at the front of the queue. Our server was great and super nice despite it being extremely crowded. If you want to avoid the only negative aspect of Wildberry, just use the Yelp App to join the queue. If you do, then there shouldn't be anything stopping you from loving this place.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/UR7Kl3ms9MWI9_9JVbbdHw/168s.jpg", "caption": "Hopefully an aesthetic view of the Signature Berry Bliss"}, {"url": "https://s3-media2.fl.yelpcdn.com/bphoto/1xnM0pmgTY13n3F6XW2gzg/168s.jpg", "caption": "Our entire meal for 2! We eat a lot hehe"}]}}, {"review": {"des": "This place makes AMAZING waffles! The berry bliss Belgian waffles are a must-try if you can't decide. I've had the same flavor in pancakes and waffles, and for me the waffles triumphed. <br><br>Their sizzling skillets are great. My boyfriend and I really enjoyed the butcher block. It's definitely big enough to share between two people, especially if you want only a taste of sausage, bacon, and other meats. <br><br>There's no wait if you come at 7 or 8 on a weekday. I know it gets really busy around noon.", "pics": null}}, {"review": {"des": "I've never felt so positively about a brunch place in my life. The wait, upon reading reviews, seemed so daunting (we heard the hostess say an hour and 45 minutes at the door when we came in with our name already on the list.) It was also Lollapalooza weekend (what we'd been in town for) so the place was extra busy.<br><br>Luckily they use the Yelp waitlist system which worked superbly. I'd never used yelp to wait on line before, but I am glad we gave it a shot. I put my name on the waitlist as I was laying in bed scrolling through our brunch options. Upon having showered and getting dressed, I saw that the 134 parties ahead of us got cut down to 37 (they give you an estimate of what time to be at the restaurant.) I like to be a little early so we care in about 19 minutes before our \"estimated time\" of 12:50. As soon as we got to the hostess, she goes, \"oh! I was about to text you guys next\" and we were in 3 minutes later.<br><br>SO SICK! The efficiency was real. You gotta pay attention, NYC.<br><br>Friendly staff, big restaurant with lots of seating that seems always packed to the brim. A little weird that they close at 2:30 everyday but sure. We were seated and our drink orders were taken a few minutes later. Because of how big this place is and how many people they can accommodate at once, service feels just a little bit rushed, but this is common for popular places such as this. You can't be popular and not be uber efficient. Our food came out legitimately not even 10 minutes after our drinks. So impressive.<br><br>And UGH. So. friggin. good. I'm just blown away by ya, Wildberry. I got the corned beef has skillet (yuuum) with scrambled eggs, and an additional stack of two blackberry key lime pie pancakes (SUPER yuuum!!!!)<br><br>My boyfriend got the same type of pancakes and the Mexicano skillet, which he also loved.<br><br>I highlyyyyy highly highly recommend this place and will be coming back every time I'm in Chicago.", "pics": null}}, {"review": {"des": "Visited on a Wednesday morning around 8:30 and was pleasantly surprised to find there was no wait. We were quickly seated in a spacious booth. Our energetic and friendly waiter arrived almost immediately to take our drink orders. I opted for the seasonal version of iced green tea (pineapple Jasmine green). It was served unsweet, which I prefer, and had a fresh flavor. <br><br>I am not usually into super sweet breakfast foods, so I decided to order two eggs any style (scrambled) with sausage patties. I opted for the hash browns and pancakes. The eggs and hash browns were nothing to write home about, but the sausage was super tasty and the buttermilk pancakes were phenomenal - some of the best I've had. I actually found myself wishing I had more pancakes. Therefore, if I am to return, I will definitely direct my attention to the pancake selections.  <br><br>Our service was quick and friendly. Based on how busy the restaurant was, I was shocked by how quickly our food came out.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/Lzsn4l7k7Q5TRfX3p_OOoQ/348s.jpg", "caption": "Buttermilk pancakes that accompany the 2 eggs plate"}, {"url": "https://s3-media3.fl.yelpcdn.com/bphoto/tToZ8f3J7rqp3OHjBupW7A/168s.jpg", "caption": "2 eggs + plate"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/hQ80K4ipWtYCMGUtGxKB4A/168s.jpg", "caption": "Condiment plate"}]}}, {"review": {"des": "Located just off of Michigan Ave, this breakfast spot is very popular & rightfully so- its delicious! <br><br>Waited over an hour on a Saturday morning but soon enough enjoyed a fluffy, delicious omelette and their signature berry pancake. The restaurant was staffed well and our server had many recommendations, which is always appreciated. <br><br>The only thing that would have made it better is a mimosa- which isn't on the menu- but nonetheless excellent meal!", "pics": null}}, {"review": {"des": "The place is packed. My best parents arrived a few minutes before us and they do not seat until the whole party arrives. We got there and my wife was outside on a work call. They sat us counted and said we needed to wait up front till the whole party arrives. We tried explaining that she was coming but no. My wife came in 1.5 minutes later and they took us to the same table. My Dad is a diabetic so he gets Hangry until he gets breakfast so it was getting stressful. <br>After being sat it took a little while to get service. <br>My food was pretty good actually I had the Butcher Block Skillet and cinnamon roll pancakes. It just took a while. My wife's omelette was not like an omelette, it was more of a scramble with old veg. <br>The server was attentive and helpful.<br>Overall from the seating it kind of upset me. <br><br>I will probably not return.", "pics": null}}, {"review": {"des": "Over 5k reviews? Yes of course I had to try it! We came here on a weekday and the wait was about 45 minutes to an hour. You can request to be on the waitlist through Yelp. We didn't try the pancakes but we ordered the Corned Beef Benedict and it was delicious! Definitely worth the wait. Great service and such friendly employees.", "pics": [{"url": "https://s3-media1.fl.yelpcdn.com/bphoto/HjzZA8Dd9sSv0RKTlo6Upg/348s.jpg", "caption": "Corned Beef Benedict"}]}}, {"review": {"des": "Thought this was going to be an overhyped tourist trap, but it was so good I ended up coming here twice during my trip. There's always a wait, but it goes by pretty quickly, and you can also put in a reservation online.<br><br>I got the wildberry pancakes, waffles, bacon, and coffee. The pancakes and waffles are unique and delicious. They're denser than most places, so I wonder if they use a lot more flour or butter than most places, but it's not overdone and works perfectly with all the toppings they add. All the fruit and syrup on top was perfect in the sense that the syrup wasn't overwhelmingly drenching the pancake, so each bite felt pretty balanced.<br><br>The portions are also pretty generous, and I really wish we had something similar here in New York because I'd add it to my regular list of restaurants.<br><br>Service is also extremely friendly!", "pics": null}}, {"review": {"des": "Tl;dr - GIANT, heaping midwestern portions at reasonable prices. This is as good as breakfast food gets.<br><br>Went for brunch, and am pleased to say that the quantity lives up to the quality. Got the corned beef hash entree (corned beef, hash brown OR fruit, 2 x eggs, toast OR pancakes). I chose the pancake option for $2 more, coming out to $15, and it destroyed me. The entree was conservatively 4 breakfasts in one, and I didn't get to finish :( <br><br>If you want sweet, they have a whole range of pancakes, waffles, crepes, French toast, parfaits. If you want savory, they have corned beef (my personal fav), eggs Benedict, some healthier options.<br><br>Hits: must get the fruit juice (not sure if fresh squeezed juice cause it was literally 20 fl oz for $4 - SUCH a steal), and corned beef hash.<br><br>Misses: Nothing. I genuinely enjoyed everything I tried and would get it again.<br><br>Tips: ask for hot sauce!", "pics": [{"url": "https://s3-media2.fl.yelpcdn.com/bphoto/gF8xxkyN3xIiHjwbWO9B6Q/348s.jpg", "caption": "Fresh Grapefruit Juice - 5/5, look at how much you get! Great value"}, {"url": "https://s3-media1.fl.yelpcdn.com/bphoto/mBbMA1cB7cW-NAVFcSfQdw/168s.jpg", "caption": "Signature Berry Bliss +  Homemade Corned Beef Hash 5/5"}]}}, {"review": {"des": "The food was good, but the service was a little all over the place. I work in the prudential building and my team and I wanted a table for 8 people. I went down at 10:45 hoping to get a table between 1130 and 12. I walked down to the lobby and into the cafe, the woman taking walk in reservations (this is the only way you can get a table) said it would be a 30-45 minute wait. I said \"no problem\" and put my name in. 10 minutes later, the table is ready. None of my coworkers are able to drop everything and go an hour earlier than we planned, so I went back down to see what they could do. Well, cut to me missing the 5 min window, being put back on the list, not getting a table until 12:15 and having 1/2 the team not being able to eat. <br><br>Long story short, good food but a pain in the butt to eat at.", "pics": null}}, {"review": {"des": "Absolutely wonderful! I enjoyed the Rutherford omelette and it was so delicious. A perfect combination of flavors. My sister had the highly recommended Mexicana.... and loved it.  The pancakes where amazing-super light and fluffy. I was glad we got the regular buttermilk which allowed us to really taste it. <br><br>Our waitress was so nice and recommended great options as a first timers.  <br><br>Overall, we enjoyed our breakfast. <br><br>Pro Tip:<br>The line is long. Be prepared to wait. It's worth it. Or carry out .", "pics": null}}, {"review": {"des": "I love that they use Yelp waitlist! It's so easy to check on the wait time and get on the wait list if you need to. Luckily, my mom and I decided to go on a weekday morning around 8am and were able to get an outdoor seat without waiting at all! The next morning (which was a Friday) I checked the waitlist for fun at the same time at the wait was 45 min-an hour (so if you have flexibility, go during an off-peak time!)<br><br>I am SO glad that my mom and I decided to split an entree because the portion sizes are HUGE. We ordered the Mexicana skillet and upgraded the pancakes to the Berry Bliss pancakes. This meal was soooo good and filling. I know this is a touristy spot, but they really deliver on great food. Service was also very prompt and friendly!", "pics": null}}]}